{
    "id": "enslavers-redux",
    "name": "Starcraft: Enslavers Redux",
    "shortName": "Starcraft: Enslavers Redux",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/81/711/62/62/636178333677949232.png",
    "description": "## ![null](<https://media-elerium.cursecdn.com/avatars/81/711/636178333677949232.png>)\n\n## Starcraft: Enslavers Redux\n\n### **Description**\n\n> Enslavers Redux is a multi-episode campaign remake/reboot based off of the original Enslavers and Dark Vengeance custom campaigns for Starcraft 1 and using the actual lore of Starcraft to help bridge the gap between episodes. It features the following:\n> \n> - 30 Missions across 3 campaigns (6 per ep canon, 9 total per ep, +3 epilogue missions) with unique A and B canon arcs depending on the choices you make.\n> - An entirely brand new plot and custom text dialog brings the full untold Enslavers story to new life based off of the original Enslavers story and the Dark Templar Trilogy with links to both Starcraft and Starcraft II.\n> - Play as new customized heroes such as Commander of the Dominion Alpha Squadron, Gui Montag, General Warfield, Selendis, Mohandar, Ethan Stewart, as well as original favorites re-customized such as Tom Kazansky, Magellan, Warbringer, Mojo, Zeratul, Eredas, Zagara and Kerrigan with new dialog, new abilities, and new stories as they help drive the Enslavers plot.\n> - Powered by the Starcraft Mass Recall mod\n> \n> \n\n### **Developer's Note**![null](<http://vignette4.wikia.nocookie.net/starcraft/images/4/45/DarkArchon_SC1_HeadAnim1.gif/revision/latest?cb=20160104211240>)\n\n> When someone usually asks you what they think of when they hear the title Starcraft Enslavers, memories of brutal difficulty and monotonous gameplay with little plot usually come to mind. Both Enslavers and Dark Vengeance were very quick, watered down campaigns aimed at showing the player how one can build a custom campaign in the map editor. However they also introduced an important element to the Starcraft timeline...understanding what was going on behind the scenes of the main episodes of Starcraft and Brood War. This is a very interesting topic to explore given that fact that we have a mercenary army capable of controlling Zerg along with an ancient Protoss bent of vengeance. Both of these have ties into the overall Starcraft story arc of what Duran was originally trying to do to upset the balance of the sector while finding a way to merge the Zerg and Protoss DNA to create the hybrids.\n> \n> Thus, this complete custom campaign is a new reboot based off the original campaigns in order to do what the original could do not. Tell an engaging and compelling story of what occurred between and during the main episodes of Starcraft while understanding a bit more about what Ulrezaj was up and what role he played in Duran's plan. However, creating this campaign solo is a large undertaking and as such....there WILL be bugs! Anything in these maps can be improved overtime. I encourage anyone who plays through these maps to please list your comments on anything you notice that seems bugged or anything you'd like to mention that is positive or constructive criticism that would help improve this campaign.\n> \n> If you would like to play a chronological playthrough from the beginning of Starcraft through the end of Starcraft 2, this is the historical order:\n> \n> - SC EP1 - Rebel Yell\n> - SC EP2 - The Overmind\n> - ER EP1 - Shadow of Deception\n> - SC EP3 - The Fall\n> - BW EP4 - The Stand\n> - BW EP5 - The Iron Fist\n> - ER EP2 - Dark Vengeance (starts mid-Iron Fist and ends just after Iron First ends)\n> - BW EP6 - Queen of Blades\n> - ER EP3 - Twilight Falls\n> - ER EP4 - Enslavers Redux Epilogue\n> - SC2 EP1 - Wings of Liberty\n> - SC2 EP2 - Heart of the Swarm\n> - SC2 EP3 - Legacy of the Void\n> - SC2 EP4 - Starcraft II Epilogue\n> - SC3...?\n> \n> \n\n### ![null](<http://vignette2.wikia.nocookie.net/starcraft/images/4/4c/ArcturusMengsk_SC2_Art2.jpg/revision/latest?cb=20110814133340>)\n\n### **Story Introduction**\n\n> [Episode I: Shadow of Deception](<https://www.sc2mapster.com/projects/enslavers-redux/pages/episode-1-strategy-guide>) - Set between StarCraft I Episodes 2 and 3, Deception begins with Arcturus Mengsk and the newly formed Dominion as they launch a new initiative to silence all outlaws who would act against Dominion law, starting with notorious mercenary Alan Schezar. However, a lone Commander of the Dominion Alpha Squadron soon realizes Schezar's intentions are far greater and darker than anyone could have imagined...\n> \n> - [Mission Guide](<https://www.sc2mapster.com/projects/enslavers-redux/pages/episode-1-strategy-guide>)\n> - [Achievement Guide](<https://www.sc2mapster.com/projects/enslavers-redux/pages/achievement-guide/episode-i-achievement-guide>)\n> - [Story Guide](<https://www.sc2mapster.com/projects/enslavers-redux/pages/episode-i-shadow-of-deception>)\n> \n> \n\n> [Episode II: Dark Vengeance](<https://www.sc2mapster.com/projects/enslavers-redux/pages/enslavers-redux-gameplay-guide/episode-2-strategy-gude>) \\- Set between the end of Starcraft Episode 4 and the middle of Episode 5, Dark Vengeance begins with Zeratul and the Protoss, finding new protection on Shakuras after having it been cleansed of Zerg, deciding now to return to Aiur to find any remaining Protoss survivors. What begins as a rescue mission soon escalates into dark plot to subjugate both Protoss and Zerg to bring about a vengeance aeons in the making...\n> \n> - [Mission Guide](<https://www.sc2mapster.com/projects/enslavers-redux/pages/enslavers-redux-gameplay-guide/episode-2-strategy-gude>)\n> - [Achievement Guide](<https://www.sc2mapster.com/projects/enslavers-redux/pages/achievement-guide/episode-ii-achievement-guide>)\n> - [Story Guide](<https://www.sc2mapster.com/projects/enslavers-redux/pages/enslavers-redux-story-guide/episode-ii-dark-vengeance>)\n> \n> \n\n> [Episode III: Twilight Falls](<https://www.sc2mapster.com/projects/enslavers-redux/pages/enslavers-redux-gameplay-guide/episode-iii-strategy-guide>) \\- Set between the end of Starcraft Brood War and Starcraft II Wings of Liberty, Twilight Falls begins with Kerrigan, having crushed all opposition to her, returning back down to Char while designing a new Zerg hierarchy after purging all remaining Cerebrates. However soon after, sensing a strong psionic presence across the void, Kerrigan begins a journey that will bring her to both the most terrifying foe she has ever encountered and a prophecy of the true darkness still yet to come...\n> \n> - [Mission Guide](<https://www.sc2mapster.com/projects/enslavers-redux/pages/enslavers-redux-gameplay-guide/episode-iii-strategy-guide>)\n> - [Achievement Guide](<https://www.sc2mapster.com/projects/enslavers-redux/pages/achievement-guide/episode-iii-achievement-guide>)\n> - [Story Guide](<https://www.sc2mapster.com/projects/enslavers-redux/pages/enslavers-redux-story-guide/episode-iii-twilight-falls>)\n> \n> \n\n> [Enslavers Redux Epilogue](<https://www.sc2mapster.com/projects/enslavers-redux/pages/enslavers-redux-gameplay-guide/epilogue-strategy-guide>) \\- Set just before Wings of Liberty, the Enslavers Redux epilogue will feature the final conclusions of the three primary heroes of each episode. The battle hardened ex-Dominion Squadron Commander looking to start a new life but instead finding a horrifying Dominion project that he must stop. Kerrigan, the Queen of Blades, still reeling from her experience of learning about the hybrids to take the fight directly to her ex-consort, Samir Duran. And finally the illusive Dark Templar Zeratul, recently rejuvenated from his long self-exile after murdering the matriarch Razagal, traveling to an unknown world and must prepare for a battle which will set in motion the events of the fate of the entire galaxy...\n> \n> - [Mission Guide](<https://www.sc2mapster.com/projects/enslavers-redux/pages/enslavers-redux-gameplay-guide/epilogue-strategy-guide>)\n> - [Achievement Guide](<https://www.sc2mapster.com/projects/enslavers-redux/pages/achievement-guide/episode-iv-epilogue-achievement-guide>)\n> - [Story Guide](<https://www.sc2mapster.com/projects/enslavers-redux/pages/enslavers-redux-story-guide/episode-iv-epilogue>)\n> \n> \n\n### ![null](<http://vignette3.wikia.nocookie.net/starcraft/images/c/cf/Nerazim_SC2-LotV-R_Cine1.jpg/revision/latest?cb=20151005072246>)\n\n### **How to Play**\n\n> 1) Download the latest SCMR Mod. This custom campaign is powered by the SCMR mod. Do not use older mod versions or the SCMR Retro Mod. Please use the following to download this first, or use the SCMR page for the latest release. Place this mod in your mods folder of your Starcraft II installation (Typically located in \\Starcraft II\\Mods\\)\n> \n> [SCMR 7.0.0](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/2654551>)\n> \n> [SCMR Official Project Page](<http://www.sc2mapster.com/maps/starcraft-mass-recall/>)\n> \n> \n> \n> 2) Download the Enslavers Redux campaign compressed file folder and unzip. Within you should see a folder called \"Enslavers Redux\" which contains all the maps you'll need and the campaign launcher. (If not create a folder called **Enslavers Redux** and place launcher map and Episodes I,II, and III folders within here)\n> \n> [Enslavers Redux 5.00](<https://www.sc2mapster.com/projects/enslavers-redux/files/2660926>)\n> \n> \n> \n> 3) Move the Enslavers Redux folder and all contents within to your Starcraft II maps folder or create one if it does not exist (Example of how your file path should look: \\StarCraft II\\Maps\\Enslavers Redux\\) In this location now, you should see the campaign launcher and Episodes I, II, III folders.\n> \n> \n> \n> 4) Open the Enslavers Redux Campaign Launcher in the SCII map editor and click Test Map at the top right.\n> \n> \n> \n> 5) You can play locally offline from here or you can play on Battlenet. To do this, save your map at any time in Enslavers Redux. Then click Show In folder button. This will minimize the game and open the save file's folder. Copy this save file to your Battle.net account (Typically located here: \\Documents\\StarCraft II\\Accounts\\ACCOUNT<br>\n> \n> Saves\\Multiplayer\\) Then close out of the game and SCII editor, run SCII in Battlenet, go to Campaign, Load Save file, Multiplayer, and your save file should be located here. Please note, you should only play continuously either in or out of Battle.net throughout the campaign due to saved data that the game depends on which is different between games loaded from Battlenet or offline.\n> \n> \n> \n> 6) Please note, there is no voice acting for this campaign as none existed in the original either. You must enabled in-game subtitles to see the transmissions of in-game unit text. This can be done by going to **Menu -> Options -> Gameplay -> Display Subtitles**. This is an English Localization. For those using other language versions, I have moved ***MOST*** English text dialog over to use other language files, but in case you still see any \"Param\" errors, please do the following if you are not using EN\\_US language data from within the game itself: Press F10 -> Options -> Language -> chose \"English (US)\". *Please note, some copies of SCII do not have this option.*\n> \n> \n> \n> 7) Ensure both \"Subtitles During Cutscenes\" if CHECKED and \"Enable Simple Command Card\" is UNCHECKED. This will improve your playback experience for Enslavers Redux.\n\n### ![null](<http://vignette1.wikia.nocookie.net/starcraft/images/5/56/Zeratul_SC2_Art1.jpg/revision/latest?cb=20100711023628>)\n\n### **Changelog**\n\n> [Master Changelog for all versions here](<http://www.sc2mapster.com/maps/enslavers-redux/pages/master-changelog/>)\n\n### **Credits**\n\n> **Powered by the SCMR Mod**<br>\n> \n> <br>\n> \n> [Click here to view full SCMR credits](<http://www.sc2mapster.com/maps/starcraft-mass-recall/pages/credits>)<br>\n> \n> <br>\n> \n> ****Campaigns creation by:****\n> \n> - OmegaWeaponX85\n> \n> \n> \n> **Map design inspiration based on:**\n> \n> - The original Enslavers/Dark Vengeance SC2 remake by Opugg / Opupu\n> \n> - Starcraft: Mass Recall by the SCMR team\n> \n> - Starcraft II: Wings of Liberty, Heart of the Swarm, Legacy of the Void by Blizzard Entertainment\n> \n> \n> \n> \n> **Story inspiration based on:**\n> \n> - The Enslavers and Dark Vengeance custom campaigns for Starcraft I by Blizzard Entertainment\n> \n> - The Dark Templar Saga by Christie Golden\n> \n> \n> \n> \n> **Custom Enslavers Redux models by:**\n> \n> - Kanitala\n> \n> - Alleyviper85\n> \n> - GhostNova\n> \n> - Hammer107\n> - Thrikodias\n> \n> \n> \n> **Special thanks to:**\n> \n> - Telenil\n> \n> - Jayborino\n> \n> \n> \n\n![null](<http://vignette4.wikia.nocookie.net/starcraft/images/5/55/InfestedKerrigan_SC2_Art3.jpg/revision/latest?cb=20100711023113>)\n\n\n\n**Disclaimer:** Enslavers Redux is a completely custom campaign based on the original Enslavers and Dark Templar stories. It is in no direct affiliation with the authors of those stories.\n\nMore custom campaigns like this can be found at the [Custom Campaign Initiative](<http://www.sc2mapster.com/maps/custom-campaign-initiative/>)\n\nIf anyone has a great screen shot they want to share of either a cutscene or an action battle please post it here and I'll add it to the photo section and/or mission summary!\n\n\n\n![null](<http://vignette3.wikia.nocookie.net/starcraft/images/c/ca/HybridSomething_SC2_Art1.jpg/revision/latest?cb=20080513225742>)\n\n",
    "author": "omegaweaponx85",
    "lastUpdated": "2019-01-30T15:45:22.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/159/727/ER_Logo.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/211/603/new_terran_hud.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/211/753/new_protoss_hud.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/219/769/1.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/219/770/2.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/219/831/er_screenshot2017-06-22-15_54_59.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/219/832/er_screenshot2017-07-25-11_11_30.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/219/833/er_screenshot2017-08-03-18_06_08.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/219/834/er_screenshot2017-11-10-16_01_23.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}