{
    "id": "starcraft-mass-recall",
    "name": "Starcraft: Mass Recall",
    "shortName": "Starcraft: Mass Recall",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/80/869/62/62/636178324538244311.png",
    "description": "**![Starcraft: Mass Recall](<https://image.ibb.co/bCAiZo/nBSvQJQ.jpg> =730x236)****<br>\n\n**\n\n## <span style=\"font-size:24px\"><strong>Starcraft: Mass Recall</strong></span>\n\n\n\nStarcraft: Mass Recall is a project that recreates the classic Starcraft and Brood War gameplay as well as the entire single-player campaigns within the Starcraft 2 engine. Mass Recall contains 68 maps, 59 from the original Brood War game, 3 that were hidden or deleted on various Starcraft supports, and 6 from the 1998 demo campaign.\n\nThis mod can be used with any Starcraft 2 version, including the free [Starter edition](<https://us.battle.net/account/sc2/starter-edition/>).\n\nDo not hesitate to leave feedback or suggestions in the comments below.<br>\n\nAlso check out: <br>\n\n<br>\n\n our [project thread at TeamLiquid](</linkout?remoteUrl=http%253a%252f%252fwww.teamliquid.net%252fforum%252fstarcraft-2%252f303166-starcraft-mass-recall-sc1-campaigns-on-sc2-thread>)<br>\n\n a [commentated playthrough](<https://www.youtube.com/playlist?list=PLMmfhvBzj4FB3tsiNV3d7B2K_9Imbtg6B>) by Jayborino (v6.x, hard difficulty)<br>\n\n a [playthrough](<https://www.youtube.com/playlist?list=PLVKXOOxlEzot8j22agRWctn5X0YOruFcj>) by professional Starcraft 2 player [Crank](</linkout?remoteUrl=http%253a%252f%252fwiki.teamliquid.net%252fstarcraft2%252fCranK>) (HotS version, hard difficulty)\n\n---\n\n## <span style=\"font-size:24px\"><strong>Top News (Apr 3, 2019):</strong></span>\n\n\n\n-\n\n### **BRUTAL DIFFICULTY ENTHUSIASTS WANTED**\n\n\n\nReports of our demise have been greatly exaggerated. It's taken too long for sure, but we're getting close to releasing the rest of the campaigns for the latest 7.X overhaul of the mod. We are now looking for testers for the brutal difficulty setting of the upcoming Brood War episodes 4-6, as well as the extra campaign \"Loomings\" aka \"Precursor\".\n\n\n\nBe advised: this difficulty is meant to be unforgiving and won't be for everyone. You should expect to have a hard time. We would hope you have previous experience in Starcraft 2 at the very least, preferably also in Mass Recall or Brood War. Having completed or even played some of MR on hard or brutal difficulty is certainly a plus. The latest available versions of episodes 1-3 include a brutal difficulty setting, in case you want to try a map or two to get a better idea of what this is.\n\n<br>\n\nWe're looking to have you test one of the four campaigns mentioned above. We won't expect you to grind through every map from start to finish, so don't fret. Naturally, we would appreciate some level of feedback afterwards to answer these questions:\n\n\n\n- Are there maps that don't give you a chance? (you get crushed early on, you've tried a couple of times and don't see any significant mistakes in your play)\n- Are there maps where you run out of steam? (you can make it to 15-20 minutes but can't seem to make any progress with the resources available to you in the early/mid-game)\n- Are there wild difficulty swings within maps? (for example, no room for error in the first 10-15 minutes, afterwards the AI doesn't pose any threat)\n- Are there difficulty swings within the campaign? (some maps being noticeably easier/harder than others)\n- Are there any other issues affecting gameplay?\n\n<!-- -->\n\nAgain, we're evaluating the brutal difficulty here specifically. If you're interested, send me a PM and state your preferred race/campaign, if any. I'll get back to you with more details sometime this week. That is to say I might not respond right away but if we're already full, I'll try to notify you ASAP.\n\n\n\n\n\n### <span style=\"color:#f00\"><strong>Jan 1st, 2019</strong></span>\n\n\n\n\n\n**<span style=\"color:#f00\">Starcraft: Mass Recall 7.0 is live!</span>\n\n** We are proud to release the first 3 episodes of Starcraft in Mass Recall for the new 7.0 version! This updated version is the latest and most complete Mass Recall experience to date which includes a slew of new Starcraft: Remastered features including remastered briefings rooms, loading images, story cinematics, improved FMV cinematics, enhanced audio tracks, and more. You can download the project under \"Files\" and follow instructions for loading.\n\n\\- Stay tuned for the Brood War episodes being released as well as updated \"Extra\" campaigns, including Loomings, Stukov Series, and the custom remake of Enslavers in Enslavers: Redux!\n\n---\n\n## <span style=\"font-size:24px\"><strong>Trailers</strong></span>\n\n\n\n### Mass Recall 7.0 Preview Trailer #\\`1\n\n\n\n<span><iframe allowfullscreen=\"allowfullscreen\" src=\"https://www.youtube.com/embed/fjpEVQKKKnk?wmode=transparent\" height=\"358\" width=\"638\"></iframe></span>\n\n---\n\n## <span style=\"font-size:24px\"><strong>Latest News:</strong></span>\n\n\n\n### Jan 1st, 2019:\n\n- SCMR v7.0 is out, including the first three episodes for now. See the Downloads section below. Stay tuned for the rest. Only available in English at the moment.\n\n<!-- -->\n\n### Dec 5th, 2018:\n\n- We're nearly complete for a brand new 7.0.0 version of the SCMR mod and the SCMR project itself. This new update is going to be the most complete version yet of being able to achieve its goal of Remaking Starcraft 1 within the Starcraft 2 engine. Currently, the project updates will feature: - All new high quality background artwork and story videos direct from Starcraft: Remaster\n    - Enhanced quality cinematics and music from the Starcraft: Remaster version\n    - An all-new redesigned mission briefing that now more than ever closely resembles Starcraft: Remaster's designs.\n    - Put the power of classic audio in your control! In addition to the current audio voiceover toggle feature for unit voices between SC2 and SC1 versions, there are now three separate options to utilize classic SC1 sounds for your all your buildings, your abilities, and/or your weapons! More classic Starcraft audio is re-introduced using these options, including the iconic Yamato Gun charging sounds, the Academy screams from Terrans, the Missile Turret's weapon launch, the Sunken Colonies spines, the original Ultralisk's growls, and more! Players now have the option to keep every single sound for units, buildings, weapons, and abilities within standard Starcraft 2 or convert them all to classic Starcraft: Brood War versions!\n    - A brand new Model toggle system, whereby players can choose between inspired classic Brood War versions of their favorite units in each race or retain the default Starcraft 2 models. Want the original Overmind portrait? Citadel of Adun model? Academy model? Or do you just want the classic Photon Cannon and Robotics Facility model? Try them all out and choose your favorites!\n    - Brand new unit and portrait models by default for many key units and heroes, such as the all new Tassadar and Raszagal unit and portraits. Even Aldaris gets a portrait model upgrade!\n    - A 4th level of difficulty: Brutal. For those players who want the ultimate difficulty challenge.\n    - All new advanced AI for enemies, improving their skill at casting abilities, as well as allowing them greater randomness and flexibility in sending attack waves against you. No two replays will be exactly alike for a more unique gameplay!\n    - You now have the option to enable more custom unique skin models for various units and buildings across certain factions including the rebel Sons of Korhal, the oppressive UED, the enraged renegade Broods, the enigmatic Nerazim, and more!\n    - Improved various visual effects for abilities\n    - A new \"Evolution Pit\" section in the SCMR Launcher for experimental goodies and extras including adding extra hero abilities and extra hero appearances in missions!\n\n    <!-- -->\n\n\n<!-- -->\n\n---\n\n## <span style=\"font-size:24px\"><strong>Downloads</strong></span>\n\n\n\n### **Current Stable Version: 7.0.0**\n\n- [SCMR v7.0 installer](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/2654597>)\n\n\n<!-- -->\n\n- [SCMR v7.0 Episodes 1-3](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/2654551>)\n- [SCMR v7.0 Campaign Launcher hotfix if Cinematics Pack is not installed](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/2655297>)\n- SCMR v7.0 Cinematics Pack (OPTIONAL) - download via dropbox here: - (Direct) [https://www.dropbox.com/s/m3bwn32gs2jrtdp/SCMRcinematics.SC2Mod?dl=0](<https://www.sc2mapster.com/linkout?remoteUrl=https://www.dropbox.com/s/m3bwn32gs2jrtdp/SCMRcinematics.SC2Mod?dl=0>)\n    - (Torrent) [https://www.dropbox.com/s/7qaabblwtun87ta/SCMRcinematics\\_v7.0.zip.torrent?dl=0](<https://www.sc2mapster.com/linkout?remoteUrl=https://www.dropbox.com/s/7qaabblwtun87ta/SCMRcinematics_v7.0.zip.torrent?dl=0>) (BitTorrent client needed for this download)\n\n    <!-- -->\n\n\n<!-- -->\n\nTo install the cinematics pack if you've already run the installer without it, replace the \"SCMRcinematics\" file in your mods folder with the one in the cinematics pack download.\n\n\n\n**If you've played previous versions of Mass Recall, for a clean install it is recommended you delete any previous Mass Recall-related folders or zip archives from your Starcraft 2 root install directory, and delete or rename the SCMR.SC2Bank file in (Documents)/Starcraft II/Banks**\n\n\n\n<span style=\"font-size:19.6px\">Localized Version: 7.0</span>\n\n#### Russian\n\n- [SCMRlocal v7.0 (Russian)](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/2689625>) (REQUIRED)\n\n<!-- -->\n\n\n\n\n\n<span style=\"font-size:19.6px\">Previous, Localized Version: 6.2.1</span>\n\n\n\n- [SCMRmod](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/956498>) (REQUIRED)\n- [SCMR Map Pack 1/2](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/2374303>) (REQUIRED)\n- [SCMR Map Pack 2/2](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/956265>) (Required to play episodes 4-6 and extras)\n- [Retro addon for SCMRmod](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/956272>)\n\n<!-- -->\n\n#### English\n\n- [SCMRlocal (English)](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/2375928>) (REQUIRED) Note: contains localized <span style=\"text-decoration:underline\">text</span>\n\n and subtitles for chinese, french, german, korean, russian and spanish languages. Corresponding language should be selected in your Starcraft II client.\n- [Cinema Addon (English) v6.2.1](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/2367475>) (optional)\n\n<!-- -->\n\n#### Chinese\n\n- Only text localization is available, please use [SCMRlocal (English)](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/2375928>)\n- Additionally hosted [here](<>)\n\n<!-- -->\n\n#### French\n\n- [SCMRlocal v6.2.1 (French)](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/2371987>) (REQUIRED)\n- [Cinema Addon v6.2.1 (French)](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/2370995>) (optional)\n- To have english audio with french text, use [SCMRlocal (English)](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/2375928>)\n\n<!-- -->\n\n#### German\n\n- [SCMRlocal v6.2.1 (German)](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/956661>) (REQUIRED)\n- [Cinema Addon v6.2.1 (German)](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/2369518>) (optional)\n- To have english audio with german text, use [SCMRlocal (English)](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/2375928>)\n\n<!-- -->\n\n#### Korean\n\n- Only text localization is available, please use [SCMRlocal (English)](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/2375928>)\n\n<!-- -->\n\n#### Russian\n\n- [SCMRlocal v6.2.1 (Russian)](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/2507337>) (REQUIRED)\n- [Cinema Addon v6.2 (Russian)](<https://drive.google.com/open?id=0BxUVO16JXUS7NkZXazJGUW9RdWM>) (optional)\n- To have english audio with russian text, use [SCMRlocal (English)](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/2375928>)\n\n<!-- -->\n\n#### Spanish\n\n- [SCMRlocal v6.2 (Spanish Voice)](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/957062>) (REQUIRED)\n- [Cinema Addon v6.2.1 (Spanish)](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/2369545>) (optional)\n- To have english audio with spanish text, use [SCMRlocal (English)](<https://www.sc2mapster.com/projects/starcraft-mass-recall/files/2375928>)\n\n<!-- -->\n\nFor older versions of the mod, see the \"Files\" section.\n\n---\n\n## How to Play\n\n#### Auto install using the SCMR installer\n\n- place (unzip) the installer and all downloaded zip archives to your Starcraft 2 install directory (the same folder where your Starcraft 2.exe is located)\n\n- run the installer\n\n- use the Mass Recall shortcut created on your desktop to start the game\n\n- [Auto install video guide](<https://www.youtube.com/watch?v=xQwlnC7TOxs>) by DeltronLive\n\n\n<!-- -->\n\nIf you wish to play while logged on to battle.net, you will need to take the following steps:\n\n- Launch Starcraft II using the battle.net launcher\n- Alt-tab to desktop\n- Launch Starcraft Mass Recall using the created shortcut\n\n<!-- -->\n\nIf this method does not work for you on Mac, you will still need to manually install the mod (see \"manual install\" below)\n\n#### Manual install\n\nDon't let the number of steps put you off, the installation part is actually very simple and should only take about 2 minutes.\n\n- extract the map packs (SCMRmaps)to the \"Maps\" folder in your Starcraft 2 install directory (create the \"Maps\" folder if it doesn't exist)\n- extract the mod files (SCMRmod and SCMRlocal) to the \"Mods\" folder in your Starcraft 2 install directory <br>\n\n    <br>\n\n     [Manual install video guide](<https://www.youtube.com/watch?v=OYJuB6TrliA>) by Jayborino <br>\n\n    <br>\n\n- Launch the Starcraft 2 editor\n- open the setup map named SCMRsetup in your Maps folder and click the \"test document\" button on the top right (or press ctrl+F9)\n- when you're at the setup screen, save the game\n- go back to the save menu, highlight the save you just created and click the \"show in folder\" button.<br>\n\n this will minimize Starcraft 2 and open the folder containing the save file\n- move or copy the save file to the saves folder under your account<br>\n\n (your documents folder)/Starcraft II/Accounts/.../.../Saves/Multiplayer (or any other subfolder)<br>\n\n if you can't find this folder, login to your account, go to campaign -> load, click on a save and click the \"show in folder\"-button. It will take you to the folder you need to move the save file into.\n- open Starcraft 2 again and exit the setup map\n- login to your account and load the save via the campaign load menu\n- once loaded, click the \"install\" button\n- when you're at the title screen, save the game again. You can now use this save to launch SCMR, the setup save is not needed.\n\n<!-- -->\n\nNote that you can still save and load any SCMR map, as long as you're logged in.\n\nDuring any mission, typing \"quit\" as a chat message will take you back to the menu.\n\n---\n\n### Troubleshooting\n\nMake sure to check out the [auto install](<https://www.youtube.com/watch?v=xQwlnC7TOxs>) and [manual install](<https://www.youtube.com/watch?v=OYJuB6TrliA>) video guides also linked above. The end result in these videos is the same, regardless of install method.\n\nAlso make sure you're using an up-to-date version of Starcraft 2.\n\n\n\n**Common issues:**\n\n- Param/values/whatever: if lots of texts are like that, you may have a problem with your Mods: delete SCMRmod and SCMRlocal, and re-download them from the links below. If it is only one or two lines (say, a mission objective), report it in the comments section (in that case, please specify which language you are playing in).\n- Dependency cannot be loaded: The mods are not at the proper place. Check that you have put your mods (SCMRmod AND SCMRlocal) in the Mods folder, as on the picture below.\n- Unable to load map: Your maps are not at the proper place. Check that you have put the episode files such as \"1. Rebel Yell\" in a folder \"Starcraft Mass Recall\", itself to be placed in Maps, as on the picture above.\n\n<!-- -->\n\nOther manual installation guides:\n\n- [Step-by-step Installation Guide](<http://www.sc2mapster.com/maps/starcraft-mass-recall/files/12-installation-guide/>) (English)\n- [Installations-Handbuch](<http://www.sc2mapster.com/maps/starcraft-mass-recall/files/93-scmr-installation-guide-deutsch/>) (Deutsch)\n\n<!-- -->\n\n---\n\n## Credits\n\n**[Click here to view full credits](<http://www.sc2mapster.com/maps/starcraft-mass-recall/pages/credits>)**\n\n#### map design and scripting\n\n<pre><br> Jones<br> Telenil<br> Jimm<br> Gradius<br> Ultraling<br> Kostyarik<br> Re1deR<br> herdal8<br> christdaugherty<br> OmegaWeaponX85</pre>\n\n#### SCMRmod\n\n<pre><br> based on the Starcraft 2: Brood War mod by <br><br> MavercK <br><br> <strong>additional development by</strong> <br><br> Jones<br> Jimm<br> Telenil<br> Gradius<br> OmegaWeaponX85<br> Superfield<br> christdaugherty <br><br><br></pre>\n\n#### custom 3D models & textures by\n\n\n\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n\n\n\n#### additional artwork\n\n\n\n|  |\n|  |\n|  |\n|  |\n\n\n\n#### localization\n\n\n\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n|  |\n\n\n\n---\n\n**PLEASE NOTE** that this is a completely unofficial, non-profit, fan-made remake and in no way affiliated with Activision Blizzard.\n\n\n\nOther custom campaigns from various authors can be found at the [Custom Campaign Initiative](<http://www.sc2mapster.com/maps/custom-campaign-initiative/>). For Brood War-like multiplayer, you can have a look at [Starbow](</linkout?remoteUrl=http%253a%252f%252fwww.teamliquid.net%252fforum%252fstarcraft-2%252f440661-starbow-beta%252f>).\n\n\n\nOld time Brood War players may enjoy the Carbot Animations [Brood War series](<https://www.youtube.com/playlist?list=PL0QrZvg7QIgoW8jBcHDCIKNgxOvE0FP2X>).\n\n",
    "author": "karlprojektorinski",
    "lastUpdated": "2019-03-20T12:43:01.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/156/996/SCMR_logo.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/156/997/SCMR_banner.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/156/999/setup.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/221/397/stop.png"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}