{
    "id": "wrath-arius",
    "name": "Wrath of Arius",
    "shortName": "Wrath of Arius",
    "installed": true,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/81/776/62/62/636178334705273259.jpg",
    "description": "## GENERAL\n\nHi, Wrath Of Arius is my first campaign I started here on Sc2mapster. I took some time off because I worked on my second campaign Starcraft: Pandora. Now I plan to continue this campaign. So what is Wrath Of Arius. It is a actually a tribute to Warcraft 3, therefore the dialogues, mission objective and story are almost identical, I modify some to fit my own story and make it work better in the Starrcraft universe. So all cred to Blizzard.\n\nSo why do this? I have learned so much when trying to replicate the warcraft 3 missions. I have become much more adept in the trigger editor and also some terraining etc. I said at the start I was going to make three maybe four parts of this campaign. I don´t know how much of this I really can accomplish, it is tedious work to replicate terrain, missions, cinematic but it is also fun. I have completed the Terran part and have some maps in the next episode. After each episode I plan to take a break and see if it is still fun, if it is I continue and of course people have to want to play them, that is after all one of the best thing about this, that someone actually plays the maps.\n\n## WRATH OF ARIUS - The Black Hand\n\nThe first of Three, possible four Campaigns. The first focus on the Terran faction, The Black Hand. It consists of 9 maps. All the maps are available for download.\n\n- Misison 1 - The defense of the crossroads\n- Mission 2 - Grim Reaper\n- Mission 3 - Ravagers of the brood\n- Mission 4 - The Swarm Reborn\n- MIssion 5 - March of the Swarm\n- MIssion 6 - The Culling\n- MIssion 7 - Braxis\n- Mission 8 - Dissension\n- Mission 9 - The Artifact\n\nUpdate: Fixed spelling mistakes. Gave Jon a healing ability.\n\n## STORY\n\nRecent activity of the Grim Pirates on the planet Doros have forced the Black Hand to take defensive messures, To contain the pirate treat, Dr.Field the leader of the Black Hand has sent two of the factions best agents- his son Jon Field and the reknown Zek Strife - to deal with the pirates once and for all.\n\n## Path Of The Brood\n\nThe next chapter in the Wrath Of Arius campaign and focus on the Zerg race.\n\n- Mission 1: Crawling trough the ashes\n- Mission 2: Evolution\n- Mission 3: Queltorians\n- Mission 4: Uknown\n- Mission 5: Uknown\n- Mission 6: Uknown\n- Mission 7: Uknown\n- Mission 8: Uknown\n- Mission 9: Uknown\n\n\n## STORY\n\nThe Cerebrates infestation has spread through the capital city and in to the outskirts of Doros. Shocked and disheartened by the loss of the beloved leader, the forces of Doros were scattered by the ravenous zergs.Now Doros is but a shadow of its former glory - and Jon Field has yet to be seen.\n\n",
    "author": "hultmanable",
    "lastUpdated": "2016-02-24T08:50:24.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/160/79/Screenshot2015-04-18_20_42_57.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/160/80/Screenshot2015-08-29_13_27_10.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/160/81/mission_9_cine.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/160/82/Screenshot2015-08-29_13_20_26.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": [],
    "state": "ready"
}