{
    "id": "attack-xelnaga",
    "name": "Attack of the Xel'naga",
    "shortName": "Attack of the Xel'naga",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/80/182/62/62/636178318546429381.Jpg",
    "description": "Volsky here giving you first ever User Made Campaign map! Packed with transmissions, Objectives, even triggers, A boss, timers, and a boss bar to boot! Gather your forces as you get attacked by the waves of Xel'Naga trying to ward you away from whatever they're hiding! And at the end, the almighty weapon, Hydornus!\n\nThis map features:\n\nA hero unit, Eystanus! A deadly dark Templar with the power to use Shadow step, a lightning fast execution-style attack that deals a mean amount of damage, however, when used on a friendly unit, all it does is blink you to that unit, no harm done <span>:)</span>\n\nEvent triggers! Many even triggers in this map, explaining things in detail, giving you clues of what to do, and even some fun mechanics (As the enemy player warping in 4 sentry's when you go near the warp prism.\n\nUser Interface Enhancements: Objectives, Tran missions, and a boss bar, what more could you ask for?\n\nHope you guys like it, and have fun <span>:D</span>\n\nNOTE: Theres some bugs, but its mainly proof of concept of the new campaign functionality, like boss bas, objectives, and the new transmission systems, this is in no way meant to be a real campaign map, its just playing with triggers. You can expect some of this concept to be in the main Starcraft 2 Campaign.\n\nNOTE2:Right now the map only supports enUS users in regards to text. I'm trying to figure out how to add support for enGB, well, I know how, its just I cant figure out the damn MPQ editor.\n\n",
    "author": "_ForgeUser4344469",
    "lastUpdated": "2010-04-28T01:23:08.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/154/698/Screenshot001.Jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}