{
    "id": "colony-219",
    "name": "Colony 219",
    "shortName": "Colony 219",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/81/185/62/62/636178329075377648.png",
    "description": "<div style=\"text-align:center\"><p><img src=\"http://static.sc2mapster.com/content/images/30/858/colony219logo.png\" alt=\"http://static.sc2mapster.com/content/images/30/858/colony219logo.png\"></p></div>\n\nThe goal of *Colony 219* is to create a story-driven point-and-click adventure style game spanning several maps that will have the player solving puzzles and riddles to unravel the plot. Game delivery will be episodic with new maps/story advancements being delivered as they are ready.\n\nCombat will be light but full featured, implemented in the style of hack-and-slash ARPGs like Diablo (only with missiles and guns in place of swords and spells).\n\nThe game will feature custom graphic elements, music, and voice overs. Because of the size of these things this project will be limited to single player offline play.\n\n*Colony 219* is meant to be a showcase of the SC2 engine applied to an adventure game scenario, as well as a way to relive and re-imagine the youth I squandered playing adventure games.\n\n<span style=\"color:#00aeff\">I'll be updating this page pretty frequently, and I welcome any ideas and suggestions!</span>\n\n<div style=\"text-align:right\"><p><a href=\"http://www.sc2mapster.com/maps/colony-219/images/\" rel=\"nofollow\"><img src=\"http://corylaflamme.com/ext/219screenshots.png\" alt=\"http://corylaflamme.com/ext/219screenshots.png\"></a></p><a href=\"http://www.sc2mapster.com/maps/colony-219/images/\" rel=\"nofollow\"></a></div>\n\n\n\n# Gameplay\n\n*Colony 219* will feature a number of gameplay mechanics that generally aren't widely implemented in SC2 maps. I will likely make some video tutorials for the more uncommon features as they are added.\n\n### Exploration & Combat Mode\n\nEpisodes will have **exploration and combat** sections. In exploration sections the player is free to roam around and interact with objects and people. Most of the game will be played in exploration mode. In this mode players will collect and use items, solve puzzles, interact with NPCs, and progress the story. Exploration mode uses a fixed-camera system, where each time a player enters a new \"segment\" of the world the camera will shift to a different position and angle to create a more cinematic gameplay experience. The camera will not follow the player around, but instead the player will move around to any number of \"fixed\" cameras.\n\nCombat sections will feature fast paced hack-and-slash gameplay similar to (or directly ripped off from) games like Diablo or DotA and its various clones. These sections will generally be brief but more and more common towards the end of a given episode. Players will have a generic spammable attack and several cooldown based abilities like, say, a grenade or rocket.\n\n### Movement\n\n- **<span style=\"color:#fff\">Right Click</span>\n\n**: Standard StarCraft unit movement, I don't need to explain this. \n- **<span style=\"color:#fff\">Click-and-drag</span>\n\n**: A staple of most adventure games. The player can hold the mouse button down and slide it in the direction that they want the character to move. The character will move towards the mouse cursor as long as the button is held. \n- **<span style=\"color:#fff\">Keyboard</span>\n\n**: WASD keyboard movement will be used in combat sections. Clicking your way through a murderous horde is just so unsatisfying. \n\n<!-- -->\n\n### Combat\n\n### Conversations\n\n# Story\n\n**<span style=\"color:#fff\">More details coming shortly.</span>\n\n**\n\n",
    "author": "_ForgeUser658754",
    "lastUpdated": "2011-03-18T07:28:58.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/157/967/logo.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/157/969/colony219logo.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/157/971/EarlyCinematic5.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/157/973/EarlyCinematic1.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/157/974/EarlyCinematic2.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/157/975/EarlyCinematic3.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/157/976/EarlyCinematic4.png"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}