{
    "id": "angels-abyss",
    "name": "Angels of the Abyss",
    "shortName": "Angels of the Abyss",
    "installed": false,
    "summmary": "",
    "description": "Project Leader: War\\_Illithid\n\n**Overview**\n\nThe map is going to be an RPG series that really abuses the concept of branching paths and multiple endings. The current plan is to have the game run in 3rd person and use elements fairly stable with modern RPGs. The major kicker is that Blizzard has announced that they intend to have some way to save data from completed maps. Using this, a second map in the series will be able to read what ending you got in the first map and have the decisisions you made there, affect what happens now. Using this I should be able to go so far as to completely alter the terrain, making almost a completely new map.\n\nAlso, with the customizable UI, I should be able to make dialogue choices in the game, further enhancing the experience. Add in the ability to enter buildings/go underground and this will become a very expansive RPG. This will be multiplayer cooperative of course, and the difficulty will alter based on the number of players.\n\n**Story**\n\nI am not going to give too much away just yet, I will be coming back and editing this in the days and weeks to come to give you an idea as to what exactly is going on, what the world is like, who the different characters are, etc.\n\nFor now I will just tell you that the first game will be about attempting to survive a demonic invastion.\n\n**Characters:** (not all are here yet)\n\n*Skoll Drear *\\- A cleric to Pholtus, the god of the Sun and Moon. Skoll is highly intolerant of evil beings and specifically hates undead abominations. He journeys with his twin brother Hati in a never ending crusade against all evil creatures that they can find. Skoll focuses on Celestial magic, using mainly the retribution discipline. He is still a skilled combatant without his magic using his mace to crush the heads of his foes. His heavy armor (decorated with the image of the sun) and protective magics allow him to take quite a beating before having to retreat.\n\n*Hati Drear *\\- A paladin in the service of Pholtus. Similar to his brother in reverence if not in tactics as well, he has no mercy for any evil beings he comes across. Weilding his massive scythe he cuts down hordes of foes, cutting swathes in their ranks. He does occasionally use celestial magic, also favoring the retribution discipline, to aid in his smiting. He prefers mobility over protection and as such his breastplate (decorated with the image of the moon) is the only armor he wears. When not wearing armor and a weapon the only way to tell the difference between these two brothers is their hair. Skoll's hair is ghost white, while Hati's is nearly a golden yellow.\n\n*Erin Dralfin *\\- A true warrior through and through. He is one that truely believes in the way of the sword, or in this case the spear. Nearly his entire life has been spent fighting enemy after enemy. He never had a chance to learn any magical incantations, and he showed that battles can be won without them. He wears a key on a chain around his neck, his only reminder of the past he left behind many years ago. Preferring greater mobility, he wears minimal armor, as he hopes to strike his opponents down first with the superior reach of his spear. His face is remarkably unscarred for a veteran of so many battles with the unfortunate exception of one from his forehead to the edge of his lips, running a deep gash in his nose.\n\n*Sverra Rhestojn *\\- The sorceress is a firm believer in the power of all forms of magic. There is not a school of magic she has not dabbled in at one point or another. She was a youth of exceptional talent who could have easily mastered one of the forms of magic by this time had she the attention span. Beautiful, but absent minded, she goes through life with the type of happy-go-lucky attitude that has seen many people meet an unfortunate end. She tends to prefer to wear more protective armor than other mages as she finds it doesn't restrict her casting much at all.\n\n**Mechanics**\n\nWhen the game begins there will be a slew of characters available to choose, more than the number of players that will be allowed in game. Each of these characters will have backstory and personality already decided. They will also each have their own hidden quest within each map. This quest will not be tied to the overarching path taken, but will reward the player fairly well. When moving on to the next part of the series, you will not be forced to play the same hero, nor will heros that were unused by unavailable. The heros power will not transfer, only his decisions.\n\nCasting and custom spells will certainly be a major part of the game. Every character will have at least some casting capabilities, some of course will be better at it then others. For this, I will go as far with these spells as the editor allows me to. And judging by the Uberlisk they showed as at Blizzcon, that will go very, very far.\n\nThere are four primary forms of magic. They are Celestial, Arcane, Infernal, and Natural. Each form of magic is further divided into different schools and disciplines.\n\nCelestial magic is magic from the heavens. Some are gifted this power from the gods, while others steal it and twist it for their own personal use. Protection magic is divided into three disciplines; protection, restoration, and retribution.\n\nArcane magic is magic that mortals take from other planes of existence. Harnessing the power and releasing it into their own. Arcane magic is divided into several schools; abjuration, conjuration, evocation, illusion, and transmutation.\n\nInfernal magic is magic used by the demons of the underworld. Many mortals are allowed access to this power for the demons are amused when it is used destructively. There are three schools of Infernal magic; curses, destruction, and necromancy.\n\nNatural magic is the magic found in the mortal world. It powers much of known life and many learn to harness its power for their own benefit. There are four disciplines of Nature; animal ken, divination, elemental, plant dominion.\n\nSkills will be another point in this game. Players will have skills such diplomacy and lockpicking. These may be important to getting the best ending, but you will be able to finish the map without any skills if one chooses to do so.\n\nWhen leveling up, players will have control as to what they choose to increase. Be it damage, skills, magic, etc. I fully intend to allow players the choice as to how they want their characters to evolve.\n\nNow, I will be going back to this and expanding with more details, specifically in the story section, over time so check back every so often if you're interested. And I am ALWAYS willing to hear suggestions to make these maps more interesting and fun so feel free to fire away.\n\n",
    "author": "_ForgeUser1066858",
    "lastUpdated": "2010-04-20T22:57:13.000Z",
    "screenshots": [
        {}
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}