{
    "id": "birth-swarm-campaign",
    "name": "Birth of a Swarm (campaign)",
    "shortName": "Birth of a Swarm (campaign)",
    "installed": false,
    "summmary": "",
    "description": "## Birth of a Swarm (campaign)\n\nThis is a small WIP campaign that I made. I saw the campaign initiative thread/map collection and thought I'd upload an early version.\n\nThis map is kind of an experiment. It is designed mainly to teach players how to play zerg in general. In these maps you will need to expand and/or harras the enemy if you want to survive (at least on brutal). One major difference between this and the normal liberty campaign is that the AI never cheats. Their economy can be hurt just like yours. This is done by an AI system unlike what the normal campaign system uses.\n\n### Story\n\nAsgaard was a colonist planet formed at the start of the first great war. It was invaded by an unnamed cerebrate which was designated only to consume the planet providing resources for the assault on Auir. With help from the Dominion the colonists were able to survive till the destruction of the second overmind. The cerebrate lost control over its brood and the zerg are roaming the planet as if they were wildlife. The zerg destruction is now slowly being cleaned up and the planet is once again at peace. The unnamed cerebrate makes a last attempt to for fill his purpose by making a self thinking entity, you.\n\n(This next part is going to be a prologue map) You are planted on a transport ship coupled with a group of zerglings. Destroying the ship from the inside allowed you to crashland on the western part of Asgaard and start your new swarm.\n\n### Features\n\nThe map currently features an ingame map selection which includes a user friendly way of changing difficulty as well as providing information on the planets current state.\n\n\n\n\n\n### Maps\n\nThere are currently 2 maps.\n\n#### Seed of Life\n\nIn the first mission you will establish your first hive cluster. Learning basic building mechanics of the zerg. You will need to fully saturate your main and destroy your opponent to win.\n\n\n\n\n\n#### Assimilation\n\nThe second mission you will need to infiltrate a zerg research facility in order to get more advanced zerg strains within your army.\n\n\n\n\n\nLast note, English is not my native language so expect a lot of spelling errors ^^\n\n",
    "author": "_ForgeUser6146284",
    "lastUpdated": "2011-07-28T06:01:07.000Z",
    "screenshots": [
        {}
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}