{
    "id": "brain-dead-crash-landing",
    "name": "Brain Dead - Crash landing",
    "shortName": "Brain Dead - Crash landing",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/80/459/62/62/636178321421622509.jpg",
    "description": "\"Brain Dead - CRASH LANDING\" is the first of many Left 4 Dead type games. Survivors must work together as they move through the map finding items and \"secrets\" along the way. While the zombies try to prevent this at all cost.\n\nHuman Heroes: Jim Raynor - Standard Hero unit with damage and utility Skills. Tychus Findlay - Strong Hero unit with few skills but high weapon damage and Hp/Hp armor. Egon Stetmann - Weak Support hero unit with many support skills. Rory Swann - Engineer able to build turrets and bunkers. Snarf - Scout unit.\n\nZombie Heroes: Creep Crawler - Single target stun. Infested Terran - Mind Control. Hydralisk - Scout unit with AoE immobilizing goo. Worm - Mage hero no weapon but many skills. Hybrid Reaver - Support zombie.\n\nIn Game Items: Med kit - heals 100hp. Spider mine - sets a spider mine. Thermal Goggles - Detects stealth burrowed units. Secrets - Find all four secrets to unlock special heroes.\n\n[http://www.mediafire.com/imageview.php?quickkey=mzthbxq89nzb6kj&thumb=4](</linkout?remoteUrl=http%253a%252f%252fwww.mediafire.com%252fimageview.php%253fquickkey%253dmzthbxq89nzb6kj%2526thumb%253d4>)[http://www.mediafire.com/imageview.php?quickkey=5ph0nqa01k7g7fg&thumb=4](</linkout?remoteUrl=http%253a%252f%252fwww.mediafire.com%252fimageview.php%253fquickkey%253d5ph0nqa01k7g7fg%2526thumb%253d4>)\n\nNeed beta testers please! Get your friends and try it out, tell me how it is. If i get enough feed back i plan on making another map like that :)\n\n",
    "author": "_ForgeUser4722439",
    "lastUpdated": "2010-08-31T04:25:47.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/155/754/minimapview.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}