{
    "id": "cerberus-files",
    "name": "The Cerberus Files",
    "shortName": "The Cerberus Files",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/81/993/62/62/636178342200685222.jpg",
    "description": "![null](<https://s19.postimg.org/mkz8nc9ab/Cerberus_files.jpg>)\n\nWith Amon having been defeated, Emperor Valerian now realizes his responsibility to rebuild the Terran Dominion. His father, Arcturus, was known for keeping order and establishing a strong military power throughout the core worlds of the Dominion. Emperor Valerian, however, realizes that if his people are to survive as race, advancements in technology and research are needed. This was his primary aim with Moebius Corps. After Dr. Narud and all of Moebius Corps were twisted to serve Amon, Emperor Valerian and the Dominion lost all of the progress that they had made.\n\nHe now conscripts you and your comrade, two reputable mercenary commanders, to provide security for his newly created Cerberus Foundation. Their most recent endeavor takes you to the far-away world of Kaldir, where Emperor Valerian believes the Xel'naga ruins hold keys to some important technology advancements. You and your ally must ensure the safety of a specialist, Dr. Edward Munro, who heads the research operation.\n\n**\\--------**\n\n**StarCraft 2: The Cerberus Files**\n\nIncludes 6 linear story missions, Bonus epilogue mission, Play side by side with a friend, Custom units, Cooperate with different strategies to best complete your objectives, Takes place between Legacy of the Void and Nova campaigns, Intended release: Christmas 2016 on SC2 Arcade.\n\nI am getting moving on a true co-op campaign for StarCraft 2. What I mean by \"true\" is that it is based on the original StarCraft 2 RTS play style. We have co-op commander missions, so why not a linear campaign right? I have played the Shadow of the Xel'naga series on the arcade (very well done btw), but I wanted an RTS campaign. I'll admit, I'm kind of a novice when it comes to the map editor, but I am learning quick. I am already working on the second mission, but you can read more in the paragraph below.\n\n**Missions**\n\nMission 1: Boots on the Ground (AVAILABLE now on SC2 Arcade) -Get your bearings and set up the story line\n\nMission 2: Catacombs (AVAILABLE now on SC2 Arcade) -Investigate the Xel'naga ruins\n\nMission 3: Lockdown (currently in design stages) -Hold a defensive position\n\nMission 4: Shepherd (currently in design stages) -Escort VIP\n\nMission 5: The Enemy of My Enemy (currently in design stages) -Classic kill the base style\n\nMission 6: Exodus (currently in design stages) -Secure escape route\n\nEpilogue: Corruption (currently in design stages) -???\n\n**The Cerberus Files campaign can be found by searching \"Cerberus Files\" or the mission name.**\n\nNow I know this list of missions isn't much to look at, but keep in mind that I am trying to withhold main plot details. I will be updating this thread often to report progress on the campaign.\n\nAlso, I would greatly appreciate anyone who would like to contribute to my map making. You can find the project on KickStarter at this link:\n\n[KickStarter: The Cerberus Files](</linkout?remoteUrl=https%253a%252f%252fwww.kickstarter.com%252fprojects%252f1440501786%252fthe-cerberus-files-starcraft-2-co-op-campaign>)\n\nThere are some pretty sick rewards for those who donate!\n\nThanks to all who have inspired me and all the people who post tutorials on here, SC2 Forums, and YouTube. I don't know where I would be without you guys.\n\n",
    "author": "_ForgeUser28302094",
    "lastUpdated": "2016-10-19T02:10:02.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/160/997/Screenshot2016-12-07_11_14_54.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/160/998/Screenshot2016-12-07_11_12_59.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/160/999/Screenshot2016-12-07_11_11_29.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/161/0/Cerberus_files.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/161/1/Screenshot2016-10-24_10_38_51.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/161/2/Screenshot2016-10-24_10_20_58.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/161/3/Screenshot2016-10-24_10_19_38.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}