{
    "id": "chain-brain",
    "name": "To Chain the Brain v3.0",
    "shortName": "To Chain the Brain v3.0",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/79/854/62/62/636178316314548837.jpg",
    "description": "UPDATE: I adjusted the AI so it makes new units every 5 minutes and disabled the victory trigger until you kill all three cerebrates. I also removed some mutalisks and added high-yield resources so you're less likely to run out of them.\n\nI named this map \"to chain the brain\" instead of \"to chain the beast\" to avoid confusion with another guy's remake. Nevertheless, this is a remake of the last UED mission in Brood War. I have playtested this map and it works perfectly as far as I can tell. Feel free to comment on any issues you run into. The map features the transmissions from the original, but with a brand-new feature: whenever a transmission plays, all the units on the map including yours pause. I am very grateful to dvirtthebest to showing me how to do this. Now you can just listen to the dialogue without being interrupted by fighting. The units will be unpaused when the dialogue is complete. Anyway, as for the unique features of the original map:\n\n1\\. The invincible Sunken Colonies: The transmission where the marine tells you about them is not in this remake because for some reason the file can't be imported properly. However, these things are in it. They're basically spinecrawlers that are invincible. To deal with them, take out the nameless cerebrate of the red team. The cerebrates look like giant evolution chambers, blown up to about twice their original size. Sorry, but unless Blizzard puts cerebrates in the editor, that's the best you're gonna get. When the red cerebrate dies, the red team (including the sunken colonies) will be defeated and will bother you no more.\n\n2\\. The Torrasques: After the red team is defeated, you will have fifteen seconds to get your troops to the area around the command center before a Torrasque appears right in the middle of the base! Destroy it before it wrecks your whole base, then the marine will say the \"cargo shit fulla whup-ass\" transmission. After that, a new Torrasque will crop up every minute or so untill you kill the green team's cerebrate, whose name is Miraz. After he's dead, the greenies will be defeated and you won't \"be encountering any smacked-up ultralisks anytime soon!\"\n\n3\\. Daggoth and the overmind: After team green is down for the count, only the orange team remains. The orange cerebrate is the last cerebrate remaining, (besides Kerrigan's) and he is none other than Daggoth. He is near the overmind, which looks like a lair blown up to two or three times it's normal size, not a Nydus Worm. The overmind is invincible, since you don't want to kill it anyway. After you kill Daggoth, the orange team will be defeated, but you won't win. To claim victory, take your Medic (there's only one, and he's/she's the marauder with the medivac portrait) and bring him/her to the beacon (the stone disk in front of the overmind) to witness the end scene and win. Congratulations! Feel free to post comments on what you think of this map and any issues you may have. (See below.)\n\nNote: if your medic dies, you lose, so defend him at all costs. You start with all the SCVs and buildings you need, so build up your attack force and climb the tech tree, then take it to the enemy.\n\n![null](<http://static.sc2mapster.com/content/images/21/819/Untitled.jpg>)\n\n",
    "author": "_ForgeUser4468584",
    "lastUpdated": "2010-06-10T19:09:15.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/153/778/Untitled.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/153/780/Untitled.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}