{
    "id": "cmo-campaign",
    "name": "CMO Mod and Campaign",
    "shortName": "CMO Mod and Campaign",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/81/315/62/62/636178330302260280.jpg",
    "description": "- NOTE: Campaign is on hold while I finish the multiplayer aspects of the mod, once I finish I will use my better triggering skills to improve the campaign. \n\n\n\nInstructions:\n\nMod Instructions. Download the L2D Units Mod and the CMO Mod and place in mods folder\n\nCampaign Instructions: Download all Mods in the order, L2D Units, Defendable Walls (ONLY FOR PLAYING CAMPAIGN), CMO. Place in mods folder.\n\nTHE L2D UNITS MOD CONTAINS DATA AlSO\n\nDownload Maps and place in a folder labelled CMO in your maps folder\n\nCMO Mod is an enchancement mod that adds a multitude of new units,upgrades and AI Improvements. You can play it on battle.net as an extension mod titled HOTS Custom Map Support Mod.(The name will be changed to CMO Enhancement Mod once it is out of beta) \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nCMO Campaign is a custom campaign focused around a small group of mercenaries who deserted the dominion just as heart of the swarm takes place. After joining up with Raynor's Raiders they discover the rebel groups style does not seem effective - causing them to break away and become their own faction.\n\nCampaign uses Cardanis's Defendable Walls Mod, Link Here. [http://www.sc2mapster.com/maps/defendable-walls/](<http://www.sc2mapster.com/maps/defendable-walls/>)\n\n10+ Missions: -squad missions -hold out -standard destroy enemy -Space battles and more...\n\nMission 1: Beta\n\nMission 2: Rushed, I hate the final product and might re -do, only usefull for story in you got a starport\n\nMission 3: Beta\n\nMission 4: Almost finished\n\nStory: After just going rogue from the dominion you needed somewhere to hold up, kaldir seemed that place...now your cruisers are fighting over kaldir too occupied by protoss to rescue you\n\nGameplay: Unusual type of hold out against cliff jumping ursadons, attacking the protoss gives heavy weapons unavailable to you.\n\nPlease give feedback\n\n",
    "author": "realnolanstar",
    "lastUpdated": "2014-05-13T21:29:01.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/158/475/Screenshot2014-05-12_16_05_13.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/158/477/Screenshot2014-05-12_16_11_46.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/158/479/Screenshot2014-05-12_16_12_03.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}