{
    "id": "custom-campaign-a-war-story",
    "name": "Custom Campaign: A War Story",
    "shortName": "Custom Campaign: A War Story",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/182/274/62/62/636806673910949775.png",
    "description": "****\n\n\n\n***NOTE: This project is not ready to go into production yet. For now, this is just an announcement. I will be working during these next couple of months on setting up all the things I need for the campaign to begin. For now, I hope you are excited about what's to come.*<br>\n\n**\n\n**What is A War Story?**\n\nA War Story is my 2nd custom campaign project for StarCraft II, following Annihilation. The campaign takes place 25 years after the end of Legacy of the Void, and as the name implies, it’s a story about the coming conflict in the Daeroloth Quadrant, a newly discovered part of the galaxy, far away from the Koprulu Sector, as factions seek to establish and take control of this vast, unknown space.\n\n**Key Features:**\n\n- Engrossing storyline split into several Acts, each seen with the perspective from a new faction’s eyes.\n- 8 unique factions with new unit and ability modifications, gameplay, stories and characters.\n- Play as both Terran, Zerg and Protoss.\n- Interesting gameplay mechanics presenting the player with a wide variety of scenarios requiring different skills and styles of play.\n- Highly distinct difficulty setting, each with noticeably different levels of challenge and features between them.\n- Plenty of references and connections to official StarCraft lore, making the world feel fleshed out and as if it fits in as part of the canon story.\n- Heavy focus on cinematic experience by developing the story, the lore and its characters through the use of in-game cinematics and intermission maps.\n- Unique campaign elements like upgradeable armies, mission launcher, connecting maps, briefing screens, victory/stat screens and achievements.\n- A unique mission launcher featuring a data log, and an easily navigable way of selecting and playing any given map in an Act.\n- Obtain Points through missions, bonus objectives, secrets and performance to unlock powerful upgrades to your growing army.\n- Choose how you want the course of the story to go, by being presented with player choices that will change the course of the campaign’s plot development and its missions.\n\n<!-- -->\n\n**Installation Guideline**\n\n***More info coming soon...***\n\n**Plot Overview:**\n\nAfter Amon’s fall, the Koprulu Sector has been in a state of disarray, due to the massive destruction the Hybrid armies have caused across the sector. Casualties were many, and resources are scarce. As a result, millions of Terran, Protoss and Zerg in the Koprulu Sector began a mass exodus to establish a new and hopefully better future. Within the Daeroloth Quadrant, the races has been split into factions, each with their own unique combat style and history. This sector of the galaxy has proven to be ridden with resources and opportunities, and the factions vie for control of the quadrant’s various worlds - whether for personal gain, or for something greater.\n\nThe Daeroloth Quadrant is now in a state of a widespread conflict. How will the factions handle the upcoming troubles heading their way? With the existence of player choice, you can decide the course of this campaign’s story!\n\n**Factions:**\n\nThe campaign features 8 unique custom factions, all of which will be playable in one of the Acts. As progress is made on these factions, links will be added below to take you to a separate page where you can acclimate yourself with all the features, stories and gameplay mechanics of each faction. A video overview will also be provided when the time comes.<br>\n\n*Terran Factions:*\n\n- Brotherhood of Taurus\n- Forged Hand\n- Greyhound Corps\n\n<!-- -->\n\n*Protoss Factions:*\n\n- Descendants of Aiur\n- Shadow Hunters\n- Servants of Daeroloth\n\n<!-- -->\n\n*Zerg Factions:*\n\n- Swarm Remnants<br>\n\n- The Ravagers\n\n<!-- -->\n\n**Acts & Missions:**\n\n**Act I: Emerging Conflicts**\n\n*Play as the Brotherhood of Taurus*\n\n*More info coming soon...*\n\n*Difficulty Levels:*\n\n**Adventurer:**\n\n*Recommended if this is your first time playing the campaign, and you don’t have much experience in StarCraft II.**<br>\n\n*\n\n- Enemy AI handicap set to 80.\n- Hero in-combat health regeneration increased by 50%.\n- Enemy AI has minimal upgrade and ability usage.\n- Enemy AI sends smaller attack waves.\n- Enemy AI will mildly try to counter the player’s composition.\n- Many sections and map mechanics are altered or removed entirely.\n\n<!-- -->\n\n**Veteran:**\n\n*Recommended if this is your first time playing the campaign, and you have experience in StarCraft II.**<br>\n\n*\n\n- Hero out-of-combat health regeneration reduced by 25%.\n- Hero cooldowns increased by 25%.\n- Starting resources reduced by 15%.\n- Enemy AI has common upgrade and ability usage.\n- Enemy AI sends bigger attack waves.\n- Enemy AI will regularly try to counter the player’s composition.\n- Boss damage and health increased by 50%.\n- Some sections and map mechanics are altered or removed entirely.\n\n<!-- -->\n\n**Nightmare:**\n\n*Recommended if you have already beaten the campaign and you wish to challenge yourself.*\n\n- Hero out-of-combat health regeneration reduced by 60%.\n- Hero in-combat health regeneration removed\n- Hero cooldowns increased by 50%.\n- Starting resources reduced by 30%.\n- Available resources reduced 10%.\n- Enemy AI has exceptional upgrade and ability usage.\n- Enemy AI sends very large attack waves.\n- Enemy AI will heavily try to counter the player’s composition.\n- Boss damage and health increased by 100%.\n- Height advantage for the player is removed. Enemy AI can see up cliffs.\n\n<!-- -->\n\n**Credits & Special Thanks:**\n\n- Alarak & StealthToast - Testers, & for helping with campaign development.\n- VastanX - Custom models\n- GhostNova91 - Custom models\n- Hammer107 - Custom models\n\n<!-- -->\n\n**Discord:**<br>\n\nFollow my official Discord, and be among the first to know of updates and important announcements regarding the campaign, and get access to various extra content like weekly showcases.<br>\n\n[https://discord.gg/Ztu44gZ](<https://discord.gg/Ztu44gZ>)\n\n",
    "author": "dudkisc2",
    "lastUpdated": "2018-12-17T18:16:31.000Z",
    "screenshots": [
        {}
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}