{
    "id": "enumerate-continuation",
    "name": "Enumerate continuation",
    "shortName": "Enumerate continuation",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/178/405/62/62/636778073189946523.png",
    "description": "Over on the Blizzard forums the user ToxicDefiler posted a very long thread explaining his idea for an alternate universe based on Starcraft. This AU would go back to the original manual for SC1 and from there would go in a different direction from canon. Rather than starting from scratch, canon arc would be recycled to follow the new continuity. Because the alternate setting is outlined in broad strokes, other creators can easily set their custom campaigns within the same shared universe.\n\n\n\nToxicDefiler compiled the content of his original post into two PDFs, one containing the full posts and another containing only the timeline. These will be included under the downloads for this project.\n\n\n\nSource links:\n\n- [Timeline](<https://drive.google.com/open?id=0B4E22DL0XscIWmdjYnJqR3gzajA>)\n- [Document 1](<https://drive.google.com/open?id=0B4E22DL0XscIem14WDU4dDVobVE>)\n- [Original thread](<https://us.battle.net/forums/en/sc2/topic/17606004934>)\n\n\n\n\n\nHere is a quote from ToxicDefiler summing up the full document PDF:\n\n> Schematics for a future project, the Starcraft Enumerate is the concept of different campaigns that will be avaliable for the player, as well as possible changes to UI and AI. Starcraft Enumerate is an alternate universe to Starcraft, with a few noted differences:\n> \n> \n> \n> \\- No Kerrigan, instead the Zerg will have Assimilated Terrans as units.\n> \n> \\- No Duran, Amon, nor major Xel'Naga Plotline such as Hybrids nor Prophecy.\n> \n> \\- UED is replaced by the Umojans, and the Kel-Morians will also be a major component.\n> \n> \\- Zeratul sacrifices himself instead of Tassadar during the Death of the Overmind.\n> \n> \n> \n> About 150 pages, 80,008 words, meant to list the different factions, basic information, and the tech tree planned out for the different factions. This is meant to allow the possible campaigns to be written out and set, acting as blue prints for possible creations. Although does not have all the information for the races for sure, the Three are described in detail the amount of changes each faction will have, as well as the timeline and gameplay. Although I had energy to do Terran and Zerg, I hated the Protoss due to the race being BLEEEEEEEH!!! thus, I put as much information for them that I cared to go in depth with right now, and after that made me want to do the Terrain/Doodads with not much depth either in comparion to the Terrans and Zerg sections.\n\nI myself greatly enjoyed ToxicDefiler's take on the Starcraft universe, but I disagreed with some of the plot points he devised. So I started this project with the intent of not only preserving his original work and building on it myself, but to get feedback from the mapping community.\n\n",
    "author": "mithras_gnosis",
    "lastUpdated": "2018-06-12T13:25:35.000Z",
    "screenshots": [
        {}
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}