{
    "id": "extermination-rpg",
    "name": "Extermination RPG",
    "shortName": "Extermination RPG",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/80/920/62/62/636178326458200310.jpg",
    "description": "## Extermination RPG\n\n### Extermination RPG\n\nThis is my first map, an RPG with a lot of flexibity. How ever its gone through an serious overhaul to give it a hectic, fun feel.\n\n![null](<http://img19.imageshack.us/img19/7103/unledvbw.png>)\n\n### Story\n\nYou are hired mercenarys come to exterminate the infestation on the planet Kuroshin, a nuetral planet in the outer Koprulu sector. A few Zerg fleed to Kuroshin during the Brood War, but once there, in a desperste attempt to save her brood, Broodmother QU'eranrte fused with the Northern Deadlands. Because of the lack of crops or civilization the Zerg had very little with which to adapt to and as such, they began to be able to restructure themselves as psionic beings, give them even more power and diversitility. By this time the inhabitants of Kuroshin had noticed the infestation, and had called for support for Dominion core world forces, but as the Zerg had just finish their resurgence, there was no chance of help. So the inhabitants bunkered down and tried their best to fight the Zerg but began to lose ground to the unrelenting forces of the Zerg. Luckily the Protoss took pity and supplied reinforcements and gave them the means to call for you Exterminators. As Exterminators it is your job to destroy the main infestation site, and make sure this contagion is stomped out.\n\n### Gameplay\n\nThere are 14 level-able heroes, each with at least 7 level-able abilites. Both the Exterminators and the Zergs bases have 3 major spawn points and the units work like a DoTA system, except your units will aways lose, and every few minutes a Drop Pod will come with a huge amount of units and deal devastating damage to your base, and a few other surprises lay in wait. There are 6 different upgrades, each with 100 levels, and there is an armor and loot system for items. Also the is a recipe system for more powerful potions. New to 2.0, there will be a capture point system.The Goal is to destroy the infestation site. You need to follow the quests to reach the maxium level of 30, and to gain the strength to even approach the Infestation site.\n\n##### DoTA Spawn System\n\nWhat do i mean by DoTA Spawn system? I mean there are three lanes where computer controlled units duke it out. These lanes are essential to taking down the infestation. These lanes protect the entrances to both bases, so it is required to be able to balance defence with offence. There are plenty of surpirsies in the game and lets put it this way, DEFEND YOUR SPAWN TOWERS. that is all.\n\n##### Drop Pods\n\nProbably the biggest annoyance you will have the entire game are the periodic Drop Pods. They are designed to delay your advance towards the Infestation Site, if left unchecked, they can destroy your spawn towers, and leave your base wide open, forcing you to defend and bringing Defeat that much closer.\n\n##### Upgrades\n\nAs you kill the mobs, you will gain minerals, these minerals are helpful in either buying upgrades or low-tier armor (If you die) there are all the basic upgrades to choose from.\n\n##### Armor/Loot\n\nWell...tada! we have armor for your heroes, that is dropped by monsters, that can be bought in the shop, that is bought for justice points in the Cata-Shop. The items are dropped by only higher-tier monsters, and the lower tier armor can be bought/sold in the shop, and all the Armor and weapons in the Cata-Shop is incrediblly powerful.\n\n##### Recipie System\n\nWell....pretty self explaintory here.... you get items, you fuse them, you can make potions and such......duh??\n\n##### Lvl 30 Buff\n\nWhen you reach Lvl 30, you gain immense strength, and huge amounts of power. Its an insentive to try to level up through the quest system so we dont have people trying to charge the base at level 1 :P\n\n### Heroes\n\n(I am currently adding the last 5)\n\nHero : Role/Specs\n\nHunter: Balanced\n\nEngineer: Solo\n\nAssualt: Buffs/Tank\n\nMEESTAR MEHDEEK: Medic/Tank\n\nScout: Scout\n\nSniper: Bombardment\n\nErementars (there are 3): Spellcasters\n\nZedius: Melee\n\nWorgen: High class Hunter\n\nVanquish: Mobility\n\nKourai: Spellcaster\n\nBloodlord: Warlock/Sacrificial\n\n### Updates\n\nPreparing for 2.0\n\nThis means:\n\nCurrent map on Battle.net is a broken mesh of 1.4 and 2.0\n\nNew Talent Sysytem on the way (Level system was confusing)\n\nMore Heroes (Look above)\n\nA Cataclysm Shop\n\nFixed:\n\nQuest Log wasnt showing up\n\nHotkeys werent working\n\nItems appeared too often and caused massive lag\n\nHero Selection\n\nMore Unique Items\n\nDPS Meter\n\n",
    "author": "_ForgeUser6455688",
    "lastUpdated": "2011-09-08T14:14:37.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/157/125/quick_eye_candy.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/157/126/Terrain_005.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/157/129/Untitled.png"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}