{
    "id": "final-battle-will-deside-fate-wo",
    "name": "The Final Battle that will deside the fate of the world",
    "shortName": "The Final Battle that will deside the fate of the world",
    "installed": false,
    "summmary": "",
    "description": "The map is like a melee game with heroes that has more sides that can't be changed( i mean teams),also there will be basicly some plus races the dark Protoss,the Primal strain zerg(on the side of Kerrigan),Amon controlling Hybrids(almost the dark Protoss),Zaggara will be controlled by Amon and Kerrigan will have to free her & so on...\n\nBut something very important about this map is that since Zaggara will be controlled by Amon that Kerrigan will have let's say Fatalisk(a unit that will come in 3 sizes,it has the fatty model) & Zagarra won't but she will have some other units that Kerrigan won't but if anyone destroys Zagarras hive,she will borrow and unborrow at Kerrigan and join her side once more(Zagarra is immortal till then)and Kerrigan will gain acces to those units that Zagarra had.\n\nThere will be a connection with campaign(Mengsk will be a machine cause brain cells or call them nerves survived with his memory and were placed in a machine and after a couple of years his brain is fully regenarated,also Tychus survives the shot to the head and is now on the side of Mengsk)\n\ni will tell you guys the champions now: -Kerrigan -Zaggara -Abither -Dahaka -Stukov -Mengsk -Tychus -Nova -Jim Raynor -Swann -Tosh -Horner(as hyperion will be called down by one of Jims ultimate abilityes) -Other brood mothers(i mean Kerrigan will have a lot more queens as champion,basicly each queen she summons from the hatch/hive or whatever is a champion but cannot be revived or i will create a unit that can by some cases) -Tassadar -Zeratul -Kharazz -other protoss champions(i mean from Wings of Liberty the memory fragment final mission the phoenix,carrier,void ray heroes will be there)\n\ni will be adding a lot more i hope BTW i forgot to mension the full version will be realesed after Legacy of the void is realesed cause i will need to add new units abilityes heroes and so on :). For some of the evolution(rank) abilityes.The zerg will have the wild mutation or evolve ability that will increase their dmg & HP as they get kills it's for all units & heroes(Abither will insert the primals wild mutation ability in the cinematics),Abither will have an active ability that increases the dmg by 0.5 & HP by 2 for each time used with a 10 sec cooldown,Kerrigan will have also some abilityes like so,Terran will have a lot more upgrades then the Zerg(i mean instead of 3 ranks there will be maybe like 10 for Zerg,20 for Protoss,and 30 for Terran but the more the upgrades the less the dmg gets evolved so IDK like kerrigans units will get 1 dmg and 0.4 armor,as Terran will get like 0.5 dmg & 0.2 armor)There will be mercs that can be payed or destroyed to join permanetly your side till the end of the game (it only effects Terran with the payment,but with destroying it effects Protoss too :D,but as a insurance system so you don't lose all the merc workers a couple of them will be transported to your main base(the starting location),the mercs have the same things from the campaign that you hired but now you can build them inf and have bonus mercs that weren't available in the campaign. Also i forgot to mension something about the evolution(rank) system that if like marines or zerglings get 0.2 dmg & 1 HP for each kill the Thor & Ultralisk will get 0.4 dmg & 2 HP(it also counts for the Protoss).But you should be relying on your champions mostly.You can relly on some unique units too,also if like a zealot gets 40 kills you can start junling with it (there will be hostile things in the jungle to help you with the evolution system),cause it will get even more HP.\n\nThere will be items but they will be payed with Credits not minerals or gas.Also there will be 4 attributes ability power,strenth,intellegents & agility.\n\nTo be more fair i will give the Protoss HP regen cause noramally they don't have.\n\nIDK what else to say about the map exept i will need some help around the abilityes(triggers)(i will want to like the spells to do % dmg from the ability power and the champions main attribute)<sub>jungle camps & need someone to tell me were to download custom skins (a guy that has a lot of custom skins that i can use).</sub>\n\nIf you help me with anything around the map i will give you some of the credit,as for the abilityes...those people will get more credit :).\n\n",
    "author": "_ForgeUser14116231",
    "lastUpdated": "2014-04-18T09:16:11.000Z",
    "screenshots": [
        {}
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}