{
    "id": "forgotten-ones-campaign",
    "name": "The Forgotten Ones (Campaign)",
    "shortName": "The Forgotten Ones (Campaign)",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/81/969/62/62/636178341102265589.jpg",
    "description": "**ABANDONED (should've said this a long time ago, I'm not and haven't been working on this for a long time. I suggest you don't download this, it's not polished at all.)**\n\n\n\n**Overview:**This is a custom campaign by KS Numedia. It expands on a side story that serves as the prequel to Legacy of the Void. This custom campaign also features some unique mechanics as well as modified units. You play as Protoss Praetor Hanoth in this spinoff.\n\n**THE STORY:** The Protoss lay in ruins after the Brood War, with Kerrigan's Swarm annihilating planet after planet, murdering all those who interfere. Years after the legendary victory over United Earth Directorate, Dominion, and Fleet of the Executor, the Swarm has moved to attempting to erase the Terran Dominion led by Arcturus Mengsk. Jim Raynor has mustered enough confidence and strength to create the Raynor's Raiders rebel group to fight for the people. The crusade led to the downfall of the Queen of Blades, although that hardly lasted when Arcturus Mengsk ordered Jim Raynor's capture. The Queen of Blades rose once again, and she has laid waste to the Dominion once and for all.\n\nMeanwhile, the Protoss, aware of the evil fallen Xel'Naga Amon, have been gathering their numbers to take back their homeworld of Aiur from the corrupt Zerg. Their force, known as the Golden Armada, is prepared to be launched, but a powerful presence still exists on the Aiur Worldship. This presence could mean the defeat of the Golden Armada and countless years of preparation wasted. Praetor Hanoth broke into confidential military databases and assembled a few willing Protoss. He has used this technology to build up the Reclaimer Fleet. After doing so, he requested permission to attack the Aiur Worldship, to which his leaders objected. Eventually, they gave the order, still unknowing of his misdoings. Praetor Hanoth has set this plan into motion in order to fulfill his people's wishes...\n\n**Missions:**\n\n- Mission 1: The Archive of the Preservers\n- Mission 2: Moebius Boys\n- Mission 3: One Final Effort\n\n<!-- -->\n\nSCREENSHOTS AND VIDEO BY EDHRIANO (4-min of gameplay) BELOW!\n\n***VIDEO LINK!***<br>\n\n [https://www.youtube.com/watch?v=aTvUd8T6DZU&feature=youtu.be](<https://www.youtube.com/watch?v=aTvUd8T6DZU&feature=youtu.be>)\n\n***SHOW THE ENEMY YOUR FLEET:***<br>\n\n***LET ALL HELL BREAK LOOSE:***<br>\n\n***ACHIEVE YOUR GOALS:***<br>\n\n",
    "author": "ksnumedia",
    "lastUpdated": "2016-06-05T21:26:19.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/160/909/URUN.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}