{
    "id": "garmlings-revenge",
    "name": "Garmling's Revenge",
    "shortName": "Garmling's Revenge",
    "installed": false,
    "summmary": "",
    "description": "This is an unfinished storymode-style map. Set between the events of WoL and those of HotS, the map's plot is fairly simple. In essence, you play a unique Zerg creature called the Garmling. It was created by the Queen of Blades using an infested lyote. Once the Garmling and its brood were the undisputed masters of the planet Oroborous. These Zerg had slaughtered the planet's Protoss guardians, remade it into a volcanic wasteland in the image of Char and infested every corner of the landscape. But all of that taxed the Garmling's energy, so it was forced to burrow into the ground to rest. While it slept, the Xel'naga artifact was used against the Queen of Blades, causing her to lose much of her power. On Oroborous, the Garmling awoke instantly when it realized the Queen's mind was gone, but it was too late -- the loss of her influence meant that the Garmling wasn't powerful enough to control a whole planet's worth of Zerg on its own. They all reverted to a feral, animalistic state of being.<br>\n\n<br>\n\nThen, to add insult to injury, the Terran Dominion arrived in force, meaning to claim Oroborous for their own and strip it of its rich jorium deposits. The wild Zerg, lacking unity, were largely destroyed.<br>\n\n<br>\n\nNow the Garmling is really, really pissed. The loss of the Queen was an injury, but the Dominion's presence is an insult. It will have its revenge, or die trying...<br>\n\n<br>\n\nMind Control wild Zerg units. Use Mind Controlled Overlords as Consumption monkeys, raiding them for energy to fuel the Garmling's psionic abilities. Some units and structures are immune to Mind Control and must be destroyed for the safety of the Brood. Occasionally, you will discover a structure that the Terrans overlooked and gain the use of it. In this way, the Garmling can capture what's left of its Brood and use these remnants to rebuild, at least enough to wipe those pesky Terrans off the map... Use your available units and resources carefully to destroy each Terran unit group, base, or town while losing as little as possible.",
    "author": "_ForgeUser6303432",
    "lastUpdated": "2013-02-28T05:29:28.000Z",
    "screenshots": [
        {}
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}