{
    "id": "heart-swarm-1-bad-hair-day",
    "name": "Heart of the Swarm #1: Bad Hair Day",
    "shortName": "Heart of the Swarm #1: Bad Hair Day",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/81/485/62/62/636178331590524345.jpg",
    "description": "UPDATE: Instead of starting a new hive cluster from a couple drones, you \"rescue\" a hatchery and spawning pool along with a bunch of drones and overlords to get you started. Also, the enemy is much more tougher now. (You won't be able to beat it with just the heroes anymore!)\n\nGreetings everyone. By now I'm sure you've all beaten Wings of Liberty and bragged about it online or offline, so I can't spoil it for you. I'm sure you loved the ending, with Jim carrying Sarah off into the sunrise. (After it RAINED on CHAR!!!!!!!!!!!!!) However, if you're true fans (and I know you are) it still left you craving for more. And like me, you simply cannot bear to wait a half-decade or more before Heart of the Swarm comes out. I mean, what happens after that? Does she join the Raiders on the Hyperion and leave the rebuilding to her cerebrate? Does she shove a nuke up Mengsk's south end? Does Kate Lockwell insist on an interview? How do the Protoss react? How does Sarah get her hair back to normal? Will the dynamic duo tie the knot in secret or prefer an elaborate ceremony with Horner as the best man and Zeratul as the pastor? (Okay, go ahead and laugh. Lol.)Will all three races stand united against the Fallen? So many questions and no real answers. And so, I am proud to present Heart of the Swarm Mission #1. I hope you enjoy it, or at least get a laugh out of it. As for what to expect, here it goes:\n\nThe conversations are shown thru transmissions with text and no sound. Please note that in cutscenes, the text appears on the very bottom of the screen, starting in the left-hand corner. As a result, you might otherwise think there is no text there. It sucks I know, but there's nothing I can do about it. Also, it takes a few seconds for a character's portrait to show up for the first time, so if you see nothing but static for the first few seconds, that's normal. Your goal is to destroy the small Dominion base in the upper right corner of the map. Build up your forces and wipe it out. Anyway, tell me what you think, expect the next mission soon and enjoy!\n\n![http://static.sc2mapster.com/content/images/23/932/Untitled.jpg](<http://static.sc2mapster.com/content/images/23/932/Untitled.jpg>)\n\n",
    "author": "_ForgeUser4468584",
    "lastUpdated": "2010-08-16T18:27:25.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/159/79/Untitled.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}