{
    "id": "insurrec",
    "name": "Starcraft: In(Re)surrection",
    "shortName": "Starcraft: In(Re)surrection",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/81/966/62/62/636178340831862110.jpg",
    "description": "**Current Status** Mission 1-4 finished terraining.\n\n## **Introduction**\n\n- How this campaign came about? \n\n<!-- -->\n\nI was watching jay borinos playthrough on insurrection and after the first few mission i realized why this campaign was never remade by someone else. Watching more and more \\*random guy: are u crazy?\\* i got convinced that with a little bit of creativity and work one could transform this into something much more. I told myself: Hey u get the gameplay,dialogue even voice actors...why not change it yourself? I went to work and the more i researched the more i realized im facing an impossible task.\n\n## **Story**\n\n- What this campaign is about \n\n<!-- -->\n\n- random guy: What is this tell me!\\* Easy there buddy. This campaign is set in the broodwar era (offers same units). Story: \"A group of politicians who arent happy how thing are run within the government have formed a rebel group called \"Fist of Redemption\". At the helm of the government lies atticus carpenter a scrupulous man who will not stop until every zerg is obliterated form existence.. Bill Constantine (now a traitor and wanted man and brother of atticus) has been given a shot to fight his brother and the confederacy itself.\" It will offer 7 missions each per campaign starting with terran and finishing with zerg (For the swarm!).Yep you heard it right! JACK FROST IS BACK BOYS! Unfortunately tsuname had a \"accident\" and couldn't make it. R.I.P. tsuname u crazy bastard! \n\n<!-- -->\n\n- random guy: why would i play this??\\* Im glad u asked random guy! I wont say things like: this campaign offers amazing this and that gameplay! The game will speak for itself once its done. All i can say that i added variety to missions. You will see brood war units and new stuff... u wont be able to play vulture \\*random guy: why?\\* Uh their model is so ugly. I will try to make the missions have variety so its not all kill everything kinda map ala original insurrection. \n\n<!-- -->\n\n## **Clarification:**\n\nI just want to clarify: This is not insurrection per se. I have rewritten this script so much the only thing left are names and places/planets. I took liberty to steal names from this campaign and maybe a map idea or two but thats it. Once this campaign comes to life u wont recognize barely a thing. Given that i discarded a lot of story i couldn't use any voice acting and neither any of the sahara desert locations.\n\n**The original insurrection:** Im sorry for those fans out there who liked this campaign but i give u an advice. U have maps that are stretched to eternity with no detail. U have gameplay that consist 98% of kill everything. You have a tame story with weird silly characters. Than u ask yourself why make it? If u have to kick a lot of stuff out until there almost nothing left why not do something new?\n\n## Missions Progress\n\n#### **Terran Campaign**\n\n- Mission 1 - ??? (Terraining finished) \n- Mission 2 - ??? (Terraining finished) \n- Mission 3 - ??? (Terraining finished) \n- Mission 4 - ??? (Terraining finished) \n- Mission 5 - ??? (Planning) \n- Mission 6 - ??? (Planning) \n\n<!-- -->\n\n#### **Protoss Campaign**\n\nPlanning\n\n#### **Zerg Campaign**\n\nPlanning\n\n## **Credits**\n\nTerraining by\n\n- CybrosX \n\n<!-- -->\n\n",
    "author": "_ForgeUser22499777",
    "lastUpdated": "2016-04-28T00:52:24.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/160/889/4tKI3sQ__1_.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/160/890/FPv5Gfz.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}