{
    "id": "invasion-auir-10-players-similar",
    "name": "The Invasion Of Auir - [10 Players] - (similar to Kerrigan's Demise)",
    "shortName": "The Invasion Of Auir - [10 Players] - (similar to Kerrigan's Demise)",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/79/959/62/62/636178316939687403.jpg",
    "description": "## The Invasion of Auir\n\n\n\nRemember Kerrigan's Demise from Broodwar? I'm bringing that masterpiece back in a new form called The Invasion of Auir.\n\nIf you're not familiar with Kerrigan's Demise another example is a Warcraft III map called PreLOTR: War of the Jewels. You own two or more capital buildings each of which that periodically spawn your military units depending on your Tech Level. Your tech level is advanced at one of your capital buildings, each new tech level makes your periodic spawn of military units more powerful. Each player has heroes that must be used wisely since they cannot be resurrected once they die. Heroes are extremely useful for assaulting the enemy base but you can really screw yourself over if your hero dies if you don't micro your assaults effectively. However you can also gain a massive advantage if the enemy accedently leaves one of his heroes in the open and you kill it.\n\n### Setting\n\nThis map will take place during the end of the Zerg campaign along with the entire Protoss campaign from vanilla Starcraft all assembled into a single multiplayer 4vs3vs3 epic battle royal packed with imported voice dialog from vanilla Starcraft. I loved the campaign for Starcraft and I really hope to bring it back in a fresh re imagined fashion with this game.\n\n### Players And Teams\n\nThis won't just be a simple battle of good vs evil, there will be 3 teams: Sons of Auir, Zerg Swarm, and the Allied Forces.\n\n#### Sons of Auir\n\n##### (4 Players)\n\nThe Sons of Auir will consist of Aldaris, The Conclave, Fenix, and The Vanguard of Auir. This team will initially have the home field advantage but their larger team size is not static. Fenix and The Vanguard of Auir are loyal descendants of the templar cast, but if Aldaris and The Conclave fall than they will automatically join the Allied Forces (Raynor, Zeratul, and Tassadar). So the Zerg Swarm needs to plan out their invasion accordingly in order to not disrupt the civil policies of the Protoss homeworld. Aldaris and The Conclave are obligated by the Khala's law to destroy the blasphemous Dark Templar along with the traitor Tassadar. This way it is more accurate according to the campaign since Fenix stays on Aldaris's side but joins Tassadar later after realizing the gravity of the Zerg threat.\n\nThe Vanguard of Auir player is subject to change to possibly Artanis instead, but once I have more time to read up more in depth with the lore I'll make the final decision at another time.\n\n#### Zerg Swarm\n\n##### (3 Players)\n\nThe Zerg Swarm will be Kerrigan, The Overmind, and a Zerg Cerebrate(still haven't decided on what to name the cerebrate). The Overmind's primary goal will be to destroy the capital building of The Conclave and be made manifest in its place which will give the Overmind player a massive advantage by giving him or her another spawning point as well as a new and better hero that will replace the Overmind Birth Mother(brought to The Conclave ruins in order to birth The Overmind building). If the Overmind is born then The Sons of Auir will finally come to their senses and join the Allied Forces.\n\n#### Allied Forces\n\n##### (3 Players)\n\nThe Allied Forces so far is my favorite team since they are the most diverse. They will be Tassadar, Zeratul, and Jim Raynor (they are the only team with a terran player.) Similar to the Protoss campaign, you can choose to attack The Conclave and Aldaris first in order to persuade Fenix and The Vanguard of Auir to join you.\n\n### Overall Vision Of The Game\n\nSo it's not EXACTLY accurate according to the Starcraft lore but I want the outcome of every game to be a different and more dynamic experience so the map itself won't go stale. You get the chance to revisit and rewrite the story in your own way.\n\n### BETA Video\n\nSo the video you're about to watch is played as Zeratul but with SHARED CONTROL turned on, I did this purely for testing purposes. In the real game you will only control one player and each player will have his/her own unique intro dialogue. Hope you like it:\n\n(SC2mapster admins are more than welcome to feature this on the news page of this website)\n\nI'm going to use this thread for updates on the status of this map and I'll leave a date and time indicator for every milestone or important update info on this map's status right here in this thread.\n\nI'm putting a lot of detail into every little doodad, trigger, dialog scene and unit in my spare time as I work on this map. In the next couple of weeks this map will have more details at CiniCraft.com on one of the left sidebars that say \"coming soon\". I've been working on this project for over a year now, I will not release this map until it is PERFECT. (I was obsessed with Kerrigan's Demise and I've been very dissappointed with the 'popular' custom maps for Starcraft II)\n\n### Find Me CiniCraft On Battle.net:\n\nJoin the channel \"Philadelphia\" on battle.net. I've been playing a lot of Starcraft II lately, you may also find me playing Diablo III! :D\n\nSo that's all I can say about the map so far, tell me what you think about it from the video!\n\n(Updates on this map's status will go under this line in the future)\n\n### [www.CiniCraft.com](<http://www.cinicraft.com/>)\n\nThis is my website. It is still in it's early stages since it went live in December 2012. There will be more information on this map at CiniCraft.com soon. [http://www.CiniCraft.com](</linkout?remoteUrl=http%253a%252f%252fwww.cinicraft.com%252f>)\n\n",
    "author": "cinicraft",
    "lastUpdated": "2013-01-16T02:50:38.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/154/64/original_minimap_copy_copy.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}