{
    "id": "legends-of-war",
    "name": "Legends Of War",
    "shortName": "Legends Of War",
    "installed": false,
    "summmary": "",
    "description": "## **Project - Legends of War**\n\nStatus: *In development*\n\nThe main idea is to push the Galaxy Editor to its limits to see what it’s capable of, and to set some groundwork for other mapmakers to help them with their projects.\n\nWe are creating a 1-4 player campaign, with a fully customized UI with a 3rd person style game play.\n\n~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~\\-\n\n### ***Mechanics:***\n\n**Customized UI** Will include features like Minimap, Gun Selector, Ammo count, Objectives, Side Quests, Inventory, much more to come.\n\n**Fully Explorable Area** \\- Maps will be able to compare to the original campaign. A free roam area with explorable environments: Underground, Jungles, Cities, Inside buildings, ect...\n\n**Weapons** \\- Weapons like the Ghost's sniper, Marine's Rifle, weapons of the Firebat, Marauder, and Reapers will be available through the campaign [Debating if you can only hold 1 weapon or be able to switch like in other games such as MW or Halo] Maybe even grenades.\n\n**Interactive Enviroment** \\- Functions like doors, gate, light switches, containers will be implemented as sometimes you will be traveling through pitch black caves or exploring volcanic worlds like Char\n\n**Lootable Items** \\- I’m not trying to create a MAJOR rpg, just an action series with an RPG element for easy playability and replayability. Items like ammo, health vials, and other items can be lootable. Weapon modifications, and any upgrades from the actual game can be implemented. Like the concussive shot from the Marauder could be an item. Maybe even the Reaper's Jetpack can be an item.\n\n**Change of Gameplay** \\- Missions varying from 1st person veiw, 3rd person veiw, controlable vehicles (Seige Tanks, Banshees, Hellions), or even control the whole battlefield classic SC style. ~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~\\-\n\n#### ***Legends of War - Campaign***\n\n***Prologue - Reach the Recluse Science Facility.***\n\nObjective - Set a baseline for the Legends Of War series\n\nTileset - Tarsonis\n\nMood - Low lighting, evidence of bloody battles. Similar to the indoor facility tile-set in SC1\n\nWorking on\n\n- [x] 3rd person controls \n- [ ] Better 3rd person controls \n- [x] Beginning Cinematic (Cant be implemented because of bug) \n- [x] 'Meet the Captain' Cinematic(Cant be implemented because of bug) \n- [ ] Invetory System \n- [ ] Custom Weapons \n- [ ] Hero System \n- [ ] 4 Player Co-op \n- [ ] Custom UI \n- [ ] Finish the Map \n\n<!-- -->\n\n(More to come)\n\nAproximated time to complete - ???\n\n***Episode 1 - Escape!***\n\nObjective - Escape from an abandoned Covert Ops Facility.\n\nTileset - Indoor Facility\n\nMood - Low lighting, evidence of bloody battles. Similar to the indoor facility tile-set in SC1\n\nDescription - This mission will be in 3rd person view from start to finish. It will be fairly easy, with limited enemies to start the player(s) out. As you progress through the map there will be certain 'ambush' and 'hold out for X many minutes' stages. The map ends when you exit the Docking Bay room of the facility and out into the city.\n\nAproximated time to complete - 30 min\n\n***Episode 2 - Fall of Tarsonis***\n\nObjective - Protect Tarsonis from the zerg swarm.\n\nTileset - City\n\nMood - Ruined city, zerg forces running around, sky is dark and full of smoke. Gunshots and screams from humans and unknown creatures can be heard.\n\nDescription - In this mission it will be more open and room, not close-quarter combat in Episode 1. Here we will be testing controlable vehicles. It starts right outside of the Covert Ops building you had just escaped from. You head across a long bridge meeting minor resistance such as a few zerglings and roaches. Once at the end of the bridge you meet a wounded marine that will tell you to head to a military outpost near the Terran Dominion Museum. This is where 2 players will control Siege Tanks while the other 2 players will follow on foot. On the way to the outpost, you will meet enemies such as L1, L2 Zerglings, Roaches, and a few Brood Lords. (Siege Tanks will be able to shoot air) Once you arive at the military outpost all they players will return back to ghosts and have to defend the museum for 7 minutes.\n\nAproximated time to complete - 40 min\n\nConcept\n\n[http://www.sc2armory.com/files/screenshots/350.jpg](</linkout?remoteUrl=http%253a%252f%252fwww.sc2armory.com%252ffiles%252fscreenshots%252f350.jpg>)\n\n[http://www.sc2armory.com/files/screenshots/349.jpg](</linkout?remoteUrl=http%253a%252f%252fwww.sc2armory.com%252ffiles%252fscreenshots%252f349.jpg>)\n\n[http://www.sc2armory.com/files/screenshots/353\\_md.jpg](</linkout?remoteUrl=http%253a%252f%252fwww.sc2armory.com%252ffiles%252fscreenshots%252f353_md.jpg>)\n\n***Episode 3 - More Bang for your Buck***\n\nObjective - Locate Gamma Base\n\nTileset - Desert\n\nMood - Sandstorms, Mid-day, wreckage of tanks and battlecruisers decorate the landscape\n\nDescription - The players are on the planet Mar Sara. They arrive in a dropship and get unloaded into a narrow canyon. The players get briefed by an unknown human. The players to will make their way to a Terran Base which is currently under attack. After killing the remainding zerg attack force, the game will pan out and turn into the classic RTS style. All players will have their own base located at the very left of the map. Now they must destroy a VERY strong zerg army, units like the firebat and vulture will be included\n\nAproximated time to complete - 1 hour\n\n***Episode 4 - ???***\n\nObjective - ???\n\nTileset - ???\n\nDescription - Any suggestions?\n\n",
    "author": "_ForgeUser4301695",
    "lastUpdated": "2010-04-11T20:45:56.000Z",
    "screenshots": [
        {}
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}