{
    "id": "lifeforce",
    "name": "LIFEFORCE: Mercenary Campaign",
    "shortName": "LIFEFORCE: Mercenary Campaign",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/81/980/62/62/636178341698292108.jpg",
    "description": "\n\n## Full site, game download, and gameplay video at:\n\n## ↓ ↓ ↓ ↓ ↓ ↓ ↓ ↓ ↓ ↓\n\n[LifeForceCampaign.com ← CLICK](</linkout?remoteUrl=http%253a%252f%252flifeforcecampaign.com%252f>)\n\n## ↑ ↑ ↑ ↑ ↑ ↑ ↑ ↑ ↑ ↑\n\n# Meet the Mercs\n\n## LifeForce is a professional-grade single-player campaign with all new heroes, units, abilities, and an enthralling storyline that will keep you addicted through every mission.\n\n- Never-before-seen models that are unreleased even to mapster \n- Four total missions available, each with unique macro (base building) and micro (fixed force infiltration) gameplay elements \n- An upgrade panel so you can strategically power up your units between missions, just like Blizzard's campaign \n- \"Choose your own adventure\" story where your decisions greatly impact the course of the game \n- Exciting cinematics that are more than just units staring at each other talking \n- An incredible amount of polish and balancing, so it feels as good as (if not better than) a Blizzard production \n- Story and dialogue proofread by a professional writer, so there's no grammar errors or broken English \n\n<!-- -->\n\n\n\n# All new stuff!\n\nEvery single unit in this campaign is customized and doesn't appear in its default form. But don't worry, each unit is introduced intelligently and at a pace that's intuitive to learn. You won't be overwhelmed with all sorts of crazy stuff you don't understand—the progression feels natural and is taught through gameplay, not big walls of text (again, just like a Blizzard campaign).\n\n\n\n# Story\n\n## The year is 2496, 4 years before the events of Starcraft 1.\n\nThe Terrans build their empire quietly in the Korprulu Sectore, unaware of the Zerg or Protoss. As the reach of the Confederacy expands ever outward into space, the fringe planets become increasingly lawless. Mercenary corporations spring up, offering to handle the dirty work of the highest bidder.\n\nYou have just been promoted to the rank of Magistrate of one such group: The LifeForce Mercenary Corporation.\n\nSometimes you'll be fanning the flames of war. Sometimes you'll be extinguishing them. Will you go through with your assignment, no matter how grisly? Or will you hold your moral high ground, repercussions be damned? Your destiny is yours alone.\n\n# How to play\n\n## Click Here: → [LifeForceCampaign.com](</linkout?remoteUrl=http%253a%252f%252flifeforcecampaign.com%252f>)\n\nCampaign is now released, go to above link and play now.\n\n# The Future of LifeForce\n\nI'm currently working with some very talented voice actors to bring an even higher level of coolness and professionalism to this campaign.\n\n",
    "author": "bilxor",
    "lastUpdated": "2016-12-07T22:14:28.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/160/956/adjutant.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}