{
    "id": "limpid-campaign-mission-1",
    "name": "Limpid Campaign",
    "shortName": "Limpid Campaign",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/81/974/62/62/636178341377060475.jpg",
    "description": "## Limpid Campaign\n\nLimpid Campaign takes place in a parallel world from the Starcraft 2 Universe, it can be considered a parody of the original story, in spite of the fact that the story is not yet set in stone. The story will manifest itself not necessarily on a linear stage because writers are not cheap and ones imagination goes so far.\n\nThe idea behind this project is to fully transition from the Warcraft 3 editor to the Starcraft 2 one, and this might be the ritual in witch i do so. I don't have too many expectations that this campaign will be any good since i am not a skilled mapper in Sc2, but i will try my best to make the trilogy i always dreamed of.\n\nThe starting maps will be based on Blizzards Editor tutorials, since that is what i use for reference. Bashing me with negative feedback is always a good way to learn so don't hesitate!\n\n**The maps released for testing are most likely not in the final stage, especially on the character conversations part, that will be heavily modified.**\n\n## Characters so Far\n\n#### Terran Characters\n\nThe Main character for the Terran Campaign is \"Rotang\" , a bad ass leaping Firebat, just appointed the position of Field Commander on the fringe world of Angraria , one of the Dominion's primary colony worlds. He is also a very known persona in the ranks of the civilians because of the many good deeds he has done, not every time in the most orthodox way, but hey, a good deed is a good deed, right?\n\nJackson Morrison, also know as the leader of Jacksons Rebels. A fierce man known for the terror he inspires across the galaxy. But to what purpose? No one knows the true reason why the rebelion was made in the first place. Opposition against the dominion ? A lust for Power?\n\n#### Zerg Characters\n\nComing soon!\n\n#### Protoss Characters\n\nComing soon!\n\n## Story so Far\n\n#### Terran Campaign\n\n- Mission 1 \n\n<!-- -->\n\nAlthough Rotang just arrived on the colony, the planet quickly shows its true nature, a place filled with violence, Rebels, Zerg... If the newly appointed commander has any chance of restoring order to this planet, its going to take all the bubble gum chewing, cigar smoking, zerg roasting one can do.\n\n- Mission 2 \n\n<!-- -->\n\nAfter the rescue of the mining camp Rotang was in disarray. What could the Dominion of Man possibly be extracting? He knows that there are several extraction sites situated around Angraria, but no reports of them ever being ordered or who is behind them. But whats most troubling is that Dark Voice that stalked him... What could it have meant ? The future ?\n\nA few hours later, Rotang was on his way back to Central Command, when suddenly, time stood it place... Literally.... He could feel time itself being torn apart and was left only with a whisper... a whisper of the future...\n\n#### Zerg Campaign\n\nComing soon!\n\n#### Protoss Campaign\n\nComing soon!\n\n## Limpid Campaign Progress\n\n#### Terran Campaign\n\nTerran campaign will have around 7 missions.\n\n- Mission 1 - Released! (ver 1.2) \n- Mission 2 - 85% \n- Mission 3 - In progress. \n- Mission 4 - Still Planning \n- Mission 5 - Still Planning \n- Mission 6 - Still Planning \n- Mission 7 - Still Planning \n\n<!-- -->\n\n#### Zerg Campaign\n\nZerg campaign will have around 7 missions.\n\n- Mission 1 - Still Planning \n- Mission 2 - Still Planning \n- Mission 3 - Still Planning \n- Mission 4 - Still Planning \n- Mission 5 - Still Planning \n- Mission 6 - Still Planning \n- Mission 7 - Still Planning \n\n<!-- -->\n\n#### Protoss Campaign\n\nProtoss campaign will have around 7 missions.\n\n- Mission 1 - Still Planning \n- Mission 2 - Still Planning \n- Mission 3 - Still Planning \n- Mission 4 - Still Planning \n- Mission 5 - Still Planning \n- Mission 6 - Still Planning \n- Mission 7 - Still Planning\n\n<!-- -->\n\n",
    "author": "_ForgeUser25687119",
    "lastUpdated": "2016-06-29T19:48:30.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/160/937/Terrain_005.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/160/938/Terrain_003.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/160/939/Terrain_001.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}