{
    "id": "maat-nigel-working-title",
    "name": "Matt & Nigel (Working Title)",
    "shortName": "Matt & Nigel (Working Title)",
    "installed": false,
    "summmary": "",
    "description": "## Update 3rd of July 2011\n\nI just want to get some things straight with you guys. Making [Stranded on Korhal](<http://www.sc2mapster.com/maps/maat-nigel-working-title/>) was a real pain in the ass, the Galaxy Editor was really not user friendly back then and I hardly touched it since. I'll share with you my plans and where it went wrong. Like it says in the Current Status below, I planned on making a Story Mode setting. I had everything there; the storyboard, the characters, the lines; even the voice overs. The only thing I was missing were the custom models I had envisioned. I've asked a friend to do it, but he never got around doing it. At the same time I created more interest for other aspects in my life, so the whole project sort of slipped my mind. Paired with my increasing disinterest of Starcraft 2's gameplay I stopped being a part of the community altogether.\n\nSo is this the end to Matt and Nigel? Can't say for sure, but I have a little spot for these guys in my heart and with the good news I heard about Heart of the Swarm's Galaxy Editor changes I might get the enthusiasm to once again work on the project, we'll see. I'll put it this way: If I ever create another SC2 map, it will be about Matt and Nigel and it will be high quality.\n\nI have a lot of other things on my mind nowadays, so I'm not sure if I could find the time to work a map. But, to get your hopes up, if there is someone out there who has figured out a way to export models+animations from the Galaxy Editor, edit them, and import them back, don't hesitate to contact me! I dare to claim you will be working on one of the greatest campaigns for SC2 ever conceived.\n\nFor now I want to thank Travis Lynch (OldOneEye1987) for doing amazing voice acting for all the characters in 'Stranded on Korhal' and the Story Mode setting I was working on. As well as the sc2mapster community, many of your threads and tutorials helped me achieve what I know nowadays. And to the people who gave feedback on 'Stranded on Korhal' a big thanks, couldn't have done it without all of you!\n\n\\-Insidious\n\n### Mar Sara\n\n![Mar Sara](<http://img602.imageshack.us/img602/4442/marsararounded.png>)\n\n### Introduction\n\nMatt Dalton has arrived on Mar Sara and is being transported to the town of White Rock, a small town which mainly houses miners. Recent uprisings such as mining camp revolts have resulted in the Dominion needing to take action. Matt is a Dominion soldier who volunteered to act as a deputy to calm things down.\n\n## Current Status\n\nThe only map available right now would be [Stranded on Korhal](<http://www.sc2mapster.com/maps/stranded-korhal/>) which I made back in the Starcraft II Beta. It should give some implication of what this campaign will be like, though the actual story has changed quite a bit. However, the personalities of the main characters are close to what I want them to be. Story Mode was not available to use back then, so I had to put the dialogue straight into the map. In the upcoming maps you will see a lot more focus on actual gameplay, while the Story Mode handles the dialogue.\n\n## Next Update\n\nI'll be working on a functional Story Mode setting. It will give an early impression of what you can expect of the quality of the Story Mode settings and a short introduction to the first mission.\n\n## The Project\n\nMatt & Nigel will be a campaign through the eyes of a Dominion soldier; Matt Dalton. The structure of the campaign will be much like Blizzard's Wings of Liberty, including Story Mode and cutscenes to enhance the experience. The mission structure will also be familiar to anyone who has played the Wings of Liberty campaign. If it's not too complicated and too much work, there will be custom upgrades for the units that will carry over to the next mission. All the dialogue will be completely voiced over and I'm pleased to announce that Travis Lynch will be working with me again. He did all the voice overs in [Stranded on Korhal](<http://www.sc2mapster.com/maps/stranded-korhal/>).\n\n## Links\n\n![YouTube](<http://img576.imageshack.us/img576/9779/smallportraitrounded.png>)\n\n[YouTube Channel](<http://www.youtube.com/mattnigelsc2>)\n\n",
    "author": "_ForgeUser4360226",
    "lastUpdated": "2010-11-06T21:33:44.000Z",
    "screenshots": [
        {}
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}