{
    "id": "morals",
    "name": "MORALS",
    "shortName": "MORALS",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/81/962/62/62/636178340241720245.png",
    "description": "![placeholder](<http://i.imgur.com/u8cZfX8.png>)\n\n#### DESCRIPTION\n\nThis series was planned out late last year but I never got around to further developing it until now. The main goal of this campaign is to provide a much more micro intensive way to play the game with only just using two units. As such, the game is focused on the notion of skill shots and using your abilities to dodge attacks or evade enemies. However, it doesn't stop there, as stealth is also being planned to be added to this campaign.\n\nImportantly, because of the fact that one may be unfamiliar with the controls and I am too lazy to implement a training mission yet, I strongly recommend to play around with the abilities and to save regularly (THIS IS IMPORTANT AS EVEN I GOT REKTED WHEN PLAYING).\n\nThe way you play the game is by using your attack ability as an ability that you have to target a certain location to fire at. Evading requires you to use an ability called dash, which triples the speed of a unit and allows for it to go through units.\n\n#### INSTALLATION\n\n1\\. Download the files and extract them to a folder.<br>\n\n 2\\. Get the Morals.mod file and place it into the mods folder for Starcraft II:<br>\n\n- C:\\Program Files (x86)\\StarCraft II\\Mods (For 64bit users) \n- C:\\Program Files \\StarCraft II\\Mods (For 32bit users) 3. Open the Moral\\_01\\_Setting\\_Up\\_A\\_Foothold.SC2Map file and just test it.<br>\n\n     4\\. Enjoy<br>\n\n\n<!-- -->\n\n#### STORY\n\n*Since it was the introduction mission, which introduces the new style of playing, that contained a large amount of opening story. I will provide the introduction story so that the current mission will be able to make sense.*\n\nThe story revolves around the Sol Police Force (SPF) and their struggles to be relevant in policing the Solar System as private military corporations (PMC) and as well as government military forces are beginning to overlap into peace keeping roles. One of the most significant PMC is the Sektor Military, as they began to engage in a political power struggle against the SPF. Not only are the SPF losing power, they are also losing men to Sektor. In a desperate attempt to remain relevant in the Solar System, the SPF tried to infiltrate the SPF and take it down from the inside. However, this plan backfired tremendously as it not only caused multiple SPF officials to resign, it also allowed for Sektor to further cement control over the SPF by installing their \"advisers\" to help the SPF through this difficult time.\n\nYou play as both private Norton and Bourke. Bourke is a veteran to the SPF but remained a private to avoid all of the political issues, while Norton is a new comer, who has yet to display skills in real life operations but nevertheless has impressive test scores. Both soldiers are under the command of Douglas Smith, who was the few commanding officers that did not resign after the horrific incident.\n\nThe first mission plays from Smith giving both Norton and Bourke an operation in which they will need to recover stolen property from a local military base. While the situation looks like it was planned by the Sol Military to further destroy the structure of the Sol Police, Smith suspects that the resources were stolen by a third party and that the military base was just used as an unsuspecting storage area. Whatever the reason was, it is important to recover the resources or else the Sol Police will be shut down ...\n\n#### BUGS AND GLITCHES\n\nBecause of the fact that this is a new system that I made, bugs and glitches are to be expected but that doesn't mean they should be overlooked. If you find any bugs and/or glitches, please do not hesitate to report them in the comments. Also, as my English skills are pretty poor, if you do find any grammar errors, please report them as well.\n\nWhen reviewing this campaign, please keep the feedback please be constructive.\n\nI hope you have fun.\n\n",
    "author": "_ForgeUser18197471",
    "lastUpdated": "2016-03-22T13:09:04.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/160/872/morals.png"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}