{
    "id": "my-nightmare-stars",
    "name": "My Nightmare of Stars",
    "shortName": "My Nightmare of Stars",
    "installed": false,
    "summmary": "",
    "description": "Hi folk! Finally I’m making this post. In the last year I wanted to show my project, but there wasn’t much to reveal. <br>\n\n After hours and hours spent programming all the aspect of the game (mod), finally I can show you some good stuff. <br>\n\n### **HOW IT BORN** \\=== <br>\n\n\n\nYou may already know FTL: Faster Then Light, an indie game that came out about three years ago. When I played it, I got really impressed and I wanted to make a Starcraft 2 mod inspired to it. Unfortunately, I wasn’t good at scripting as I’m now, so after several attempts to program some features, I gave up. A year ago, during a class lesson (I study informatics engineering) I got the illumination. When I got home, I opened the editor and I started to do stuff. The mod I want to make is not 100% similar to FTL (would have no sense since that game already exists) but inspired to it (let’s say 40%). <br>\n\n### **THE IDEA** \\=== <br>\n\n\n\nThe basic idea is to make a semi-realistic spaceship management simulation. You control your own ship and crew and you can travel through a procedural generated space. There are some particular and unique game mechanics that I’m going to share with you in this post. First of all, I never liked the fact that in almost all videogames and TV shows where there are spaceships, the whole crew is useless. For real, take for example Star Trek or Mass Effect, with the exception of the main cast the other spaceship members have zero impact on the story. <br>\n\n<br>\n\n So there you recruit every single member of the ship with attention, everyone has his peculiar utility. <br>\n\n<br>\n\n Another important aspect of the mod will be the difficulty. I wanted to make the game mechanics as most difficult and challenging possible. <br>\n\n\\\n\n### **THE PLOT** \\=== <br>\n\n\n\nWill be revealed.<br>\n\n### **SHIP’S ROOMS** \\=== <br>\n\n\n\nThe rooms are upgradable, but I didn’t decide yet if to implement an energy system similar to the FTL one or something different.<br>\n\n \\- **Cockpit**: Not much to say, is the room from where your crew pilot the ship.<br>\n\n \\- **Sensors**: The union between your crew member assigned to the room and the upgrade level of this determine what you can find with a scan.<br>\n\n \\- **Door Control**: If you control this room, you can slow or trap invaders blocking the doors.<br>\n\n \\- **Infirmary**: You will heal your crew members here, or make important researches like finding a cure for a disease or stuff like that.<br>\n\n<br>\n\n \\- **Psychologist**: An interesting game mechanic will be the mental sanity of your crew. If they are too much stressed, they could attempt acts of madness like sabotage or suicide (you know, be in the space for a long time could be devastating).<br>\n\n \\- **Drones Room**: Like in FTL, you will be able to mount several drones on the ship to automatically repair, extinguish fire or defend the ship from invaders (or even invade).<br>\n\n \\- **Laboratory**: This is another aspect that I really wanted to make a reality. I will speak in the future of what you can do there. And yes, these are cages.<br>\n\n \\- **Other rooms** are: **Vital Support**, **Engines**, **Teleport**, **Weapons** and **Shields** and others not implemented yet.<br>\n\n<br>\n\n Perhaps some of these rooms will not be contained at once in all the playable ships (yes, there will be more playable ships).<br>\n\n### **THE CLASSES** \\=== <br>\n\n\n\n\\- **Pilot**: Everyone can pilot the ship (or you could get stucked if you pilot dies, that’s not cool) but only a pilot can do it with style.<br>\n\n \\- **Fighter**: Their task is to defend the ship from invaders, or to board the enemy ships.<br>\n\n \\- **Engineer**: They excel in repair, engines, weapon and shields.<br>\n\n \\- **Scientist**: They can make researches and also cover engineers roles but with less effectiveness.<br>\n\n \\- **Psychologist**: They can make therapy for crew members.<br>\n\n \\- **Doctors**: They can improve infirmary’s effectiveness, research cures and be psychologist but with less effectiveness.<br>\n\n All classes can pilot, repair and extinguish fire.<br>\n\n### **CAPTAIN CREATION** \\=== <br>\n\n\n\nYes, you can create a custom captain with custom background (the race depends on the starting ship [I’ve to still decide yet how this will work but the creation system is already done]).<br>\n\n### **SPACE BATTLES** \\=== <br>\n\n\n\nThere will be space battles similar to FTL ones, but with better graphic and gameplay! (The ship spawn system is already created) <br>\n\n<br>\n\n### **SPACE TRAVEL AND RANDOM EVENTS** \\=== <br>\n\n\n\nSpace creatures, missions on planets surfaces (you can choose the members to send in mission, direct control not planned for now), rescue missions, space creatures encounters, shops, black holes, quasars, maybe even star bases and much more. <br>\n\n<br>\n\n### **FOR GEEKS** \\=== <br>\n\n\n\nImplementing some algorithms was really (+really\\*1000) hard, but after losing a huge part of my brain I finally did it. The challenging ones that I solved:<br>\n\n \\- A very efficient path finding algorithm for the AI (how can I choose the best path between doors?).<br>\n\n \\- Dynamic (not ship depended) fire and oxygen spread algorithm.<br>\n\n \\- Random space generation.<br>\n\n \\- Drones management.<br>\n\n \\- Ships Spawn<br>\n\n In future, on request, I could make some of these public and reusable (but not at moment).<br>\n\n### **MULTIPLAYER OR SINGLEPLAYER?** \\=== <br>\n\n\n\nDo you honestly think that such complex “map” can be multiplayer? There are so many scripts that would impossible (for now) to synchronize them online.<br>\n\n But maybe, and I say MAYBE, when everything is done and well debugged, I could create an external program (in C# perhaps?) that could allow some kind of interaction or trade between players. <br>\n\n### **IF YOU ARE STILL READING THIS** === (or if you skipped to the end, that hurts me :( ) <br>\n\n\n\nI’ll show more aspects of the game in future videos and maybe in weekly posts. Feel free to ask me any kind of question, even on my private life (wtf are u some sort of stalker?) and put a like on my Facebook page [ [https://www.facebook.com/MyNightmareOfStars/timeline](</linkout?remoteUrl=https%253a%252f%252fwww.facebook.com%252fMyNightmareOfStars%252ftimeline>) \\] \\(project page), I accept any kind of suggestion, critic and everything else.\n\n",
    "author": "_ForgeUser13049054",
    "lastUpdated": "2015-02-06T12:08:16.000Z",
    "screenshots": [
        {}
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}