{
    "id": "new-gettysburg",
    "name": "New Gettysburg",
    "shortName": "New Gettysburg",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/79/921/62/62/636178316699607998.jpg",
    "description": "Hi guys. Remember that \"kerrigan's fall\" map that I did way back when? I'm sure everyone here agrees that it sucked donkeyballs. Here is my latest map, which is a real remake of the New Gettysburg SC1 mission. Now before I explain the main differences between this map and the original, first a disclaimer: I've had a lot of accusations from various people who say I steal other people's maps. While I do not in any way consider my method of making maps stealing, I've decided that I should at least say who made the template for my missions, since after all, they wouldn't be half as good as they are without my method. This particular remake is based on triger/vortexx's \"Rooftops of Korhal\" map. An excellent work, and the urban environment suits the remake perfectly since Tarsonis is a city world like Coriscant in Star Wars. (And while I'm on that subject, did you know Blizzard was actually considering working with Lucasarts to make a Star Wars RTS game instead? StarWarscraft? Lol 500x.) So giving credit where credit is due, on to the map itself:\n\nOne thing that's different from the original is there are no \"bridges\" between rooftops, so total air war is a must. You start with six medivacs to ferry any ground troops you might have. The main emphasis, however, should be air units. Vikings, Banshees, and battlecruisers (duh) should be your top priority. You start with all the required buildings and missile turrets ringed around your base. Your objective is to beat the Protoss, but the Zerg are there too, and you're not allowed to attack them. The Protoss and Zerg may attack each other. Anyway, as in that flop, Mengsk's lines are replaced by funny Raven quotes due to the files missing, as I explained then. All the other trasmissions are intact. All units will be paused when the end transmissions play, and the music will be muted for all of them just in case it's too loud. Oh, and there are Dragoons (renamed Immortals that can shoot air units) in this too! So tell me what you think, and enjoy!\n\n![http://static.curseforge.net/thumbman/images/21/889/600x344/Untitled.jpg.-m1.png](<http://static.curseforge.net/thumbman/images/21/889/600x344/Untitled.jpg.-m1.png>)\n\n",
    "author": "_ForgeUser4468584",
    "lastUpdated": "2010-06-10T22:20:00.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/153/969/Untitled.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}