{
    "id": "oblivion-descends",
    "name": "Oblivion Descends",
    "shortName": "Oblivion Descends",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/81/791/62/62/636178335049340586.jpg",
    "description": "## background story\n\nSomewhere in the void the Xel'naga are hatching a diabolical plan....\n\nIgnorant to the impending oblivion the Protoss and Zerg fight, because they can. (did'nt see that coming?) The golden armada descends upon Auir. Poised to reclaim his home world; Artanis, heir-arch of the remaining Protoss forces, leads the assault against the Zerg Swarm.\n\nDistracted by the approaching threat, the young Overmind retaliates by bringing the majority of the Zerg presence on Auir to meet Artanis, as his legions of faithful followers warp into battle.\n\nHowever, this story is not about the battle of Auir. Rather, it is a story about a mysterious contractor who calls himself....Duran\n\n## where the player comes in\n\nDuran has contracted the services of a mercenary who's skill is unmatched in delicate missions such as this one..... Sergeant.Smash (or SARGE! for short) undertakes the daring task to steal from the High Temple of Auir; ..... to Steal the Khaydarin crystal (bonus: everything else)\n\n## game type\n\nSpecial forces type game, hopefully with a very detailed story line. Things i want to include...\n\n- There will be a system similar to rank points \n- There will be heroes, but they will all be unlockables and will be expensive, take up loads of supply and will be trained only once! \n- Game is set during the invasion of Auir from legacy of the void, will likely publish after LOTV is out. (so some of the units can be used) \n- Most of the units are very generic with a few new abilities i.e. marine with new stimpack ability. i want the game to be more about numbers of units rather than making uber-units....however uber units arent 100% out of the question. \n- each scenario will have a tactical solution \n- game will have custom soundtracks \n- Funny side to the story line. \n\n<!-- -->\n\n## How can you help\n\nyou cant\n\njust kidding!\n\n- i need songs that will go well in game (ambient songs/songs that go well will action packed parts in the story) \n- Donations would help out loads! \n- possibly need voice actors at some stage!\n\n<!-- -->\n\n",
    "author": "_ForgeUser20513619",
    "lastUpdated": "2015-06-09T15:31:55.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/160/117/Oblivion_Decends.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}