{
    "id": "officer-training",
    "name": "Officer Training",
    "shortName": "Officer Training",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/200/564/62/62/636914173667993813.png",
    "description": "Hello everyone! This is my first real project for the SC2 community. I wanted to contribute in a small way to the massive Mass Recall project and figured I would start with something small and relatively simple. Thus I decided I would remake the old N64 version of the training mission for the player at the start of the Terran Campaign, 'Rebel Yell' as it was very different from the original SC1 PC version and has the interesting dynamic of fighting the Sons of Korhal on Mar Sara before you fight the Zerg and later have to ally with the terrorists/freedom fighters.\n\n\n\nI used some video footage of the N64 version being played and a PC remake by an author named JCarill0 as a basis for this, but tried to add the flavour and feel of Mass Recall to it. The terraining is done, the objective triggers are done, the opening and closing in-game cinematics are done and the mission runs smoothly. What remains is doing the AI, adding the opening briefing and polishing the mission. But with the mission nearly completed, I thought I would open up the project to criticism and community testing/feedback to see if anyone has any suggestions, can find major flaws or bugs, etc...\n\n\n\nIt is my hope that when I have this mission nicely polished I can give it to the Mass Recall team as an optional addition to 'Rebel Yell' and maybe start making some of the other minor unvoiced missions. Thanks to everyone who tries it out!\n\n\n\nP.S.: I should point out that this mission is actually a combined version of N64's 'Boot Camp' and 'Officer Training' since they used a nearly identical map, had a consistent narrative between them and differ significantly from the PC version. Lastly, this map of course requires Mass Recall 7.0 to work properly and all credit for those assets and tools goes to the Mass Recall team, I just made the map.\n\n\n\nLore aside: The Sons of Korhal were indeed extremely active in the Sara system and on Mar Sara specifically. In addition to the canonical missions from the Precursor that show the SoK on Char Sara and the OG Starcraft mission 'Desperate Alliance', the SoK also had Sarah Kerrigan on the planet (novel: Liberty's Crusade) and a team there to capture and experiment with Psi Emitters (Novel: Speed of Darkness)\n\n",
    "author": "minorcharactersc",
    "lastUpdated": "2019-04-21T04:33:42.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/250/928/officer-training-editor.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/250/929/officer-training-intro.png"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}