{
    "id": "one-soul",
    "name": "One Soul",
    "shortName": "One Soul",
    "installed": false,
    "summmary": "",
    "description": "One Soul - RPG\n\n###### Target Alpha Alpha (1 boss all abilities) = Nextweek Wensday\n\n#### Looking for Alpha Alpha Testers PST around 4-11pm Please PM\n\nOne Soul is an RPG set (kinda) in the SC2 Universe. When a player dies in One Soul it makes the other players more powerful. The dead player re-spawns as a very basic unit with no special abilities. The other players must VOTE to allow that player gain their soul back 49% Majority to pass. (There may be another way to get your soul back, but with some consequences - Hint Hint)\n\nOne Soul will actually challenge Players with Ethical dilemmas that their choices as player will affect boss battles, and the outcome of the game. Target Play length is 1 hour.\n\nThis MUST be played with 4 players, if 1 player leaves, the game will continue, if 2 players leave (I haven't Decided yet) , if 3 player leave you are forced to quit. You take on 1 of 4 character classes. Your class is chosen in the beginning by drawing straws to see who picks first. all 4 classes must be played. These classes are leveled, there are NO items\n\n## Ki Warrior (Tank):\n\n- Only unit with a shield \n- Only melee unit \n- Abilities \n\n<!-- -->\n\n1. Overcharge = Recharge Shield while doing damage in a small AOE \n2. Ki Step = Blink to target location & receive a boost to attack speed and run speed \n3. Retribution = For the next X amount of time, you will build up retribution charges. Hit this button again, and do AOE damage x the amount of damage \n4. Tunnel Vision = Cloak all of your Allies forcing everything to attack you \n\n<!-- -->\n\n## Psi Master (Nuker)\n\n- Specializes in AOE Damage \n- Uses a lot of energy \n- Abilities \n\n<!-- -->\n\n1. Psi Master Storm = its a Psi Storm \n2. BFG = Shoots a slow moving energy ball at target location, during travel energy ball shoots beams at near by units, on impact does massive small aoe damage \n3. Repercussion = Whenever a Unit takes damage around Target Unit, Target units ALSO takes that much damage from caster of this spell \n4. Move It = Blink out, and delayed small AOE dealing damage and slowing down units in original spot \n\n<!-- -->\n\n## Nano Warrior (Healer & Support)\n\n- Can Heal, and provides buff \n- Is meant to heal and do damage \n- Abilities \n\n<!-- -->\n\n1. Spot Heal = Heals target unit for X points (basic heal) \n2. Nano Grenade = Infects units in medium aoe with healing nanites which drain help from unit. Health drained from unit, heals other uniits \n3. Nanite Surge = Pushes all units away from casting wile converting damage caused by ability into energy \n4. Group Buff = Buffs stuff - Ability not hammered down yet \n\n<!-- -->\n\n## Phantom (Striker)\n\n- Lots of damage, to 1 unit \n- large range, and fast speed \n- Abilities \n\n<!-- -->\n\n1. Penitentiary Round = Does X amount of damage, every 4th shot of this ability on a unit does 4x damage \n2. Obliterate = Massive damage, slow cast time, alot like the one in the game \n3. Ultra Sonic Pulse = Same as before, small aoe stun \n4. Dominate = Gain Control over target non massive non heroic unit. Using this on a Heroic unit cause they to be disoriented for a few seconds \n\n<!-- -->\n\n### Map composition is 3 mini boss battles, and a major boss battle.\n\nThere is more to this as well, but part of the game is the secrets involved with the one soul. Looking to do closed Beta Testing next week (So I'm looking for some people PM me)\n\n",
    "author": "_ForgeUser1470447",
    "lastUpdated": "2011-02-04T16:17:55.000Z",
    "screenshots": [
        {}
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}