{
    "id": "orpg-star-world",
    "name": "ORPG - Star World",
    "shortName": "ORPG - Star World",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/81/281/62/62/636178329973443851.jpg",
    "description": "ORPG is a huge concept that allows players to play with multiple maps to increase the power of their hero.\n\nThis ORPG game tries to include all World of Warcraft user-friendly concepts... And the same systems.\n\n## Blizzard Games Systems included\n\n### Loot System\n\nWorld of Warcraft Loot System.\n\n\n\n### Quest System\n\nWorld of Warcraft Quest System (using QL 1.2r).\n\n\n\n### Trade System\n\nWorld of Warcraft Trade System.\n\n\n\n### Crafting\n\nOriginal based system. A mixe between World of Warcraft and Lineage 2.\n\nYou can have a job. A job allows you to gather some gatherables (Animus ; Minerals ; Terrazine). If you want to create a special item, get the parchment for your object and gather all needed elements. Click upon the parchment item to create the item you would like.\n\n### Party & Moderation\n\nAccept an invite from a group to join this group. In a group, you are friendly with others players in this group. You can activate a \"PvP Tag\" to become hostile against all others players. If you are attacked, the source player activate this \"PvP Tag\" and become hostile against all others players - and you can kill him.\n\nIn a Dungeon Maps, you can ban a player from your party. If you ban a player in a Dungeon Map, the player is banned from the entire map and exist the map.\n\nIn normal maps, you can cancel the invite of a party member to disjoin this member from your party.\n\n## Gameplay & Classes\n\n### Classes\n\n3 classes for 6 subclasses. Your hero can reach the 30th level. The subclass division is at levell 20.\n\n### Gameplay\n\n15 codex by class/subclass. Each codex learn you a skill. Your hero can only have 5 different skills. You can choise the shortcut for all of these skills. Codex have updated versions.\n\n### Maps\n\nAll maps are divided into 3 parts:\n\n- Dungeon Maps. All players are in the same party. \n- Arena Maps. All players not in group are hostile against all others players. \n- Normal Maps. All players not in group are neutral against all others players. Accept an invite from a group to join this group. In a group, you are friendly with others players in this group. You can activate a \"PvP Tag\" to become hostile against all others players. If you are attacked, the source player activate this \"PvP Tag\" and become hostile against all others players - and you can kill him. \n\n<!-- -->\n\n## Project paused\n\nDue to a lot of work at school. I would like to revamp this for March/April 2012.\n\n",
    "author": "_ForgeUser2318176",
    "lastUpdated": "2010-10-04T22:32:58.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/158/377/ui-8.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/158/378/ui-7.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/158/379/ui-5.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/158/380/ui-9.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}