{
    "id": "path-damned",
    "name": "Path of the Damned",
    "shortName": "Path of the Damned",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/81/961/62/62/636178340189665606.jpg",
    "description": "Introduction:\n\nThis is my first serious map project for StarCraft II. I've always enjoyed the campaign aspect of StarCraft and have played through all of Blizzards campaigns several times, along with a multitude of different campaigns made by the public.\n\n\"Path of the Damned\" is a remake of Blizzards Warcraft 3 undead campaign, converted into Starcraft world using basic units, tho with a twist!\n\nIt includes 7 missions which mean that I decided to skip the first \"no base\" map and instead made a little mix of chapter 1 & 2 as one map.\n\nAll maps are nearly fully voiced with a few logical exeptions. So make sure u have show subtitles on in ingame options.\n\nStory:\n\nThe Lich King's plague has spread through the Capital City and into the outskirts of Lordaeron. Shocked and disheartened by the loss of their beloved king, the forces of Lordaeron were scattered by the ravenous Zerg. Now, Lordaeron is but a shadow of its former glory - and Prince Arthas has yet to be seen...\n\nScreenshots:\n\n\n\nHow to play:\n\nRequires atleast Heart of the Swarm expansion to play.\n\nThis campaign comes with a mod that has to be put into your basic mod catalogue.\n\nUnfortunaly Blizzard doesnt support campaign play, so the only way to play these maps is by opening up the first map in starcraft editor and press \"Test map\"\n\nCredits:\n\nSpecial thanks goes ofcourse to Blizzard for making the orignal tremendous story campaign.\n\nSpecial thanks to the creators of WoWModelviewer for the skins.\n\nKnown bugs:\n\n6th map has some unknown water height issues causing some minor silly problem.\n\n7th map the creep from buildings is visually hidden for some unknown reason, u can however see the creep on the minimap so its still playable...\n\n",
    "author": "_ForgeUser7599581",
    "lastUpdated": "2016-03-16T09:29:05.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/160/869/Screenshot2015-11-29_22_28_22.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/160/870/Terrain_001__1_.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/160/871/Undead.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}