{
    "id": "planetary-boss-hunt",
    "name": "The Planetary Boss Hunt",
    "shortName": "The Planetary Boss Hunt",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/81/805/62/62/636178335296006859.jpg",
    "description": "![](<http://static.sc2mapster.com/content/images/21/259/SC2_2010-05-25_04-56-17-24.jpg>)\n\nAfter destroying Czeth, Adrune fled the Planetary Fortress and found solitude at the great terran city of Rosea. You followed in his footsteps through the portal and after fighting through the trecherous forests of the area you arrive at the outskirts of the city....\n\nSupports WASD movement and move click attack and mouse look\n\nLeft Click is attack, right click summons 6 broodlings to assist you and 1 key summons a healer support unit\n\nLink to first map in the series\n\n[http://www.sc2mapster.com/maps/boss-fortress/](<http://www.sc2mapster.com/maps/boss-fortress/>)\n\nNew Alpha footage of \"Azura the Blinker\"!!\n\n<iframe allowfullscreen=\"allowfullscreen\" src=\"https://www.youtube.com/embed/K33rXnP7Ov4?wmode=transparent\" height=\"358\" width=\"638\"></iframe>\n\n→\n\nNew Footage! Boss, **Warship Rosea**\n\n<iframe allowfullscreen=\"allowfullscreen\" src=\"https://www.youtube.com/embed/Ov4Ib0d5NlE?wmode=transparent\" height=\"358\" width=\"638\"></iframe>\n\n→\n\nThe City Break in and Boss, RoboTank\n\n<iframe allowfullscreen=\"allowfullscreen\" src=\"https://www.youtube.com/embed/N2vVkBxETZY?wmode=transparent\" height=\"358\" width=\"638\"></iframe>\n\n→\n\nBoss, Terran Warp Chopper\n\n<iframe allowfullscreen=\"allowfullscreen\" src=\"https://www.youtube.com/embed/6lXtILfk0fY?wmode=transparent\" height=\"358\" width=\"638\"></iframe>\n\n→\n\nBoss, Czex the Vaporizer\n\n<iframe allowfullscreen=\"allowfullscreen\" src=\"https://www.youtube.com/embed/4Ht94ZlRSjE?wmode=transparent\" height=\"358\" width=\"638\"></iframe>\n\n→\n\nMount, Zergobo\n\n<iframe allowfullscreen=\"allowfullscreen\" src=\"https://www.youtube.com/embed/3LJaFAyfVdM?wmode=transparent\" height=\"358\" width=\"638\"></iframe>\n\n→\n\nThe Final Two Bosses, Tyran the Empowered and Thule, Son of Adrune\n\n<iframe allowfullscreen=\"allowfullscreen\" src=\"https://www.youtube.com/embed/7vSqSTmGOOs?wmode=transparent\" height=\"358\" width=\"638\"></iframe>\n\n→\n\nAlpha v.10 Here it is guys! Well kinda LOL. This version includes the first 2 bosses of the map, i have marked the location of one with 2 rocks. It is straight ahead right into the city you cant miss it, you will be asked if you want to climb some stairs, just press 4 and you will be taken to him :).\n\nAlpha v.1.1\n\n- Added new boss and helper arrows that will help you locate the 2 bosses after Robotank \n- Fixed some gaps that allowed you to exit map (hopefully lol) \n\n<!-- -->\n\nAlpha v.1.2\n\n•New boss \"Warship Rosea\" added. For my friends not able to read text due to my map not currently being localized i will explain the controls. Basically You can fire Photons at the ship on the upper level by pressing 2 and the goal of the fight is to defend the Warp Gate, it is the entrance to the location of Adrune! (To be added later :))\n\nBETA v.1.3\n\n•Now in beta phase guys! No more bosses will be added until the current ones are polished/balanced\n\n•Added new boss, \\*Czex the Vaporizer\\* He is the brother to Czeth the final boss of the planetary boss fortress who you destroyed. He can be accessed right after you kill Robotank, head right and go straight until u cannot go straight anymoe and can only turn right, keep going down that long pathway and you will notice destroyed city buildings and sand, you will run into him <span>:)</span>\n\nBeta v.1.4\n\n- Added camera reset fuction, simply press the space bar to reset should you mess up the camera via mouse wheel. \n- Lowered Azura The Blinker hit points to 5200 \n- Increased Missle Turrent HP to 9500 \n\n<!-- -->\n\nBeta v.1.5\n\n- Added lots of new polish to the overall city envirement. \n- Changed a few stats of various boss fight situations \n- Now Localized! \n\n<!-- -->\n\nBeta v.1.6\n\n- Removed alot of trash mobs to make it easier for you all to make it to bosses, this is a TEMPORARY fix until i get the best possible respawn/save/load system worked out, i think you all deserve nothing but the best and you shall receive <span>:)</span>\n\n For now use this opportunity to test bosses and practice. \n- Changed starting point to just outside city, again this is temporary so dont get to used to it, all of these freebie fixes will be removed next update (prolly 2night) \n- Lowered RoboTanks hit points to 300 \n- Lowered RoboTanks speed to 3.5, down from 4.0 \n- When engaging Czex forcefields will now appear behind you and block your way out, so make sure you really want to engage him from now on <span>:)</span>\n\n- Fixed a bug that caused the earth to not stop shaking even after defeating Czex \n- Fixed a bug that caused units to \"pause\" and not attack at all after defeating Czex \n- Fixed a bug that did not fully disable the dialogue choice to climb the stairs to Azura. \n- Added dialogue when defeating Czex, most likely only Alleriya will be the only person to ever see this ROFL. \n\n<!-- -->\n\nEnjoy this while you can i'm only doing this because the next update will be the final boss dungeon and most of you cant even get beyond the first boss. Next update will introduce whatever revive/life system i find works best and will also LOCK Warship Rosea, by lock i mean you will no longer be able to visit her anytime you wanted to like before, Warship Rosea will be locked until having defeated all other bosses.\n\nBeta v.1.7\n\n- Zergobo the winged zergling has arrived.. somewhere ;). If you engage him be sure to keep him alive for 1 minute and he might let you mount him <span>:)</span>\n\n- Fixed a bug that caused defeat even after killing Warp Chopper \n\n<!-- -->\n\nBeta v.1.7B Hot fix\n\n- Fixed the game not ending should you die while riding Zergobo \n\n<!-- -->\n\nBeta v2.0\n\n- Added the two final bosses of the map! They can be accessed by defeating Warship Rosea, but only for now as they need testing but for release you will be required to kill all non optional bosses to access them. Known Issues! \n- There is NO story with this release but i do plan on adding a cutscene during the transition between Rosea and the final boss area. \n- You can walk through certain points of the walls in the final boss area, so please just dont lol it will be fixed next update. \n\n<!-- -->\n\nBeta v2.1\n\n- Fixed an issue that caused Zergobo to be spawned on top of you after killing certain bosses even if you did not catpure him. I dont know why this was not reported sooner.... \n\n<!-- -->\n\nRelease v2.2\n\n- Here it is folks, the first official release version of the Planetary Boss Hunt! \n- Fixed a bug with the supply depots at the start of the city \n- Fixed a bug that caused the Stalkers to shoot you from under ground should you defeat C'zex to soon \n- Added a whole bunch of story dialogue including the end game dialogue \n- This is not the end folks, there is still much more room in the city and i figured i would fill the rest of the city with the top user suggestions! Now i do have plans for one mini boss in the city but there is still much more room left! So please, submit a comment and tell me what you want to see and i will make it happen should it be a popular request <span>:)</span>\n\n THIS MAY BE A RELEASE BUT THE SUPPORT FOR THIS MAP WILL NEVER DIE! \n\n<!-- -->\n\nRelease v2.3\n\n- Fixed an issue with Zergobos attack distance being exploited \n- Fixed an issue that would leave you stranded at Azuras rooftop \n- Added PHASE ONE of respawn system, you now have up to 4 stored recharge abilities that will activate automaticaly upon your life reaching extremelely low percentage, this number is reduced to 3 should you pick up Zergobo. Phase two will make it so the game does not end should you lose certain boss fights, but for now suck it up and be happy with this <span>;)</span>\n\n     <span>&lt;3</span>\n\n\n<!-- -->\n\nRelease v2.4\n\n- Fixed an issue with respawn system not working should you take alittle to much damage <span>:)</span>\n\n\n<!-- -->\n\nRelease v2.4b\n\n- Upped the percentage of health needed to activate the recharge ability. \n\n<!-- -->\n\nRelease v2.5\n\n- Azura and Warp Chopper will no longer end the game in defeat should you fail the encounter. If you defeat them you will gain new abilities! Terran Warp Chopper = Warp Enemy, press E to warp a nearby enemy unit towards you Azura the Blinker = Shock Leech, press Q to shock nearby enemies and heal yourself! \n- These abilities DO NOT WORK FOR ZERGOBO ATM \n- Increased photon damage by double VS Warship Rosea \n- Warship Rosea and all bosses beyond her are still game enders should you fail \n\n<!-- -->\n\nRelease v2.6\n\n- Fixed a sh\\*t load of issues with 2.5, lol \n- Increased Missile Turrets HP \n\n<!-- -->\n\nRelease v2.7\n\n- Game should no longer end in defeat should Gateway be destroyed after defeating Warship \n\n<!-- -->\n\nLeave feedback, reports bugs and share your thoughts of what you would like to see.\n\nIncase you have not heard, i announced the final part of the series. It will include 12 player online co op with 10 differant character classes and a in depth leveling system. There is a forum thread on it but incase you have no seen it here is the trailer <span>;)</span>\n\n Enjoy\n\nPlanetary Bosses Online : Gateways Trailer\n\n<iframe allowfullscreen=\"allowfullscreen\" src=\"https://www.youtube.com/embed/VLVMyaNEu5g?wmode=transparent\" height=\"358\" width=\"638\"></iframe>\n\n→\n\n",
    "author": "_ForgeUser2347094",
    "lastUpdated": "2010-06-14T18:00:37.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/160/172/SC2_2010-05-25_04-56-17-24.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}