{
    "id": "protoss-campaign",
    "name": "The Protoss Campaign",
    "shortName": "The Protoss Campaign",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/79/873/62/62/636178316413233678.jpg",
    "description": "#### Hello World! Welcome to The Protoss Campaign\n\n<iframe allowfullscreen=\"allowfullscreen\" src=\"https://www.youtube.com/embed/zDvDTzK5Bnw?wmode=transparent\" height=\"358\" width=\"638\"></iframe>\n\n##### Notice:\n\n- “Esc” to skip cutscenes. \n- Missions are very micro heavy, so use gamespeed to adjust difficulty \n\n<!-- -->\n\n##### The Info:\n\nI have finally found my way back into map making after being away for a good year. I’m looking forward to HoTS and I’m mainly practicing some map making to get up to speed. I can’t be bothered to put anything serious up before HoTS hits, and thus I created this campaign that I intend to continue until it has a dozen missions. There is no grand plot, no grand level design. Just ideas thrown in to see how they worked when played through. I made sure to add some difficulty and voiceworks so you could enjoy the ideas with me aswell. While I originally intended the campaign to be a bit more serious, I could not think of any plot, and before the third mission was finished I figured that I might as well make it a good challenge for the player while hopefully producing a few laughs. I haven’t incorporated much humor into the first couple of missions since the idea didn’t occur to me before it was too late to do anything major about it. But look forward to some challenging level design with lots of sexual undertones, farts, plot-holes, blizzard jokes and game references. Overall I hope to create something which you can find funny and challenging at the same time. But I’ll leave you to it, if you got any feedback, or more importantly, any ideas for something really far out, you always wanted to see in a Starcraft map, throw me a comment or a PM.\n\n",
    "author": "_ForgeUser1518602",
    "lastUpdated": "2012-12-07T00:01:01.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/153/847/ewqewqewq.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}