{
    "id": "purity-form",
    "name": "Purity of Form",
    "shortName": "Purity of Form",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/80/432/62/62/636178321207541819.jpg",
    "description": "A UED commando stranded in Dominion space after the Brood War, RYAN KLIGSEN has survived by hiding his true nature. A cybernetically-modified super-soldier with the ability to regenerate wounds, he must masquerade as a simple veteran to avoid arousing suspicion.\n\nStranded on Mar Sara after a tour with the mercenary War Pig company, Kligsen is finding it increasingly hard to maintain his cover. The local marshal has taken a dislike to him, and seems to enjoy provoking the battle-weary stranger.\n\nMeanwhile, unbeknownst to Kligsen, a wealthy eccentric named JUSTIN ESCALIO has landed on Mar Sara in search of a mercenary commander with very particular qualifications...\n\n*PURITY OF FORM is a five-mission, fully-voiced, story-driven campaign for StarCraft II. *\n\n*PART ONE consists of Missions 1 and 2 together with three cinematic cutscenes. *\n\n**CHARACTERS**\n\n\n\nRYAN KLIGSEN\n\nAs a cybernetically-enhanced commando, Ryan Kligsen was a pariah on his home planet of Earth. Even so, he remains haunted by memories of the beautiful terran homeworld. Left marooned by the destruction of the UED expedition to Koprulu, he has lived in hiding ever since. A tour with the mercenary War Pigs left him severely addicted to stimpacks. He reluctantly accepts a new assignment with Escalio's Purists after the actions of a corrupt colonial marshal shatter his life of anonymity on Mar Sara.\n\nNanobots in Kligsen's bloodstream grant him the power to regenerate wounds.\n\n\n\nJUSTIN ESCALIO\n\nA well-spoken intellectual and a powerful telepath, Escalio is also a wanted man. He is the founder of a secret society named the Pure Form of Man, known to the Dominion public as a \"protoss-worshiping cult.\" Escalio's actual goals are more complex (and perhaps more dangerous) than Dominion propaganda would have you believe.\n\n\n\nZOLTHANON\n\nEven for a High Templar, Zolthanon is inscrutable. Why would a respected warrior and former Judicator leave the Hierarchy to join the terran Purists, whose beliefs are heresy to the protoss? He claims he left out of anger at the Dark Templar who dissolved his former caste, but Kligsen suspects there's much more to the story.\n\n\n\nBUCKY\n\n\"Bucky\" is the Purists' preferred nickname for Zolthanon's robot probe. But Bucky is much more than a simple worker. Zolthanon has fitted him with upgraded sensors and components. These tools, along with the small machine's plucky attitude, will be crucial to Kligsen's survival.\n\n**HOW TO PLAY**\n\nUse the \"Files\" tab at the top of the project page to find the maps (there are more than the five shown under \"Recent Files\"). Save all maps to the folder C:\\Program Files\\StarCraft II\\Maps\\ leaving their file names unchanged. (You must use this specific folder or the next map won't load.)\n\nOpen the Maps folder and drag the file PURITY 01 Begin.SC2Map onto your SC2 launch icon.\n\n",
    "author": "_ForgeUser4862388",
    "lastUpdated": "2011-01-29T19:24:18.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/155/661/PURITYlogo.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/155/663/Screenshot2010-09-08_18_26_39.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/155/665/Screenshot2010-09-08_17_43_37.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/155/666/Bucky.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/155/668/Kligsen.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/155/669/Escalio.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/155/672/Zolthanon.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/155/674/Mission5draft.JPG"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}