{
    "id": "rivengard-offline-play",
    "name": "Rivengard-offline-play",
    "shortName": "Rivengard-offline-play",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/81/94/62/62/636178328297678080.jpg",
    "description": "![null](<http://photos-e.ak.fbcdn.net/hphotos-ak-snc4/hs710.snc4/63059_161258963885321_100000036545321_538904_7272446_a.jpg>)\n\n![null](<http://photos-a.ak.fbcdn.net/hphotos-ak-snc4/hs655.snc4/61573_161258877218663_100000036545321_538897_1531473_a.jpg>)\n\n**GAMETYPE**\n\nMelee: single player offline (matches up on 2 on 2 battle with AI) Rivengard is a highly detailed, realistically rendered map set in the jwoodland planet of Haven. This is designed for fast and medium scale skirmishes ideal for rush and counter rush defense play.\n\n**FEATURE** This map is set for offline play, just for people who needs to play skirmishes offline, to play simply ,double click on the file to open map editor and click on map test/run. please note that the game is set only for single player mode that pitches you on a 2 on 2 random race battle with and against AI (hard/very hard difficulty). tweak on the editor to set race or just restart the game to play another race\n\n**BACKSTORY** Located in the secluded regions of planet haven.. Rivengard remains untouched from the influences of technology and civilization. For eons this tranquil domain lays ever dormant under by the watchful eyes of the Protoss that held the planet’s abundant reserves true to their nature.\n\n![null](<http://photos-a.ak.fbcdn.net/hphotos-ak-snc4/hs690.snc4/63059_161258970551987_100000036545321_538906_4753244_a.jpg>)\n\nAccidentally discovered while trying to locate a distress call from Science Vessel Erasmus, Dominion retrieval teams had ignored to take heed of the Protoss’ warnings and secured a foothold of the area hoping to retrieve the cruiser’s undisclosed cargo. Unfortunately, enticed by the region’s vast Vespene and Mineral Deposits, the Dominion shifted its interests in taking over the whole region instead, claiming its untapped resources for its own agenda thus provoking the Protoss to wage battle against the newcomers on its own sanctuary reserved.\n\n![null](<http://photos-g.ak.fbcdn.net/hphotos-ak-ash2/hs350.ash2/63059_161258973885320_100000036545321_538907_3289463_a.jpg>)\n\nWhile its crash site was still nowhere to be found, the science vessel lays still amidst the deep jungles of Rivengard. Its cargo has been unsealed, exposed and hatched, what’s once used to be test subjects now thrived within, now that they are free, the Zerg adapted to its new found home.\n\n![null](<http://photos-b.ak.fbcdn.net/hphotos-ak-ash2/hs350.ash2/63059_161258980551986_100000036545321_538909_7404283_a.jpg>)\n\nHave fun!!!, melee map for online play is also available\n\n",
    "author": "_ForgeUser5717747",
    "lastUpdated": "2010-09-22T13:02:10.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/157/701/map-50.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}