{
    "id": "sc1-jacobs-installation-remake",
    "name": "SC1 - Jacobs Installation - Remake",
    "shortName": "SC1 - Jacobs Installation - Remake",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/79/926/62/62/636178316721996850.jpg",
    "description": "## Jacobs Installation\n\nA remake of the 4th mission from the StarCraft 1 Terran campaign. Check my profile for another remade map.\n\n### How to play it\n\nDownload the file anywhere and then drag it onto your SC2 shortcut. If you insist on doing it the hard way (opening in editor and testing) then make sure you're testing in normal difficulty.\n\n### Recap\n\nThe planet is being invaded by Zerg and Mengsk sends you into some secret Confederate base to take advantage of the chaos and steal some stuff from their computers.\n\n### Features:\n\n- more primary and bonus objectives \n- it's not on battle.net because it's too big, and because it's a singleplayer map, and because the custom map system apparently sucks \n- no more endless, empty corridors and rooms - the map is smaller but there is very little \"dead space\" \n- the flow of the original map is retained, so you still visit camera rooms, zerg cells, a garage etc. \n- teleportation pads reworked to hopefully make them not so annoying (in exchange, the effect may cause epilepsy) \n- sounds and music from the original mission \n- dancing night elf \n\n<!-- -->\n\n### Notes from the author\n\n- only *normal* difficulty is implemented \n- the 3D portraits in the briefing might look different, it's unavoidable (confirmed by blizzard :P) \n- please report any bugs you find \n- the crappy lip sync in NOT a bug, I have to use existing lip animations and it's hard to find ones that fit (especially for Mengsk) \n- I'm not very good at writing dialogue :) \n- * the map was part of Starcraft Reborn, a mod to remake Starcraft 1, but I got frustrated by the slow pace, authors dropping out and leaving maps half finished and the general lack of interest (almost nobody signed up when we opened up recruitment)*\n\n<!-- -->\n\n",
    "author": "_ForgeUser4536602",
    "lastUpdated": "2011-01-27T21:02:18.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/153/973/Jacobs01.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/153/974/Jacobs02.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/153/975/Jacobs03.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/153/976/Jacobs04.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}