{
    "id": "sc2bis",
    "name": "SC2Bis",
    "shortName": "SC2Bis",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/84/954/62/62/636199037800137755.png",
    "description": "# <br>\n\n\n\n### Introduction\n\nThis is (currently) a singleplayer map I've been working (and still am) during the past 3-4 months. My mapping process was very chaotic, so I decided to put in halt my current project (Exodus campaign) until I figure out some sort of structure I could use every time I wanted to mod.\n\nAs an exercise, I've taken an existing Blizzard Campaign map, and molded it to my needs. This is what came out. I'm currently developing 3 more missions for the campaign. If I finish them succesfuly, I'll consider keep on with more content.\n\n<div><p>¨NBSP;<a href=\"/linkout?remoteUrl=http%253a%252f%252fwww.mediafire.com%252fdownload%252ftw6ff31dabmk4yv%252fSC2_bis.zip\">= Download link =</a></p></div>\n\n<div><p><strong>(Last update: 2016/12/14 - DEMO)</strong></p></div>\n\n<div><p>(uploaded to MediaFire because it gets rejected in here)</p></div>\n\n### Context\n\nI'm writting some context here, because you will be kind of lost since this isn't the first map of the (potential) campaign:\n\nThis is NOT LORE, is an alternate universe where the original SC2 didn't happen.\n\n8 years have transcurred since the Brood War. Terran civilization is back on its feet, but there have been reports in the last years about Zerg presence in the fringe worlds.\n\nIntelligence reveals that Kerrigan isn't in Char. She's travelling through other worlds in a frontier sector. The Dominion uses it, and starts a great campaign of retaliation. The plan is to build Psi disrupters in the planets that are on the road from the Terran colonized space to Char: Sorona, Timul IV and Maltair IV. After hammering the Zerg communications, the intention is to burn every single one of them.\n\nYou Were a Captain in the war against the UED. You've been recently promoted to Lieteunant by recomendation of Horace Warfield. He was your superior when you were serving the Confederates, and saw potential in you after the Dominion triumph. You're at the moment his favourite pupil, and he's preparing you to replace him in his shortcoming retirement.\n\n### Screenshots\n\n<div><div><p></p></div><div><p></p></div><div><p></p><div><p></p><div><p></p><div><p></p></div></div></div></div></div>\n\n### How to play\n\n#### Windows\n\n1. Unzip.\n2. Run \"SC2Bis - Installer\".\n3. Log in with your account in starcraft and stay in the main menu (It's not imperative).\n4. Run the shortcut created by the installer\n\n<!-- -->\n\nHere's an example of the installer working:\n\n<div><div></div></div>\n\n<div><p><a href=\"/linkout?remoteUrl=https%253a%252f%252fyoutu.be%252fNX3xk66P8Hc\">Youtube video</a></p></div>\n\n#### Other OS - Manual installation\n\n1. Unzip.\n2. Copy the content of the **Data** folder to the folder where SC2 is installed.\n3. Log in with your account in starcraft and stay in the main menu. (It's not imperative.)\n4. Open the map **\"<sc2 folder>\\Maps\\SC2Bis\\WoL\\010100Bottleneck.SC2Map\"** with sc2switcher (under \"support\" folder in the folder where SC2 is installed)\n\n<!-- -->\n\n**OR**\n\n1. Unzip.\n2. Copy the content of the **Data** folder to the folder where SC2 is installed.\n3. Log in with your account in starcraft and stay in the main menu. (It's not imperative.)\n4. Open the map **\"<sc2 folder>\\Maps\\SC2Bis\\WoL\\010100Bottleneck.SC2Map\"** with the editor and test document (ctrl+F9)\n\n<!-- -->\n\n### Caveats - Known bugs\n\nIn my to do list there are some minor things left to be done, like finishing the victory and defeat dialogs or revising the text and transmissions. What I mean with this is that the mission isn't complete, but it's already enjoyable. Besides, I'm kind of losing motivation at this moment, and I could and I could get a boost from critics/bug/typos/grammar feedback, or even a collaborator.\n\n### Credits\n\n- Psi emitter model by Thrikodias.\n- Psi disrupter model by Kailniris.\n- The rest of the assets are mine. Feel free to use them.\n\n<!-- -->\n\n",
    "author": "cacho_56",
    "lastUpdated": "2016-12-14T12:21:54.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/160/966/1.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/160/967/2.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/160/968/3.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/160/969/4.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/160/970/5.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/160/971/6.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/191/122/icon.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/191/124/banner2.png"
        },
        {
            "src": "https://media.forgecdn.net/attachments/191/125/banner2.png"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}