{
    "id": "sins-father-campaign",
    "name": "sins of the father campaign",
    "shortName": "sins of the father campaign",
    "installed": false,
    "summmary": "",
    "description": "== INTRODUCTION ==\n\nHello,\n\nMy name is John Webb. I've been playing strategy games since I was a child and have always been fascinated with map editors. My most successful career as a mapmaker were with the castle-sim games, Stronghold, and its sequel, Stronghold: Crusader. On Stronghold Heaven (community site for the Stronghold mapmaking community) I was consistently one of the highest rated creators, and still hold a few spots on the top 100 under the username Captain Diablo (a username that serves as an antique from my childhood spent playing--you guessed it--Diablo 2).\n\nAs a mapmaker, I developed a personal style of scripting that emphasized high difficulty and narrative. My Stronghold maps are some of the most challenging maps ever made--but not to the point of frustration. I designed each scenario based on the assumption that the player would learn as she went, finding the solution at every step until the map was beaten. Once figured out, my maps are quite easy; it's the learning curve of the scenario that I focused on, which in my experience with strategy games is the hallmark of single-player gameplay.\n\nI also happen to be a published writer (disclaimer: in non-pro markets), and was always rated highly for narrative as a mapmaker.\n\n=== STARCRAFT ===\n\nAnd now we arrive here, in the present, where I recently became semi-obsessed with the intricacies of the Starcraft II editor. Stronghold's editor is relatively inflexible; Starcraft II's Galaxy Editor is something I can really sink my teeth into.\n\nAnd here's what I spat out, my \"Naked Lunch\" so to speak. I had zero working knowledge of the editor when I began. By creating the first mission, I learned a lot, but it's far from perfect. I've made these files public domain because I think they can be improved upon by those willing and more able. For instance, by digging into the triggers, a more experienced mapmaker can probably condense multiple lines of scripting into one. There are also some things that I couldn't get to work (like making multiple probes build things, or having a warp prism drop multiple units), but for these issues I created a workaround, or abandoned entirely.\n\n==== SINS OF THE FATHER ====\n\n[This section is reserved for future updates of the campaign]\n\nThis campaign focuses on a small mining colony called Turahnas, where a marine sergeant (Rastlin Duvall) has returned home to attend the funeral of his late father. Rastlin takes over as the commanding officer (analogous to Raynor's sheriff status in the old Confederacy) and begins to oversee the colony. However, his late father's station in life isn't the only thing he's inherited...\n\nPrologue (In production): This will be a short cutscene of the funeral, and the subsequent taking-over of Rastlin; this cutscene will also introduce key characters in the narrative.\n\nMission 1 - Turahnas Stand\n\n\\-An unidentified contingent of Protoss forces has swept over the planet, boxing the Terrans into a corner. They seem hellbent on destroying the colony, but why?\n\nThis map is a timed defense mission, similar to a lot of Terran missions in Wings of Liberty. Initially, you're building bunkers and training marines. Completing bonus objectives will make the mission significantly easier; you'll gain access to Marauders in the tech tree and rescue a few tanks with siege mode. I dare say that these objectives aren't really a \"bonus,\" but a necessity to beating the map. You have very little time in between waves, so everything you do counts. Losing three marines in the beginning might doom you later, for instance. Design-wise, it's very similar to my Stronghold maps: attacks are timed and sometimes announced; you as a player must learn the best way to deal with it.\n\nMUSIC CREDIT: Final Assault Extended - Mass Effect 1 Soundtrack\n\n",
    "author": "_ForgeUser6904449",
    "lastUpdated": "2014-06-26T22:14:43.000Z",
    "screenshots": [
        {}
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}