{
    "id": "stacraft-galaxy-edition",
    "name": "Starcraft: Galaxy Edition",
    "shortName": "Starcraft: Galaxy Edition",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/80/360/62/62/636178320659056486.Jpg",
    "description": "***\\*****Note: This project has been scrapped due to the editor breaking things. I may use these resources in a future campaign or a remake of this remake. Lawl.****\\****\n\nStarcraft: Galaxy Edition is my first large scale project that I've taken on doing single-handedly. It's a conversion mod that will alter Starcraft II mechanics to match classic Starcraft. A full remake of all the campaign maps is also planned as well. The mod is comprised solely of Data Editor work and is to be compatible with any melee map, so long as you add the mod file to the Dependencies list.\n\n**Installation Instructions:**<br>\n\n- Place the SC2MOD file into your Mods folder. File path: ...\\StarCraft II Beta\\Mods<br>\n\n- Open any map. Under File > Dependencies... click \"Add Other\". Insert the mod into the map.<br>\n\n- Rename the mod file to \"Starcraft Conversion\" from \"Starcraft\\_Conversion\" without the underscore. The name got changed when I uploaded it.<br>\n\n- Play. Enjoy.<br>\n\n- **Note:** The campaign maps already have the mod dependency added. Just run it.<br>\n\n- **Caution:** The campaign maps must be played via drag-and-drop method for the AI to work. Drag the SC2MAP file onto your StarCraft II Beta executable or shortcut. \n\n<!-- -->\n\n**Current Build:**<br>\n\n- Resource Gathering: Workers gather 8 minerals/gas per trip. I have adjusted the gather time of minerals (from roughly 2.4 to 7 seconds) to compensate for this. Gas mechanics ... are troublesome. I've halved the movement speed while workers carry gas instead of reducing their overall movement speed. They were just too sluggish that way. Gas still doesn't allow harvesting when depleted.<br>\n\n- Tech Trees: Terran and Zerg tech trees have been completed... except for Nydus Canals. Original unit and structure costs, prerequisites, and build times have been implemented. Work has begun on the Protoss. Missing models have placeholders instead (i.e. Viking Assault Mode for Goliaths and Hellions for Vultures) but will be revamped with proper models when Blizzard launches Starcraft II: Wings of Liberty. Brood War units/upgrades will not be implemented at this time.<br>\n\n- Custom Upgrades: U-238 Shells and other upgrades are returning. Energy upgrades will increase maximum energy to 250 and starting energy to 62-62.5 on the corresponding unit, as in the original Starcraft.<br>\n\n- Campaign Episode I - Rebel Yell: Campaign scenarios up to Terran 10: \"The Hammer Falls\" are here! The scenarios feature the original dialogue and VO's. The campaign AI's are not intact as planned because I felt like they sucked. The campaign promises a more difficult experience than the original.<br>\n\n- Heroes: Hero units like Jim Raynor, Sarah Kerrigan, and General Edmund Duke have their original unit responses. \n\n<!-- -->\n\n**Upcoming Release/Under Development:**<br>\n\n- Original Abilities/Spells: The remake will boast the same abilities from the original Starcraft, including the classic EMP (removes all shields), Defensive Matrix, Irradiate, Spawn Broodlings, Plague, Queens infesting Command Centers, High Templars with Hallucinate (make two copies of host unit), and more.<br>\n\n- The Protoss Tech Tree<br>\n\n- Campaign Episode II - Overmind \n\n<!-- -->\n\n**Planned for Development:**<br>\n\n- Original Starcraft: Brood War micro mechanics (i.e. muta micro).<br>\n\n- Campaign Precursor<br>\n\n- Campaign Episode III - VI: The original Starcraft and Brood War saga ported to the Starcraft II engine.<br>\n\n- Campaign Enslavers I - II<br>\n\n- Difficulty Setting for Campaign: There will be much harder difficulties available when Starcraft II: Wings of Liberty is launched to suit higher skill levels and add an element of replay to the campaigns.<br>\n\n- Brood War: Units, spells, and upgrades from the Starcraft expansion pack.<br>\n\n- (Possibility) Achievements: I am not sure about this one. Can we make them?<br>\n\n- (Possibility) Campaigns Insurrection & Retribution<br>\n\n- (Possibility) Some remade SC melee maps for the mod to be played on online.<br>\n\n- (Possibility) Classic unit sounds and music. Known caveat: May make the download size unreasonably large.\n\n<!-- -->\n\n",
    "author": "_ForgeUser4476646",
    "lastUpdated": "2010-06-19T15:33:21.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/155/382/Screenshot004.Jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/155/383/Screenshot005.Jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}