{
    "id": "starcraft-2-odyssey-campaign",
    "name": "Starcraft 2: Odyssey Campaign",
    "shortName": "Starcraft 2: Odyssey Campaign",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/82/221/62/62/636179430502798540.jpeg",
    "description": "![](<http://i63.tinypic.com/334j880.jpg> =674x95)\n\n#### <span style=\"color:#f00\">Warning: Blizzard's patches are known to create bugs and/or glitches at times. Feel free to report issues you may encounter.</span>\n\n\n\n\n\n#### Introduction\n\nOdyssey is my first attempt at creating a Starcraft 2 project consisting of a multi-act campaign set in the Kardyan Quadrant... far away from the Koprulu Sector. Played from the Terran point of view of Captain Jared Harsh of the Marine Ground Forces: Hell's Rejects, Act I focuses on his struggles throughout the battle-scorned planet Duros III.\n\nFeaturing high-quality terraining with some decent writing accompanying, Odyssey hopes to push forward the storytelling capabilities of a custom campaign with its long-length cutscenes and additional lore to the Starcraft universe. As storytelling alone won't make a videogame, the gameplay, despite not being the true focus, can still present fresh mechanics and unique situations.\n\nEven though the events planned to unfold in the Kardyan Quadrant are very long and complex, Act I is set for only 14 missions. As for Act II and beyond, time will tell.\n\n\n\n#### How to Install and Play\n\n- Locate the Maps folder inside your Starcraft II installation directory and create within it a folder named Odyssey.\n- Place all the missions and launcher files inside it.\n- Initiate the Starcraft II editor and then load the launcher file.\n- On the editor go to File > Test Document.\n- Follow the launcher's instructions and enjoy.\n\n<!-- -->\n\n\n\n#### History of the Kardyan Quadrant\n\nDeparting from Earth, thousands of Terrans constituted the Second Exodus about ten years after the Exile of the “dissidents” who would come to crash-land on the Koprulu Sector. The members of the Second Exodus eventually arrived at the Kardyan Quadrant where they started expanding and thriving. Colonizing the Earth-like planet of Parsya and declaring it the Capital World, the quadrant became theirs. Over the decades, backwater planets and moons became increasingly aggravated with the burdening taxations employed by the Commerce Guilds of Parsya. Unable to sustain those taxations, the colonists abandoned the Parsyan Collective and settled on remote and poor systems where Parsya had no interests. There, they took the name, Exodian Clans.\n\nThe Parsyan government, shaken by the sudden loss of manpower on the outlying planets, deployed a massive funding into the Research Divisions. Such, allowed for the creation of a new artificial intelligence capable of self-learning, far more advanced than the average Adjutant. Built into manlike androids, later called Synthetics, the outlying planets were populated with them to serve as Parsya’s workforce. As their artificial minds were evolved upon with the passing generations, eventually, the Series 3 began showing signs of free-will, being capable of choosing to ignore orders given by humans. The Parsyan Collective, afraid of a possible synthetic rebellion, amassed all its military power under control of seven of the highest-ranking Admirals and Generals, unofficially named, the Steel Council. The amassed power of the Parsyan military became known as the Federation of Warfare, a force to be reckoned with. To their surprise, the Synthetics did not wish ill upon humanity and instead chose to leave Parsyan controlled space much like the Exodian Clans had done decades before. They were never heard from again. Fearing that they would one day change their minds or the possibility of an invasion by the Exodian Clans, Parsya kept expanding the Federation of Warfare and forbade the research into artificial intelligence, and even, the use of Adjutants.\n\nAs the decades went by, Parsya outgrew itself in power and economy but also in greed. The unforgivable event later named the Powering Strife led the Federation of Warfare into detaching itself from Parsya and declaring independence under command of Admiral Cassius Rourke who took the mantle of Grand Marshal. Head of the Steel Council and supreme commander of the Federation. The Parsyan Collective, aware of the threat the Federation posed, began sinking its economy into buying the loyalty of some of the Federation’s divisions and commanders and even hiring mercenary armies from the Exodian Clans. The two forces clashed and the Powering Wars lasted for five years, ending with the troubled invasion but inevitable fall of Parsya. At the Post-War Peace Treaty of 2490, it was determined that the surviving Parsyans would be restricted to their crumbled planet in agreement that the Federation could never again set foot there. As the Federation of Warfare became the unchallenged power in the Kardyan Quadrant, ten years of peace flourished.\n\nOn the 23rd of March 2500, the miners of the Planet Duros III began a rebellion against the Federation of Warfare for the deplorable conditions they were set to work on. Now, less than forty-eight hours later, the peacekeeping Battlecruisers Heimdall and Pegasus arrive at the planet with orders to restore control.\n\n\n\n- Mission 1 - Hell's Rejects\n- Mission 2 - Soldiers of the Federation\n- Mission 3 - The Beast of Statbrough\n- Mission 4 - Unwanted Guests\n- Mission 5 - Clipped Wings Part 1\n- Mission 6 - Clipped Wings Part 2\n- Mission 7 - The Siege of Arkingston\n- Mission 8 - The Federation Strikes Back\n- Mission 9 - Rising Dread\n- Mission 10 - Outrunning Death\n- Mission 11 - What Lies Beneath\n- Mission 12 - Falling From Grace\n- Mission 13 - The Bigger They Are...\n- Mission 14 - Limitless\n\n<!-- -->\n\n\n\nAll the missions' showcases can be seen on Youtube by JayborinoPlays: [Link here...](<https://www.youtube.com/watch?v=iOCGPpGRsrY&list=PLMmfhvBzj4FCvcQPMdXPak_LPKggPuT4v>)\n\nAnd also, DeltronLive: [Link here...](<https://www.youtube.com/watch?v=jrm8LTE8qHo&t=1299s&list=PLlC8YfRpYfL2J_HMeATbKggHcWICM916M&index=1>)\n\n\n\n#### Screenshots\n\n![](<http://i65.tinypic.com/2e3mvc9.jpg> =633x356)\n\n![](<http://i58.tinypic.com/vct7xd.jpg> =633x357)\n\n![](<http://i59.tinypic.com/2rhpumg.jpg> =633x357)\n\n![](<http://i58.tinypic.com/2urp6za.jpg> =633x356)\n\n![](<http://i61.tinypic.com/dlic7c.jpg> =633x356)\n\n![](<http://i57.tinypic.com/2j5f14i.jpg> =633x356)\n\n![](<http://i68.tinypic.com/10rlkw6.jpg> =633x356)\n\n![](<http://i64.tinypic.com/eapno2.jpg> =633x356)\n\n\n\n#### Special Thanks\n\nTo my friend Hélio for creating the Odyssey logo and tempering with the hero icons and to Marco and Vanda for putting up with me when I wouldn't shut up about the story. Also, thanks to JayborinoPlays and DeltronLive for showcasing Odyssey on their youtube channels and to everyone who enjoys this and thinks I'm bothering myself with something cool.\n\n",
    "author": "cooperhawkes",
    "lastUpdated": "2018-03-31T00:59:08.000Z",
    "screenshots": [
        {}
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}