{
    "id": "starcraft-2-ultimate-mod",
    "name": "SC2 - Ultimate (Mod)",
    "shortName": "SC2 - Ultimate (Mod)",
    "installed": false,
    "summmary": "",
    "description": "<ins>Search for \"Ultimate\" in mods on Battle.Net</ins>\n\n (Americas & South East Asia)\n\n[Notable features](<http://www.sc2mapster.com/maps/starcraft-2-ultimate-mod/pages/noteable-additions-so-far/>)\n\nYou may submit a Ticket if you wish to provide feedback or ideas! <span>:)</span>\n\nStarCraft 2 Ultimate is intended as an extension mod that can be applied to any melee map. It can also be used as a functioning dependency for other maps if you wish.\n\nMy goal is to include most campaign units, most StarCraft 1 & Brood War units, and many of the various upgrade and strain choices you see in WoL and HoTS. As well as those cool units you saw in the Left 2 Die map/mod.\n\nAs well as extra custom content for the Protoss. (which will likely be changed & updated to reflect Legacy of the Void when it is released)\n\nMy intent is not to overwhelm the player with a multitude of unit possibilities, but rather provide them a permanent CHOICE to choose ONE of 2 or 3 upgrades\\unit choices, that will affect the long term strategy of their game. They will have access to more units than normal though.\n\nJust like in the HoTS campaign, where you could choose ONE of 2 strain choices, you will have the same ability to choose them during your melee match. Do you want mass Swarmlings or more deadly Raptors? Do you want Ghosts or Spectres? A command centre reactor or automated refineries? I needed to get creative with Protoss ideas, so I may be open to suggestions down the line. But think of leaping Zealots, or of a Colossus that has an anti-air attack. An upgradeable mother ship? The ability to spawn a Zerg Leviathan.\n\nI intend to implement most of the cool things you remember seeing in the campaign, and then will attempt to balance them to the best of my ability.\n\nSome other people have made variations to this idea to some extent, but nothing I can find is complete, or how I envision it all coming together. SoulFilcher has and is continuing to do a fantastic job with his SC Expanded mod, but far more intricate and complex than I intend this to be. I intend to create as much as possible from scratch, as I learn things along the way. In the case where there are already professional looking working versions of units (like Broodwar units such as Reaver, Corsair, Defiler, etc), I will attempt to incorporate these into my mod (with permission and providing FULL credit to the original authors).\n\nI intend to keep a detailed and comprehensive list of patch notes, as you will already see from recent versions.\n\nCurrent Credits:\n\n- Talonis (Button Graphics & Game Testing) \n- SoulFilcher (Zerg Defiler (Model & Data), Terran APC button image + Editor troubleshooting - Forum) \n- Spoolofwhool (Data Editor troubleshooting - Forum) \n- Terhonator (Data Editor troubleshooting - Forum) \n- hobbidude (Data Editor troubleshooting - Forum)\n\n<!-- -->\n\n",
    "author": "_ForgeUser1149830",
    "lastUpdated": "2014-08-04T04:07:10.000Z",
    "screenshots": [
        {}
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}