{
    "id": "stranded-korhal",
    "name": "Stranded on Korhal",
    "shortName": "Stranded on Korhal",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/90/972/62/62/636243299357167442.jpeg",
    "description": "## 2017 Update (6th of March)\n\nA small update which fixed some of the more serious errors/bugs with the game caused by the various official SC2 patches through the years.\n\n- Severely decreased the difficulty by changing the health/damage output of most units\n- The game will no longer skip to the final mission after moving with Nigel. This was due to a bug that any action (ie moving) instead of using a nuclear missile triggered the final cinematic\n- Fixed some cameras that were rendering incorrectly\n- Fixed fog of war visiblity\n- Increased gamespeed from normal to faster\n\n<!-- -->\n\nThere are still some errors in the console, but nothing gamebreaking. Once again you can enjoy the entire adventure Matt and Nigel embark upon!\n\n\n\n\n\n### Introduction\n\n*The brave adventurers Matt and Nigel find themselves on a distant planet far away from home. Their ship 'Prosperity' is just nearing the surface.*\n\nPlay through a series of easy to medium objectives backed up by cinematics and a plotline throughout the whole map. The whole experience takes about 20-25 minutes and should entertain you at least.\n\n### Update 13th of October 2010\n\nFor everyone who is wondering if there will be future maps involving Matt and Nigel, you're in luck. I'm actively learning to utilize a lot of things Galaxy Editor has to offer and I will do my best to master them as much as I can. You'll be pleased to hear that I'm starting to make a complete campaign based around these characters.\n\n[Matt & Nigel (Working Title)](<http://www.sc2mapster.com/maps/maat-nigel-working-title/>)\n\n- The gameplay style will most definitely be like the Wings of Liberty Campaign, so no fancy camera movement etc. The balance between the normal maps (Build up a base and win) and RPG maps (Just a hero and some forces) will be around 50/50 I guess.\n\n<!-- -->\n\n- The story will be playing parallel to the Wings of Liberty story. It may start a little before Jim Raynor starts his rebellion, but it will most definitely have references to Jimmy's campaign in later missions. A couple of missions may stray away from the chronological order of the story though.\n\n<!-- -->\n\n- The vibe of the story may become a little more dark than in Stranded on Korhal, but it won't be overwhelmingly different from it.\n\n<!-- -->\n\n- The story will be elaborated in game as well as Story Mode, where the experience will be much like aboard the Hyperion and the cutscenes in Wings of Liberty.\n\n<!-- -->\n\n- Much of the feedback here has inspired me to even begin this project. I have learned a lot since this map was released and the overall quality will rise tremendously in this campaign. Thank you.\n\n<!-- -->\n\nFor now, say hello to Matt Dalton and Nigel Graham\n\n\n\n## Stranded on Korhal\n\nTo play it, simply open the map in the Galaxy Editor and hit Test Document or CTRL + F9\n\nThis is the first map I made with Galaxy Editor and it was basically a way for me to learn more about all the functions it has. Everything in it was made up after eachother, so I had no plan on what the map would look like when it was done. There are a lot of things I found out halfway through the mapmaking process, so there are definitely some points that could be made alot better when I'd make them from scratch again. But I really wanted to finish this map so that I would get a taste of what it's like finishing a map for once.\n\nTo all you map editors: Feel free to take a look inside the triggers, terraining and everything that will interest you. Maybe you will learn something from it, or you can just laugh at how many pathing blockers I used and make fun of me.\n\n**My apologies for the huge size**; it's from the imported music; it could probably be brought down alot, as most of the time I only use like 20% of the track's total length. (Expect a smaller size in the future)\n\n### Feedback\n\nIf you have the time to give me some feedback that will be really appreciated. Tell me what you liked, tell me what you hated, but most of all: tell me what bugs you found so I can fix them! It can be anything; terrain, cinematics, plotline, gameplay you name it! I for one think there's too much cinematic in it.\n\n### Future Plans\n\nI'm not sure yet if I want to spent alot of time in this map to improve it, there will definitely be voice acting added for one, so look out for that. The triggers were a bit poorly designed and it would be problematic to change the map in difficulty as I would need more space to make that happen the way I want it. However I have learned alot by making this map and the feedback you provided. My future maps will most definitely include:\n\n**Better Characters**: In terms of story and gameplay, the main characters will have worked out characteristics, a backstory and different reactions on certain situations. They will have different roles that compliment eachother, think of it as a WoW party. Around 3 unique abilities will be added to each character to make them better at what they do and more fun for you.\n\n**Skipable Cinematics**: Able to skip cinematics by hitting the ESC button, you guys are gonna love this.\n\n**Checkpoints**: Every time an objective is completed or other significant point is reached, the game will make a checkpoint; making you revert to the last checkpoint should you fail. This will make it possible to make the map more of a challenge. I have no idea how to make this as you can't save games yet, but it should be possible later. I could do it with a real variable tracking the checkpoints and return you to a certain point when you fail, but that forces me to make all the units on the map trigger made, which is alot of work.\n\n### Update 5th of May 2010\n\nSo my laptop officialy died, it doesn't even boot up anymore. Luckily for me I just ordered a new one and got it now. It's a MacBook, so I can't work on the map at this time, when the Galaxy Editor is released for Mac be assured I will make up the lost time and there will be an update for this map soon.\n\nStay tuned for more!\n\n### Update 25th of May 2010\n\nI got Bootcamp fully working with the Galaxy Editor and have updated the map. Now featuring:\n\n**VOICE ACTING** by **Travis Lynch** (OldOneEye1987)\n\n- Better terrain\n- Minor bug fixes\n- Fixed some spelling errors\n\n<!-- -->\n\n",
    "author": "_ForgeUser4360226",
    "lastUpdated": "2017-03-07T19:41:08.000Z",
    "screenshots": [
        {}
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}