{
    "id": "talras",
    "name": "[inactive] Brave Storm ep1: White Rose Wilted (formerly Of Tal'ras)",
    "shortName": "[inactive] Brave Storm ep1: White Rose Wilted (formerly Of Tal'ras)",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/80/396/62/62/636178320990881242.Jpg",
    "description": "(This map was created during the beta. It's very rough, and since then I have learned a TON about how to use the editor. I may in the future make a new series of maps using the same concept)\n\nBrave Storm: White Rose Wilted features triggers, dialog, missions, and a story-line!\n\nYou have been assigned by the resistance group, White Rose, to retrieve the Tal'ras'n Crystal - a crystal with potent psionic energy powerful enough to disrupt the Queen of Blades' communication with the zerg. The local protoss deem the crystal sacred, and will protect it at all costs. The Terran Dominion is also after the crystal, and will use brute force to obtain it if they have to. Being the weakest of the three factions, you'll need to snatch the crystal while the Dominion and and local protoss are locked in battle. At the same time, both factions will use whatever leverage they can to swing the balance of battle in their own favor.\n\nSee the [Campaign's website](</linkout?remoteUrl=http%253a%252f%252fvideogamersworld.exofire.net%252fsc2%252f>)!\n\nThis campaign is BS. You know you want to try it.\n\n## Download the map from the 'Files' tab. You can run the map by dragging it onto your StarCraft II icon.\n\n[http://www.youtube.com/watch?v=64ShrXKjY60](<http://www.youtube.com/watch?v=64ShrXKjY60>)\n\n<div></div>\n\n",
    "author": "_ForgeUser4364091",
    "lastUpdated": "2010-04-28T21:17:51.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/155/531/Screenshot.Jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/155/535/Screenshot000.Jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/155/537/Screenshot001.Jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/155/540/Screenshot004.Jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/155/541/Screenshot005.Jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}