{
    "id": "ultimate-recall",
    "name": "Ultimate Recall",
    "shortName": "Ultimate Recall",
    "installed": false,
    "summmary": "",
    "description": "## FAQ\n\n###### This is remake of SCMR 5.4.3 SCMR.SC2mod file\n\n###### Ultimate recall is mod+maps redone. It is all SC1 campaigns with all warriors from all parets of SC available simultaneously.\n\nFull mod with reworked missions: [https://yadi.sk/d/3fEpOsJmzKFvF](</linkout?remoteUrl=https%253a%252f%252fyadi.sk%252fd%252f3fEpOsJmzKFvF>) Just install the same way as Mass Recall, replace files, if necessary. Installation is only copying files.\n\n###### Manual install\n\n0\\. Find Your SC2 folder. I will reference to it as SC2path. For me it is: E:\\games\\StarCraft II\\ 1. unpack downloaded content wherever You want. 2. Copy folder Mods from this archive (unpacked) into SC2path. You MUST have SC2path\\Mods with files SCMRcinematics.SC2Mod, SCMRmod.SC2Mod Double-check to avoid SC2path\\Mods\\Mods or smth else like this. 3. Copy folder Maps from this archive (unpacked) into SC2path. You MUST have SC2path\\Maps\\Starcraft Mass Recall Double-check to avoid SC2path\\Maps\\Maps\\Starcraft Mass Recall or smth else like this. 3. Create a shortcut or \\*.bat file with this command-line: \"<SC2path>\\Support\\SC2Switcher.exe\" \"<SC2path>\\Maps\\Starcraft Mass Recall\\SCMR Campaign Launcher.SC2Map\" For me it is: \"E:\\games\\StarCraft II\\Support\\SC2Switcher.exe\" \"E:\\games\\StarCraft II\\Maps\\Starcraft Mass Recall\\SCMR Campaign Launcher.SC2Map\" If all actions done right - executing this script or shortcut will run my version of SCMR.\n\n###### Mod-only is workable in any Legacy of the Void build, including 3.7.1, with maps and other assets from SCMR 5.4.3. it POSSIBLE works in later builds of SCMR (with assets and maps)\n\n###### This mod is rework of FILE SCMR.sc2mod. Other assets are not touched. So, with other version of SCMR it may not work\n\nThis is campaign remake of Mass Recall assets. Maps remake will occur later, if anybody or myself will be interested. Requires Legacy of Void. concept: to give player full freedom with all units and abilities of all Starcrafts in Classic storyline campaign. history of creation: when I first saw Mass Recall - I was surprized and wanted to play it. After 5-6 first missions I was deeply boooored of author's attempt of recreation THE ALL 1:1 as it was in 1997-1999, even the bugs! As it said in one ancient proverb, we cannot enter the same water twice, and recreation 1:1 is useless, in my point of view. So, I decided to redo by myself everything I think right. (author(s) of MR position it as GPL, in given license is written, that everything is allowed).\n\n- \\-=IMPORTANT NOTICE=- I've started this project after LOTV came... 'cause of deadly bugs, which made game bad/unworkable/buggy As Blizzard does not seem to stop their all-the-time-development, If new bugs occcur, just use pirated version with cut-off/prohibited updates, or, maybe, somebody could advice way to launch desired version of SC2 core and resources, without any laws or rules violations?\n\n<!-- -->\n\nso, **changes** are here:\n\n- Every of 3-steps upgrades gives also some intersting things, see below.\n- some 1-step upgrades and researches are removed/added/changed.\n- every side can build workers-builders of all 3 sides - feel free to play as who-you-want in any mission.\n- Every side has Mind Control and it can be used on any unit - feel free to play as powerful telepath.\n- Supply is 600 for each side. Feel free to play as Westwood fan, if You want :-)\n- Every side can BUILD hi-rate mineral harvester: MULE, Replicant (Replicate ability removed from it and given to High Templar Phantom Master, also can harvest now), Huge Drone (looks exactly like Drone, but very huge and can only harvest - as-is from editor)\n- Every target-weapon-as-ability, e.g. sniper shot, is autocast and has optimal autocast filters.\n- underground Zerg artillery cannot attack Hover units.\n- sides changes:\n\n<!-- -->\n\n### TERRAN:\n\n- \\- all armor upgrades give also +10% of life, like Swann's side in Coop.\n- \\- all troopers have Stimpack.\n- \\- multiple changes in ranges, ROFs, sight, enemy seek ranges, etc.\n\n<!-- -->\n\n###### all units:\n\n- Marine. starts as SC1 Marine, upgrades to Raynor's very durable and strong marine.\n- Firebat. Starts very tough to make it useful. upgrades to very tough flame-trooper. Flamethrower is great anti-bio and anti-small.\n- Reaper. Has all \"native\" things, found in Editor: regen, stim, cluster bomb, ... Now is Hover.\n- Marauder. As Raynor's Marauder.\n- Hellbat-hellion. As found in Editor. Flamethrower is great anti-bio and anti-small.\n- Medic. Starts as SC1 Medic, upgraded to durable 2nd-line specialist.\n- Ghost. Has Snipe, Mind Control, Lockdown, Nuke. energy is 300/400. After all upgrades can be cloacked permanently, but regens energy much slower when cloacked.\n- War Pig Marine. Has Grenade.\n- Cerberus Firebat. Has Chemical Missile.\n- Hammerhead Marauder. Has Explosive Missile.\n- Hand of Doom Reaper.\n- Skibi's Angel Medic. Has Mend.\n- Pygalisk. Genetically modified small Ultralosk. Has Stim, Lifeforce regen (very fast regen rate) and Burst Charge - like Zealot's Void Charge ability (ignores obstacles while charging on target).\n- Vulture. Mira's forces Vulture from WoL. Regenerative. anti-bio, anti-small atacks. Has attribute Hover - cannot be attacked by Zerg underground weapons. is Hover.\n- Tank. no more Siege upgrade, Siege is available from the beginning, all others like it was done by authors of Mass Recall. Range returned to SC2 value, as all other Ranges of attack and seek.\n- Mjolnir. Heroic Tank. Uses Siege Breaker model and Duke's cannons. Limited to 4 on battlefield?under construction.\n- Goliath. Like it was in very early build of SC1. Very powerful combat walker.\n- Cerberus Goliath. Heroic Goliath, Has 300 health and more powerful weapons. Limited quantity.\n- Salamander-451F. Flametank. Heroic Hellion. Uses model of Outback hunter, size is like original model. Limited quantity. Cannot transform.\n- Cyclone. Redone to be as powerful as Archon.\n- Widow Mine. As is from Editor. Requires Spider Mines upgrade (in storyline invented by Raynor's technician, who assembled ordinal spider mines for Raynor)\n- MULE. Now can be built from Command Center, requires Factory, costs 150 minerals, does not expire. All other properties are the same.\n- Diamondback. As Raynor's fully upgraded version. Has attribute Hover - cannot be attacked by Zerg underground weapons.\n- Thor. As in Editor. Has weaponswitch button.\n- Odin. Hero unit. Can be only 1 active or under construction Odin. Has it's cannon barrage!\n- warhound. Has AG+AA Railgun attacks. Has Haywire Missile ability.\n- predator (robotiger). Stats changed, always cloaked, use regenerative steel.\n- wraith. Starts as SC1 wraith. After upgrades can be permanently cloaked. Now can fire-on-move and AA with AG weapons are independent. Has Afterburner speed-up ability and Powershield.\n- Banshee. Used Dusk Wing with all stats as-is ('cause of Banshee was redone for smth else). cloaking is the same must-do research, as for Wraith.\n- Valkiry. As done by SCMR team. Cost lowered to 125/125. Can be upgraded for range.\n- Viking. Used pirate mercenary as-is. Due to sharing data with \"conveyor\" model, speaks like Valkiry (German girl). I do not interpret this as a bug, 'cause of pilot is in full helmet, so gender is not a bug.\n- Liberator. As uses Mengsk in storycampaigns and fake Amon's terran in coop.\n- Medievac. As-is from Editor. Has rapid drop, afterburner, dual heal. Can be upgraded for more troops-places.\n- Hercules. As-is.\n- Battlecruiser. Modified to be useful. \n- Wanderer Decken. Heroic pirate Battlecruiser. Modified to be useful. Only 1 alive or being built per time. Fire rate increased, power increased, Yamato is auto-attack.\n- Cerberus capital ship. Called from Command Centers, costs very much, appears immediately. Only 1 on battlefield.\n- Science Vessel. NanoRepair is added from Space Station (does not use Energy).\n- Magellan. Heavily customized Science Vessel. Called from Command Center. Only 1 on battlefield. Has unreliable lightning weapon, cloaking field from Mothership and plasmashield like Protoss.\n- Raven. Demping Aura is added. slows enemied to 0.2/0.2 attack and move speed. health 100, has 20 Shield with Debuff Attack till 10 behavior, like WoL Immortal.\n\n<!-- -->\n\n###### Structures:\n\n- command center. Now has Crucio Shock cannon like Siege Tank Sieged and Longbolt missile system like Missile Turret. Can be upgraded to Mercenary Fortress.\n- Mercenary Fortress. Has 2500 health, cannot fly, cannot use or build addons, has artillery as Duke and Havoc AA system as Mira's Mercenary Fortress\n- Engineering Bay. Has 1250 life, like in very first build of SC1.\n- Bunker. Now starts from 350 life, like in SC1, can be multiple time upgraded.\n\n<!-- -->\n\n###### Added/changed upgrades:\n\nAcademy:\n\n- U-238 now affects ALL Gauss cannons: Marine, Goliath ground attack, Viking in ground mode, Raven's turret, Shrike turret. Cost 250/250.\n- Stim. Affects all troopers. Has 2 levels: 1st just allows it, 2nd lowers health cost to 1.\n- Shield. Affects Medic and Marine. Changes health and models.\n- Environmental Suite. Affects Firebat, Marauder, Marine. FB and Marauder's health is doubled, like Swann's side in coop, Marine gets +5, to fit SC2's 55 health.\n- Bunker Neosteel frame. Adds 2 places for troopers, as in WoL and sportversion SC2.\n- Shrike turret. can be done after Frame. Adds Shrike Turret. Shrike Cannons now deals 12 damage, 'cause there are 2 of them, it is normal that everyone shoots like 1 C-14 Rifle, but not like \"halved rifle\" in WoL.\n- Building armor. Adds +2 armor to all buildings and much life to defensive buildings. Something between Masony in WC3 and NeoSteel Armor in SC2\n- Restore REMOVED. Instead of it, upgrade for nano-nozzles, as in coop, implemented. Range of flamethrowers-forward, AoE of flamethrowers side-wide, range of Healing by Medics, Medievacs and Nano-repair increased. -=FOR MODDERS:=- it just replaced actions for Restore upgrade and removed button from Medic's UI, so in editor it is still Restore upgrade. Medic has Restore as-is, upgrade does not needed.\n- Flare. Range increased to 13 and made autocast to be of any use. Automaticaly casts only on Detectors.\n- Caduceus. Increases Energy to Medics and Medievacs.\n- Advanced SCV onboard computer. Allows multiple SCVs to build one structure as faster as many attached to job. Also doubles repair speed, all like in WoL.\n- Fire suppression systems. After multiple tries and testing, made it as 2-step upgrade: advanced SCV onboard computer and Firesuppression bots. Fire suppression now heals till 100%.\n\n<!-- -->\n\n###### Machine Shop\n\n- Ion boosters. Now increases speed for Vultures and Diamondbacks.\n- Spider Mines. now allows 6 mines and mine-assembling, like in WoL, allows Widow Mine also, because it's designs are based on Spider Mine.\n- Drilling Claws. As in Editor. Perhaps, will redo.\n- 2 upgrades for Cyclone, as-is.\n- Charon boosters. Now affects all missile weapons: Goliath AA, R-turret, Wraith's AA, Thor's and Odin's missile AA.\n- Hi-sec tracking. Adds +1 range to Point-defense drone, Ghost rifle (surprise!).\n\n<!-- -->\n\n###### Control tower:\n\n- Cloaking system. The same, but applies to Banshee too.\n- Energy upgrade. The same, but slightly increases regen rate, so, Wraiths and Banshees can be always cloaked. Will redo such way, that Energy will be very low, smth like 50, regen fast, to not be 1-shot by Feedback\n\n<!-- -->\n\n###### Covert Ops:\n\n- Cloak device. As is.\n- Moebius Power core. Now adds +100 power, increases power regen so much, that Ghost can be permanently cloaked and still regen Energy (it was really booooooring to wait while specialists regen energy - so, they all have always ENOUGH it).\n- Ocular implant. Now not only increases sight and fire range, but also ranges of all abilities AND allows Sniper Shot. SS cost 20 energy and has cooldown 10 secs.\n- Lockdown. The same, but costs 20 Energy.\n\n<!-- -->\n\n###### Physics Lab:\n\n- Behemoth reactor. Adds much power points and power regen rate, increases attack speed of BC and Wanderer Decken.\n- Yamato. as-is.\n\n<!-- -->\n\n### ZERG:\n\n###### Units:\n\n- changed speed of movement and attack. Increased drastically to be more realistic and intersting.\n- oncreep speed now x2 for all, but Hydralisk, Hunter Killer, Ultralisk all strains. Hydralisk and HK x3, Ultralisk - no bonus.\n- zergling. Faster. Feels like Fire in Atrox. Can be upgraded drastically.\n- \\-Hunter. Made from Zergling. Has only Spawning Pool as requirement, the same as Sarah's in HotS.\n- \\-Splitterling. Made from Zergling. Can move burrowed now, other properties the same as in HotS. Has anti-necro agent, heling bio-friends, like Abathur's genetic template.\n- \\-Raptor. Made from Zergling. Has 70 life, other ways the same as in HotS. ...will be continued... (...and much more for Zerg and Protoss - will write, if somebody will be interested in this mod).\n- Hyrdalisk. Faster, stronger, moves burrowed, attacks x3 faster on creep.\n- Lurker. Morphs from Hydralisk. Requires only Den. Attack speed changed to Multiplayer Lurker's weapon speed.\n- Impaler. Morphs from Hydralisk. Requires only Den. Attack speed changed to Multiplayer Impaler's weapon speed.\n- Hunter Killer. Just double Hydralisk firepower and health. Is Massive, 4-cells as cargo, cannot move burrowed.\n- Roach. Now uses debilitating saliva and has purple color scheme, like Vile from HotS.\n- Ravager. As in Abathur's gameplay.\n- Swarm Host Carrion. Morphs from Roach. The same as in HotS, but uses all templates available.\n- Swarm Host Creeper. Morphs from Roach. The same as in HotS, but uses all templates available. Abilities:\n- Plague is more prolonged.\n- Fungal Growth is like Zergish Nuke, but in less region - kills everything\n\n<!-- -->\n\n## Protoss:\n\n- All units from all parts and releases of SC are added.\n- Fenix-Talandar also added as robotic melee combatant.\n- Artificial Zealot is made from Robotic Facility, has higher price and 200/100 stats. Is larger and more dangerous. Has Punishment field the same as Terran Predator (robotiger).\n- Zealot with axe has different stats and called Fanatic. Also has Overpowered ability, which acta as Fury of Hydralisk (simply activates Fury behavior).\n- Ordinal Zealot has stats 80/80 but has bonus SoulSteal ability.\n- Nerazim Zealot mow is invisible and has minimal possible collision range (if he can void-shift, he must be \"ghosty\").\n- Stalker of Nerazim is now Strider: weak, but invisible shooter, like Strider in Armies of Exigo. Made from Gateway.\n- Purifier Stalker made from Robotic Facility. as-is in editor: 3-time Blink, Shield fast regen to full 1 time per 60 seconds.\n- Reaver has LOTV Blink reactor to make it of any use :-)\n- Sentry of Artanis now has anti-missile ability, like PointDefenceDrone.\n- Sentry of Purifiers now has 20 sight while phased.\n- Sentry of Alarak now has sight 18 and AttackRange bonus 4. 18 means 14+4 to make it also highlight ground for long-range artillery at maximum \"aura\" radius of 4.\n- Observer has the same Squad Sight ability. I just gave it as-is from MP Observer.\n- Oracle can fire-on-move if cannon enabled, also is Detector and has anti-missile system.\n- High Templar from Aiur is untouched. Psi Storm cast over friendly shielded units recharges shields.\n- HT of Alarak the same, but both his weapon abilities are autocast.\n- HT Phantom master has Hallucination like in SC1 and Replicate.\n- Colossus of Purifiers has Voidlegs property from editor, can be attacked only with AA weapons.\n- Colossus of Taldarim in invisible.\n- Reaver has all upgrades from SC1, and teleports to nearest Nexus instead of death, once per 60 seconds.\n- Archon. Is Hover. Is MUCH more durable. After upgrades gets all abilities from AIUR Templar and Punishing Aura.\n- Dark Archon. Is Hover. Is MUCH more durable. Has Mind control, Maelstrom, Feedback, Confusion. All, but MC, are autocast.\n- (All wanted is done. DESCRIPTION will be continued) Just download and see :-)\n\n<!-- -->\n\n## Future plans\n\n- add Warp/Drop technology for at least Terran and Protoss to make them send new units directly to battlefield, like in WOL/LOTV. I am working 1 year on this mod, lots of stuff is done, adding Warp needs much of dull drudgery, so not yet done.\n- add aggressive fauna on maps.\n- maybe will be done as branch: different tech tree for each \"story arc\" of levels to fit story and to make game more interesting. e.g. Mengsk's forces will have his advanced units from SC2 enemy Mengsk's forces, Raynor's levels will have Mercs as ordinal units, UED's levels will have something different, etc. BUT it MAYBE will done and not soon.\n\n<!-- -->\n\nINSTALL: 1. Download and install Mass Recall from this site. 2. Find and replace campaign data file with my.\n\nFull mod with reworked missions: [https://yadi.sk/d/3fEpOsJmzKFvF](</linkout?remoteUrl=https%253a%252f%252fyadi.sk%252fd%252f3fEpOsJmzKFvF>) Just install the same way as Mass Recall, replace files, if necessary\n\n",
    "author": "aduntassadarzeratulfenix",
    "lastUpdated": "2017-03-21T11:17:12.000Z",
    "screenshots": [
        {}
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}