{
    "id": "vespene-dreams",
    "name": "Vespene Dreams",
    "shortName": "Vespene Dreams",
    "installed": false,
    "summmary": "",
    "description": "## Overview\n\nThis map is intended as the standalone first chapter of a possible campaign featuring the voyage and deeds of legendary starship captain Euss Sly. The campaign would be set in the Starcraft universe (in that there are Terran, Zerg, and Protoss units, and possibly some familiar planets), but it would recount a voyage through more or less unexplored space on the outskirts of any inhabited systems. It would be written as an homage to Homer's Odyssey (Euss Sly is an anagram for Ulysses) and would follow the general plot arc of the epic poem, with each chapter (short map) corresponding to a chapter of Homer's work.\n\n\"Vespene Dreams\" corresponds to the \"Lotus Eaters\" chapter of the Odyssey, and its plot has been mostly planned out. Like the other intended maps, it will feature a main \"puzzle\" component and a main \"action\" component. The puzzles will vary greatly in nature but will generally deal with navigating to or a accessing a new area. The action will be similar to what you might experience when controlling a party of heroes in a real-time RPG, but with more of an RTS feel.\n\n<br>\n\n---\n\n<div style=\"text-align:center\"><h3><a href=\"http://www.sc2mapster.com/maps/train-system/\" rel=\"nofollow\">The Train Puzzle</a></h3><p>Here is the concept for the main puzzle component of Vespene Dreams:</p><iframe allowfullscreen=\"allowfullscreen\" src=\"https://www.youtube.com/embed/vcD31ugh29A?wmode=transparent\" height=\"358\" width=\"638\"></iframe><p>Additionally, <span style=\"color:#f00\"><strong>I've added the Train System as a separate project that anyone can use and implement in their maps</strong></span> (per the License for this project and the conditions outlined in the map documentation). It now features a new speed parameter and smoother motion during turns. I think that many of you might find it useful, even just as part of the scenery, and I hope that all of you will try it out. Here is the <a href=\"http://www.sc2mapster.com/maps/train-system/\" rel=\"nofollow\">link</a>.</p></div>\n\n---\n\n<br>\n\nVespene Dreams should be completed by mid-June.\n\n",
    "author": "_ForgeUser4350394",
    "lastUpdated": "2010-05-18T04:36:28.000Z",
    "screenshots": [
        {}
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}