{
    "id": "volontedelareine",
    "name": "La volonté de la Reine",
    "shortName": "La volonté de la Reine",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/80/125/62/62/636178318196638154.jpg",
    "description": "Cette map relate les péripéties de la Reine des Lames, cherchant à étendre toujours plus son contrôle sur les nuées Zerg, entre les deux Guerres. L'histoire n'est pas canon (ndla : elle n'est pas inscrite dans l'histoire officielle de Starcraft), mais reprend quelques acteurs bien connus de ceux qui auront joué à SC1. Une map somme toute assez humble, qui je l'avoue a été créée pour me familiariser avec l'éditeur (je n'avais pas créé de campagne depuis le StarEdit de SC1). Elle implique une suite, qui viendra sans doute bien assez tôt.\n\nPubliée sous licence GNU v3. Vous pouvez la reprendre, l'améliorer et la publier sous GNU v3, mais je vous demanderais de citer l'auteur original, par simple mesure de respect. <span>:)</span>\n\nN'hésitez pas à reporter tout bug que vous trouvez dans les commentaire ou à l'adresse mail darthhydrae@gmail.com.\n\n~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~~~\\-~~\\-\n\nThis map tells the story of the Queen of Blades, seeking to extend full control over the Zerg Swarm, between the two Great War. The story is non-canon (i.e : it's not included into the official Starcraft storyline), but you will find some actors you may have found into SC1 Campaign. It's a quite simple map that I've created, I admit, to make myself more comfortable with the SC2 Editor (I haven't created a campaign since SC1 Staredit). This map implies a sequel, that will come when I'll find the time.\n\nPublished under GNU v3 license, so you can take it, modify it, and publish it as you want. I just want you to quote the original author, as a simple measure of respect. <span>:)</span>\n\nPlease reporte any bug in comments, or at darthhydrae@gmail.com.\n\n",
    "author": "_ForgeUser2551017",
    "lastUpdated": "2013-03-17T20:36:15.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/154/567/Starcraft-Sarah-Kerrigan.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}