{
    "id": "war-heaven",
    "name": "The War in Heaven",
    "shortName": "The War in Heaven",
    "installed": false,
    "summmary": "",
    "description": "## The War in Heaven\n\nWhat is the War in Heaven? This is a campaign of give or take fifteen missions divided into three chapters.\n\nAs resources are developed, I will post them. As opposed to posting each map as they are finished, I will post each chapter as it is finished.\n\nThe campaign will not take place in the Starcraft canonical universe for a number of reasons, the primary reason because I like to be extra speshul. While I considered making the campaign from the point of view of the Dominion pre-Valerian, and having that annoying twerp die or something, I didn't. So there's that.\n\nThe chapters will be as follow:\n\n### Confederacy Rising\n\nControl the Confederacy of Arms, a military coalition dedicated to repelling extra-planetary threats that have begun to emerge. Lacking efficient means of space travel, your overarching objective is to down an alien vessel and then scavenge alien technologies to develop a system of FTL travel.\n\n- Fight threats far beyond the scope of your basic infantry training \n- Encounter a savage race of creatures that show an intelligence that surpasses first appearance. \n\n<!-- -->\n\n#### Levels(With completely arbitrary percentages):\n\n1. CRIN - Intro [0%] \n2. CR00 - The Mothership [0%] \n3. CR01 - Ion Cannon [0%] \n4. CR02 - Burning Skies [0%] \n5. CR03 - Quadium [0%] \n6. CR04 - Area 51 [0%] \n\n<!-- -->\n\n### The Chase\n\nPursue the remnants of the first alien invasion fleet in the aftermath of the space battle that determined the fate of your planet so that you may discover the location of their own homeworld so that you may maintain a diplomatic relations, or at least push the offensive to them. The Confederacy has determined that it shall deploy its only two FTL vessels in the pursuit of the enemy fleet, the CSS Behemoth and the CSS Interstellar in this quest, and command of these vessels have been transferred to you.\n\n- Pursue the scattered remnants of an alien fleet deprived of their mothership. \n- Encounter a slew of new and unique planets in the course of your pursuit. \n- Solve the mysteries of a cruel and ancient universe, only to find its a whole lot crueler. \n\n<!-- -->\n\n#### Levels(With completely arbitrary percentages):\n\n1. RDIN - Intro [0%] \n2. RD00 - El Camino [0%] \n3. RD01 - Strike the Earth [0%] \n4. RD02 - The Crash [0%] \n5. RD03 - Castaway [0%] \n6. RD04 - Boarding Maneuvre [0%] \n\n<!-- -->\n\n### The War in Heaven\n\n???\n\n- Who knows!? \n\n<!-- -->\n\n### A Confederate Cowboy's Guide to the Frontier (The Frontier)\n\n???\n\n#### Factions You Will Probably (Maybe) Encounter:\n\n- The Confederacy of Free Planets, an empire forged in blood and still in its infancy. Wracked constantly by war and revolution, still it manages to blossom, like a weed, but blossom all the same. You are at the forefront of this growth, whether you like it or not. \n\n<!-- -->\n\n- The Kig'Yol, a race of insectoids with a rather unique and devastating combat proficiency. There's a reason that a true Confederate loves the heat, and it ain't because Kulan's a desert, boy. \n\n<!-- -->\n\n- The Malleus Maleficarum, the traitor legions, led by a charismatic and mysterious figure. \n\n<!-- -->\n\n- The Ver'Dun, a venerable race of nomads, they have come upon the Confederate worlds hoping for peace, but see only war. \n\n<!-- -->\n\n- The Nil'Yeth, a race of fun-loving hooligans who many suspect are the only reason the Confederacy exists, what, with their donating trillions of credits to it. Always good to have at a party. \n\n<!-- -->\n\n#### Mechanics\n\n- In Confederacy Rising, exploit a proliferation of tactical resources to make sure at least a few of your squad-members survive. Swap out abilities constantly, adapting to the map as the map throws itself at you. \n- In The Regime of Death, select a set of a permanent abilities at the beginning of each level, making decisions based on tactical info. Trade on-the-run adaptability for war power. Beware! Even the best tacticians sometimes are wrong. \n- In The War in Heaven, throw armies at each other and watch as the galaxy burns. (Maybe? I honestly don't know, really.) \n- In The Frontier, manipulate existing forces to achieve your goals, engaging in direct combat only when it makes you a space badass. \n\n<!-- -->\n\n#### Disclaimer:\n\nThis is my first campaign ever. EVER. It will be a ride, and I'd like any critique, feedback, advice, or assistance that you're willing to offer. Currently, I can struggle through terraining and data editing, as well as creating story elements on my lonesome, but while I plan to have voice acting, it currently seems that the universe is going to have a whole lot of testosterone. Maybe some of you female video gamers (hah, insert overused yet timeless joke here) could remedy that? Male voice actors do not despair! I could always use some variety. PM me, and when I have a selection of lines ready for potential and available characters, I'll send them to you.\n\n##### Date Features Required:\n\nPlease advise on the possibility, implementation, or even existence of these ideas:\n\n- Immersive cover system. \n- Limited ammunition \n- Vehicles that can be manually driven. \n- Anything else that you'd think would be awesome. \n\n<!-- -->\n\n",
    "author": "_ForgeUser9851168",
    "lastUpdated": "2015-01-27T01:58:45.000Z",
    "screenshots": [
        {}
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}