{
    "id": "war-duality-wod",
    "name": "War of Duality (WoD)",
    "shortName": "War of Duality (WoD)",
    "installed": false,
    "summmary": "",
    "description": "## War of Duality\n\nNote: All subjects seen here are what our end goal is at the moment, and none of them represent our current project state. The current project state will be detailed in a later, clearly marked section.\n\n### Concept\n\nIn pursuit of competitive gameplay style, War of Duality takes the basic Blizzard melee tech trees, and adds to it. As any Starcraft 2 player knows, a 1v1 in Starcraft is as much a game of quick wits and strategy as it is efficient spending and correct decision making. War of Duality introduces a second concept to the game; Heroes. These are not typical RPG heroes, however. Heroes in War of Duality aim to emphasize micro and constant attention. Our hope is to equally balance the skill required to play Hero and Ladder. The ladder player is therefore faced with an entirely new decision making process with the addition of Heroes. The upgrades for heroes are not purchased by the heroes themselves, but are purchased by the ladder player. The birth of a whole new genre of builds would (hopefully, at least) occur with a focus on hero investments. Ideally, a player who invests as much money into a averagely skilled hero would receive as much of a return as a player who, with average micro control, spends the same amount of money into an army.\n\n### Gameplay\n\nWar of Duality is a game comprised of 2 teams, with 3 players each. Each team possesses one 'ladder' player and two hero players. In the lobby, teams would be randomly distributed based on the join order, and a dropdown box is available to display your preferred role. This dropdown box has no real effect on ingame role choice, and is simply meant for informing other players of your pre-game preference. The 'race' dropdown serves the same purpose. Ingame, players are presented with a GUI that truly sets their roles. There will be a total of 18 selectable heroes, 6 of them to be released as an expansion pack. Each hero having its own unique functions and abilities as well. For those daring enough to try, a random box is available, while also having all 3 races available for ladder players. The GUI forces players to create suitable teams. (1 Ladder player, 2 Heroes) Ingame, Heroes are capable of respawning at any 'command base', as in a Hatchery, Lair, Hive, Planetary Fortress, Orbital Command, Command Center, or Nexus that is allied. These command bases can also use a heal ability that is only usable on heroes. If you happen to need extra players, the AI is functional, while not the same as a real player. Ladder players, upon clicking a hero, are presented with a modified hero command card and can purchase upgrades for the hero they selected through that command card. Each hero will possess unique upgrades, as well as similar upgrades to every other hero. (Example: Void Stalker is capable of receiving an upgrade to his 'Speed Boost' ability, and also an upgrade that upgrades his base attack. Raynor doesn't have a speed boost ability, but does have an upgrade for his base attack.) There will also be a map rotation using popular maps including ones used in professional tournaments.\n\n### Current Project State\n\nAs of the newest version, the map contains all 12 of the planned 12 initial heroes. The remaining 6 heroes are currently being developed. Our current goal is polishing abilities and weapons so the existing heroes can be more complete. If anyone is actually willing to provide suggestions for abilities or weapons, we are willing to read them. If they're overpowered, we can balance them at a later date. As well, the maps terrain is actually Shakuras Plateau for the moment. We didn't want to construct the terrain for an arena when we didn't know what kind of heroes would be fighting in it, yet. As such, we're putting that off for now. We've been doing intermittent closed alpha tests of the trigger GUI in the beginning to make sure that everything functions appropriately. However, with the map becoming more playable, we are moving into the beta stage and encourage everyone to help us spread the word and play. The map is currently playable by the public, and right now, we're fairly confident that it is bug free. Additionally, we have added in the HotS units. Have fun!\n\nIf anyone wants to help test, or provide feedback, I can be contacted at Zetal.603 or Fishy.543.\n\n![Picture of Every Hero](<http://i132.photobucket.com/albums/q25/MikeyIsMYNameNotYOURS/Heroes.png>) (Fuzzy picture is due to stretching... not sure how to fix that. =\\ Whatever.\n\nCurrent Total Progress: 95%\n\nCurrent Project: Balancing\n\n[Submit bug reports here.](<http://www.sc2mapster.com/maps/zergling-rush/forum/29905-glitches/#p1>)\n\n",
    "author": "fishy116",
    "lastUpdated": "2011-11-22T22:55:32.000Z",
    "screenshots": [
        {}
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}