{
    "id": "wip-sc2es-jungles-belshir",
    "name": "[WIP] SC2ES: The Jungle's of Bel'shir",
    "shortName": "[WIP] SC2ES: The Jungle's of Bel'shir",
    "installed": false,
    "summmary": "",
    "description": "## SC2ES: The Jungle's of Bel'Shir\n\nThis project started out with the idea of creating an easily expandable dungeon crawler / miniboss / boss battle mod and trigger system and is now developing into a full project. ![The Jungle's of Bel'shir](<http://i539.photobucket.com/albums/ff360/Bruschistabby/banner.jpg>)\n\nHero's (roles they can play)\n\n- Twinblade - Close Combat Fighter (melee DPS) \n- Shadow Walker - Stealth Assassin (melee DPS) \n- Marine 2.0 - Ranged Arms Expert (ranged DPS / support abilites) \n- Phantom - Ghost who excels in both ranged and psionic abilities (ranged DPS / spell DPS) \n- Mindsage - Able to bend electricity with his mind this is a powerful spellcaster. (spell DPS / support abilities) \n- MBV - The most unique hero in this mod. Mobile Base Vehicle supports other hero's by being able to build many various structures during combat. Able to maintain a certain amount of structures at once the MBV user will have to decide what their party needs the most. (support / ranged dps / spell) \n- Guardian - Providing spell damage as well as party support abilities this class unique (spell DPS / Support) \n- Combat Medic - Providing mainly support spells this Medic excels at healing the wounded. (support) \n- H. Marauder - Able to absorb massive amounts of damage as well as maintain target priority (tank) \n- Eternal - Able to practically nullify any blow for limited amounts of time the Eternal is perfect for defending high burst damage (tank) \n\n<!-- -->\n\nThis project is under development more will be added here later. Right now I am focusing on the game itself. ![](<http://i539.photobucket.com/albums/ff360/Bruschistabby/phantom.jpg>)![](<http://i539.photobucket.com/albums/ff360/Bruschistabby/twinblade.jpg>)![](<http://i539.photobucket.com/albums/ff360/Bruschistabby/mindsage.jpg>)\n\nChange log: (Will be used once I am done with Closed Alpha)\n\nWebsite: Not online yet. coming online within the month.\n\nContact PsyNami.518 in game or Nami@Psygaming.com if you are interested in joining the Closed Alpha Tests.\n\n",
    "author": "_ForgeUser6985960",
    "lastUpdated": "2011-06-14T04:45:57.000Z",
    "screenshots": [
        {}
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}