{
    "id": "zerg-hunter-rpg",
    "name": "Zerg Hunter RPG",
    "shortName": "Zerg Hunter RPG",
    "installed": false,
    "summmary": "",
    "thumbnail": "https://media.forgecdn.net/avatars/thumbnails/81/304/62/62/636178330237278710.jpg",
    "description": "Zerg Hunter RPG: Betrayal is part 1 of 5 of a story-driven RPG series. (Now available in NA, EU, and SEA)\n\n[www.zhrpg.net](<http://www.zhrpg.net/>)\n\nSome of the features:\n\n- 15 distinct heroes divided into 6 Terran, 6 Protoss, and 3 unlockable champions \n- Unique skill trees reminiscent of Diablo II, with 6 active skills and 8 passive perks per hero (in map 1). With 10 maximum points per skill/perk, you would need to be higher level than is available to maximize them all, making your hero unique to you. By map 5, it goes up to 19 different skills/perks per hero (228 total!) of which 47% can be filled. \n- Many new active and passive skills that do not exist in the game \n- Loot, loot, loot (over 100 items) \n- Hardcore mode that disables hero resurrection \n- Insane mode for those that want a greater challenge \n- New Town Portal system: go back to base from anywhere and teleport back anywhere you have visibility (including allied vision). \n- Enemies scale with players, so one player can tackle the map as well as four could, but the map is meant to be a co-op tactics rpg. \n- Epic story telling via skippable cinematics. Watch the plot if you want, keep trashing monsters if you don't. \n- Persistent hero that you take with you to the subsequent chapters \n- Map 6 will be a tournament style pvp map where you will be able to load your saved max level hero to compete against other players in what will hopefully become a large database of player submitted arena maps. \n\n\n\nFeedback and suggestions are appreciated.\n\n",
    "author": "_ForgeUser4823458",
    "lastUpdated": "2010-10-07T16:53:24.000Z",
    "screenshots": [
        {
            "src": "https://media.forgecdn.net/attachments/158/433/zhrpg_heroes.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/158/435/ZHRPG_Betrayal_screen.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/158/437/ZHRPG_Jorson.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/158/440/ZHRPG_old_version.jpg"
        },
        {
            "src": "https://media.forgecdn.net/attachments/158/442/sc2__zhrpg_by_addinarr-d346cgf.jpg"
        }
    ],
    "patchNotes": [],
    "mods": [],
    "maps": []
}